{
  "source": "ArXiv",
  "filename": "044_Digital_Twin-Assisted_Controlling_of_AGVs_in_Flexi.pdf",
  "total_chars": 17874,
  "total_chunks": 27,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nThisistheauthor’sversionofanarticlethathasbeenacceptedforpublicationinthe2021IEEE30thInternationalSymposiumonIndustrialElectronics(ISIE). Changesweremadetothisversionbythepublisherpriortopublication.Thefinalversionofrecordisavailableathttps://doi.org/10.1109/ISIE45552.2021.9576361.",
      "size": 296,
      "sentences": 2
    },
    {
      "id": 2,
      "content": "thInternationalSymposiumonIndustrialElectronics(ISIE). Changesweremadetothisversionbythepublisherpriortopublication.Thefinalversionofrecordisavailableathttps://doi.org/10.1109/ISIE45552.2021.9576361. Digital Twin-Assisted Controlling of AGVs in\nFlexible Manufacturing Environments\nMohammad Azangoo1, Amir Taherkordi2, Jan Olaf Blech1,*, and Valeriy Vyatkin1,3\n1DepartmentofElectricalEngineeringandAutomation,AaltoUniversity,Espoo,Finland\n2DepartmentofInformatics,UniversityofOslo,Oslo,Norway\n3DepartmentofComputerScience,ElectricalandSpaceEngineering,Lulea˚ UniversityofTechnology,Lulea˚,Sweden\nEmails: mohammad.azangoo@aalto.fi, amirhost@ifi.uio.no, jan.blech@aalto.fi, valeriy.vyatkin@aalto.fi\nAbstract—Digital Twins are increasingly being introduced for industrial automation, examples of Digital Twins range from\nsmart manufacturing systems to improve the efficiency of the geometric models of a workpiece or a machine, to predictive\nmain disciplines of such systems.",
      "size": 971,
      "sentences": 3
    },
    {
      "id": 3,
      "content": "mation, examples of Digital Twins range from\nsmart manufacturing systems to improve the efficiency of the geometric models of a workpiece or a machine, to predictive\nmain disciplines of such systems. Formal techniques, such as\nmodels based on neural networks. In this context, we are\ngraphs, are a common way of describing Digital Twin models,\nprimarily interested in Digital Twins that can be described\nallowing broad types of tools to provide Digital Twin based\nservices such as fault detection in production lines. Obtaining using formal description mechanisms such as graphs.",
      "size": 579,
      "sentences": 4
    },
    {
      "id": 4,
      "content": "s that can be described\nallowing broad types of tools to provide Digital Twin based\nservices such as fault detection in production lines. Obtaining using formal description mechanisms such as graphs. We\ncorrect and complete formal Digital Twins of physical systems believe that the use of formal descriptions will make the\ncan be a complicated and time consuming process, particularly Digital Twin easier to be applied from different requirement\nfor manufacturing systems with plenty of physical objects and\nperspectives, such as formal consistency analysis or fault\ntheassociatedmanufacturingprocesses.Automaticgenerationof\ndetection. Digital Twins is an emerging research field and can reduce time\nand costs. In this paper, we focus on the generation of Digital The automatic generation of Digital Twins is an emerging\nTwinsforflexiblemanufacturingsystemswithAutomatedGuided research field and can save time and reduce costs.",
      "size": 927,
      "sentences": 5
    },
    {
      "id": 5,
      "content": "focus on the generation of Digital The automatic generation of Digital Twins is an emerging\nTwinsforflexiblemanufacturingsystemswithAutomatedGuided research field and can save time and reduce costs. It can also\nVehicles(AGVs)onthefactoryfloor.Inparticular,weproposean respond to high demands from industries that want to digitize\narchitectural framework and the associated design choices and\ntheir production lines and systems [3]. For the generation of\nsoftwaredevelopmenttoolsthatfacilitateautomaticgenerationof\nDigital Twins we may create a simulation model and specify\nDigital Twins for AGVs. Specifically, the scope of the generated\ndigitaltwinsiscontrollingAGVsinthefactoryfloor.Tothisend, its connection to the real system. In this way, any form of\nwe focus on different control levels of AGVs and utilize graph available information in the project life cycle can be used to\ntheory to generate the graph-based Digital Twin of the factory acceleratethegenerationofDigitalTwinsinanautomaticway.",
      "size": 999,
      "sentences": 5
    },
    {
      "id": 6,
      "content": "and utilize graph available information in the project life cycle can be used to\ntheory to generate the graph-based Digital Twin of the factory acceleratethegenerationofDigitalTwinsinanautomaticway. floor. There exists some sporadic content in the academic literature\nIndex Terms—industry 4.0, agile manufacturing, AGV, digital\nabouttheautomaticgenerationofDigitalTwins,howeveritis\ntwin, graph theory, multi-layer control\nvery limited and also focused on specific issues. Thus, there\nis a need for more comprehensive approaches to automatic\nI. INTRODUCTION\ngeneration of Digital Twins in manufacturing systems. The manufacturing paradigm has been expanded towards\nAutomated Guided Vehicles (AGVs) are considered a rele-\nflexibility to deal with diverse production demands.",
      "size": 772,
      "sentences": 6
    },
    {
      "id": 7,
      "content": "gital Twins in manufacturing systems. The manufacturing paradigm has been expanded towards\nAutomated Guided Vehicles (AGVs) are considered a rele-\nflexibility to deal with diverse production demands. In this\nvantdomaininthiscontext.Theycanmovearoundthefactory\ncontext, the Digital Twin concept helps achieve more agility\nfloor and extract plenty of information for automatic Digital\nand also interoperability between real manufacturing systems\nTwin generation. Using AGVs is very common in flexible\nand their simulation models [1]. The Digital Twin concept\nmanufacturingenvironments,wherethestructureofthesystem\nhas become popular in the context of Industry 4.0 and smart\ncan be reformed based on changes in customer or internal\nmanufacturing; nowadays, many companies are aiming to\nrequirements. The mission for AGVs can be changed in less\nimprovetheirfacilitiesthroughdigitalizationandusingDigital\nthan a second to support a new mission on a factory floor. Twins.",
      "size": 965,
      "sentences": 7
    },
    {
      "id": 8,
      "content": "es are aiming to\nrequirements. The mission for AGVs can be changed in less\nimprovetheirfacilitiesthroughdigitalizationandusingDigital\nthan a second to support a new mission on a factory floor. Twins. They increase the competitiveness, productivity and\nAs a general research direction in our Aalto Factory of the\nefficiency of the main disciplines of manufacturing systems\nFuture (AFoF) Laboratory†, we aim to generate Digital Twins\nsuch as production planning, control, maintenance and layout\nfor flexible manufacturing environments to track workpieces. planning [2]. Generally, a Digital Twin refers to the digital\nBy developing a chain of software tools we want to make\ncounterpart of a (usually) physical entity. In addition, some\nthis process as automatic as possible. To have a clearer\nform of continuous interaction and communication between\nresearch plan, it is divided to five consecutive steps:\nthe physical entity and its digital counterpart is assumed.",
      "size": 963,
      "sentences": 8
    },
    {
      "id": 9,
      "content": "ossible. To have a clearer\nform of continuous interaction and communication between\nresearch plan, it is divided to five consecutive steps:\nthe physical entity and its digital counterpart is assumed. In\n1) Foreachindividualsubsysteminthefactoryfloor:Extract\n*ThispaperisdedicatedtothelivingmemoryofProfessorJanOlafBlech the information required to generate the corresponding\nwhopassedsuddenlyawayonFebruary14,2021. model. 978-1-7281-9023-5/21/$31.00©2021IEEE †https://www.aalto.fi/en/futurefactory\nCopyright(c)2021IEEE.Personaluseispermitted.Foranyotherpurposes,permissionmustbeobtainedfromtheIEEEbyemailingpubs-permissions@ieee.org. === 페이지 2 ===\n2) Generate a formal (graph) model of the system from the Twins are very specific and limited; this paper presents part\nextracted information. of a new software chain which can generate Digital Twins for\n3) Makeconnectionsbetweenthegeneratedmodelsandreal manufacturing sites equipped with AGVs. systems to setup the Digital Twins.",
      "size": 978,
      "sentences": 8
    },
    {
      "id": 10,
      "content": "nformation. of a new software chain which can generate Digital Twins for\n3) Makeconnectionsbetweenthegeneratedmodelsandreal manufacturing sites equipped with AGVs. systems to setup the Digital Twins. AGVs are equipped with different sensing technologies\n4) Connect graph based Digital Twins for different subsys- such as 2D and 3D scanning, lasers, lidars, accelerometers\ntemstomakeacomprehensiveDigitalTwinforthewhole and encoders. These types of sensing equipment help AGVs\nfactory floor. comprehend more about their environments and can make\n5) Implement and run added-value services on Digital a local map model for the surrounding environment to ease\nTwins. their operation. On the factory floors or in warehouses with\nIt is assumed that the first step has been performed or that severaloperationalAGVs,theenvironmentinformationcanbe\nwe can receive required information for this step in a proper gathered from all AGVs and infrastructures to create a com-\nformat.",
      "size": 968,
      "sentences": 8
    },
    {
      "id": 11,
      "content": "rformed or that severaloperationalAGVs,theenvironmentinformationcanbe\nwe can receive required information for this step in a proper gathered from all AGVs and infrastructures to create a com-\nformat. We carried out steps 2 and 3 for the conveyor belt prehensive model. For example, Cardarelli et al. [10] present\nsystem in our last works [4], [5]. The goal of this paper is to a cloud architecture for cooperative data fusion systems to\ncoverthesetwostepsagainfortheAGVsonthefactoryfloor. create a live model of the industrial environment and support\nThe next steps, steps 4 and 5, are introduced for motivational enhancedcoordinationofgroupsofAGVs.In[11],itisshown\npurposes and they will be covered in the future research. that using an active RFID system in the equipped fields can\nHowever, some added-value services for generated Digital improve positioning of AGVs in their movements.",
      "size": 888,
      "sentences": 7
    },
    {
      "id": 12,
      "content": "be covered in the future research. that using an active RFID system in the equipped fields can\nHowever, some added-value services for generated Digital improve positioning of AGVs in their movements. In the\nTwins have been used in this paper to show the benefits of currentwork,thebenefitsofusingcomprehensivelivemodels\ngenerated graph-based Digital Twins. generated from AGV information will be discussed. This paper is organized as follows. The next section will A graph is made up of nodes which are connected by\nreview the literature on the automatic generation of Digital edges. In the engineering context, graphs are being used to\nTwins and control systems for mobile robots. Section III modelpairwiserelationsbetweenobjects.Forexample,in[12]\nintroducesthelayer-basedarchitectureforAGVcontrolonthe graph theory has been used as a model for system dynamics\nfactory floor and its relationship with Digital Twins. Section to provide better formal analysis of dynamic complexity.",
      "size": 981,
      "sentences": 9
    },
    {
      "id": 13,
      "content": "ureforAGVcontrolonthe graph theory has been used as a model for system dynamics\nfactory floor and its relationship with Digital Twins. Section to provide better formal analysis of dynamic complexity. IV briefly presents the developed ideas about the automatic Differentsubsystemsofacomplexsystemcanalsobemodeled\ngeneration of graph-based models for factory floors and also individuallyusinggraphtheory.Then,itispossibletoanalyse\nexplainsthecoreideaofdifferentcontrollayers,implemented the whole system by merging the individual graph models\nalgorithmsandmodellingdetailswithmoresupportingdetails. of each subsystems. Using graph-based modelling is very\nSection V discusses the current progress, initial results, and common for manufacturing plants, factory floors and AGV\nalso the future plans to complete the work. Finally, Section relatedsystems.In[13],theenvironmentmapforAGVsinan\nVI concludes the paper. automatedwarehouseisdescribedbyagraphmodeltomakea\ncollisionfreerouteplanningsystem.Qiuetal.",
      "size": 999,
      "sentences": 7
    },
    {
      "id": 14,
      "content": "plete the work. Finally, Section relatedsystems.In[13],theenvironmentmapforAGVsinan\nVI concludes the paper. automatedwarehouseisdescribedbyagraphmodeltomakea\ncollisionfreerouteplanningsystem.Qiuetal. [14]inasurvey\nII. RELATEDWORK\nonscheduling,pathplanningandroutingalgorithmsforAGVs\nTheautomaticgenerationofDigitalTwinshasbeenrecently inflexiblemanufacturingenvironmentslistedseveralusecases\nreported in a number of research works in the smart factory and applications based on graph modelling which show the\ndomain. The goals for automatic Digital Twin generation in importance of this tool in this context. Since graph modelling\nexisting works are quite diverse, from digitization of old is commonly used in the context of engineering systems, in\nbrownfieldsystemstopayinglessforengineering,andgaining this work we decided to use it to generate Digital Twins for\nmore accuracy.In this section, wediscuss related workin this factory floors.",
      "size": 941,
      "sentences": 7
    },
    {
      "id": 15,
      "content": "ms, in\nbrownfieldsystemstopayinglessforengineering,andgaining this work we decided to use it to generate Digital Twins for\nmore accuracy.In this section, wediscuss related workin this factory floors. area with a special focus on graph-based models for AGV Unified Modeling Language (UML) class diagrams can be\ncontrol in manufacturing sites which serve as a key initial used to show the structure of a system by using classes to\nphaseforobtainingefficientandaccurateDigitalTwinmodels describe entities of a system, inheritance and their relations to\nin an automatic manner. present relationships between classes. The Systems Modeling\nSoftware solutions that can generate Digital Twins auto- Language (SysML) provides a standard for describing system\nmatically are very useful as they can save time and cost configurations in the automation industry. UML-based stan-\nand improve the quality of Digital Twins.",
      "size": 907,
      "sentences": 5
    },
    {
      "id": 16,
      "content": "provides a standard for describing system\nmatically are very useful as they can save time and cost configurations in the automation industry. UML-based stan-\nand improve the quality of Digital Twins. The authors in [6] dards for describing configurations of systems have been es-\npropose an automatic solution for generating Digital Twins tablished,e.g.,intheautomotiveindustrywiththeAUTOSAR\nbased on fast scanning and object recognition in the factory standard.ThesecanserveasakindofDigitalTwin,especially\nenvironment. Campos et al. [7] applied a high level specifi- during development time [15]. In [5], we have shown the\ncation to generate Digital Twins for industrial transportation benefits of using UML class diagrams for modelling Digital\nand warehouse systems. Sierla et al.",
      "size": 782,
      "sentences": 7
    },
    {
      "id": 17,
      "content": "ent time [15]. In [5], we have shown the\ncation to generate Digital Twins for industrial transportation benefits of using UML class diagrams for modelling Digital\nand warehouse systems. Sierla et al. [8] extracted the steady Twinsinflexiblemanufacturingenvironments.Thispaperuses\nstate Digital Twin from Piping & Instrumentation Diagram aUMLclassdiagramtoshowthebigpictureofthegenerated\n(P&ID) documents in the brownfield process systems. Other Digital Twin and its connection to the available neighboring\nthan P&ID, the 3D scanned PCFs (Piping Component Files) systems.ItispossibletogenerateaUMLclassdiagrammodel\ncan be used for automatic Digital Twin development [9]. At for any flexible factory floor by merging UML class diagrams\nthe moment, the tools for automatic generation of Digital for different available subsystems on the factory floor.",
      "size": 848,
      "sentences": 6
    },
    {
      "id": 18,
      "content": "win development [9]. At for any flexible factory floor by merging UML class diagrams\nthe moment, the tools for automatic generation of Digital for different available subsystems on the factory floor. === 페이지 7 ===\n[6] M. Sommer, J. Stjepandic, S. Stobrawa, and M. v. Soden, “Automatic\ngeneration of digital twin based on scanning and object recognition,”\ninTrans-disciplinaryEngineeringforComplexSocio-technicalSystems,\n072019. [7] J. G. Campos, J. S. Lo´pez, J. I. Armesto Quiroga, and A. M. Espada\nSeoane,“Automaticgenerationofdigitaltwinindustrialsystemfroma\nhigh level specification,” Procedia Manufacturing, vol. 38, pp. 1095 –\n1102,2019,29thInternationalConferenceonFlexibleAutomationand\nIntelligent Manufacturing ( FAIM 2019), June 24-28, 2019, Limerick,\nIreland, Beyond Industry 4.0: Industrial Advances, Engineering\nEducation and Intelligent Manufacturing. [Online].",
      "size": 875,
      "sentences": 7
    },
    {
      "id": 19,
      "content": "ibleAutomationand\nIntelligent Manufacturing ( FAIM 2019), June 24-28, 2019, Limerick,\nIreland, Beyond Industry 4.0: Industrial Advances, Engineering\nEducation and Intelligent Manufacturing. [Online]. Available: http:\n//www.sciencedirect.com/science/article/pii/S2351978920301980\n[8] S. Sierla, L. Sorsama¨ki, M. Azangoo, A. Villberg, E. Hyto¨nen, and\nV. Vyatkin, “Towards semi-automatic generation of a steady state\ndigital twin of a brownfield process plant,” Applied Sciences, vol. 10,\nno. 19, 2020. [Online]. Available: https://www.mdpi.com/2076-3417/\n10/19/6959\n[9] S. Sierla, M. Azangoo, A. Fay, V. Vyatkin, and N. Papakonstantinou,\nFig.7. TheGUIwhichshowsthebehaviourofdevelopedcontrollayersand “Integrating 2d and 3d digital plant information towards automatic\nDigitalTwin generationofdigitaltwins,”in2020IEEE29thInternationalSymposium\nonIndustrialElectronics(ISIE),2020,pp.460–467.",
      "size": 889,
      "sentences": 8
    },
    {
      "id": 20,
      "content": "llayersand “Integrating 2d and 3d digital plant information towards automatic\nDigitalTwin generationofdigitaltwins,”in2020IEEE29thInternationalSymposium\nonIndustrialElectronics(ISIE),2020,pp.460–467. [10] E. Cardarelli, V. Digani, L. Sabattini, C. Secchi, and C. Fantuzzi,\n“Cooperative cloud robotics architecture for the coordination of\nthat, we first presented an architectural model of the control multi-agvsystemsinindustrialwarehouses,”Mechatronics,vol.45,pp. mechanism of AGVs, which encompasses both fine-grained 1–13,2017. [Online].Available:https://www.sciencedirect.com/science/\narticle/pii/S0957415817300521\nand coarse-grained control levels.",
      "size": 653,
      "sentences": 4
    },
    {
      "id": 21,
      "content": "vol.45,pp. mechanism of AGVs, which encompasses both fine-grained 1–13,2017. [Online].Available:https://www.sciencedirect.com/science/\narticle/pii/S0957415817300521\nand coarse-grained control levels. The former is concerned\n[11] S. Lu, C. Xu, and R. Y. Zhong, “An active rfid tag-enabled locating\nwiththemaneuveringofAGVsintheircurrentlocation,while approach with multipath effect elimination in agv,” IEEE Transactions\nthe latter is related to path planning for AGVs on the factory onAutomationScienceandEngineering,vol.13,no.3,pp.1333–1342,\n2016.\nfloor. [12] R. Oliva, “Model structure analysis through graph theory: Partition\nUsing graph theory, we proposed a mechanism for graph- heuristics and feedback structure decomposition,” System Dynamics\nbased modeling of Digital Twins for AGVs, considering the Review,vol.20,pp.313–336,122004. [13] Z. Zhang, Q. Guo, J. Chen, and P. Yuan, “Collision-free route plan-\naforementioned control requirements.",
      "size": 950,
      "sentences": 6
    },
    {
      "id": 22,
      "content": "ased modeling of Digital Twins for AGVs, considering the Review,vol.20,pp.313–336,122004. [13] Z. Zhang, Q. Guo, J. Chen, and P. Yuan, “Collision-free route plan-\naforementioned control requirements. In the proposed plat-\nning for multiple agvs in an automated warehouse based on collision\nform, interaction between the control layers and the Digital classification,”IEEEAccess,vol.6,pp.26022–26035,2018. Twin can enhance the functionality of the system. The inde- [14] L.Qiu,W.-J.Hsu,S.-Y.Huang,andH.Wang,“Schedulingandrouting\nalgorithms for agvs: A survey,” International Journal of Production\npendent design of the control layers and added-value services\nResearch, vol. 40, no. 3, pp. 745–760, 2002. [Online]. Available:\nin the Digital Twin ease the development of sub-systems.",
      "size": 780,
      "sentences": 10
    },
    {
      "id": 23,
      "content": "of Production\npendent design of the control layers and added-value services\nResearch, vol. 40, no. 3, pp. 745–760, 2002. [Online]. Available:\nin the Digital Twin ease the development of sub-systems. https://doi.org/10.1080/00207540110091712\nSome developments and experiments are left for the future [15] J. O. Blech, “Towards digital twins for the description of automotive\nsoftware systems,” in Proceedings 16th Workshop on Quantitative\nwork such as implementing more advanced algorithms in\nAspectsofProgrammingLanguagesandSystems,QAPL@ETAPS2019,\ndifferent control layers and the Digital Twin side. In ad- Prague, Czech Republic, 7th April 2019, ser. EPTCS, A. Aldini and\ndition, development of automatic tools for generation and H. Wiklicky, Eds., vol. 312, 2019, pp. 20–28. [Online]. Available:\nhttps://doi.org/10.4204/EPTCS.312.2\nsynchronization of the factory model should be considered.",
      "size": 892,
      "sentences": 13
    },
    {
      "id": 24,
      "content": "of automatic tools for generation and H. Wiklicky, Eds., vol. 312, 2019, pp. 20–28. [Online]. Available:\nhttps://doi.org/10.4204/EPTCS.312.2\nsynchronization of the factory model should be considered. [16] R.HorowitzandP.Varaiya,“Controldesignofanautomatedhighway\nIn addition, to achieve a Digital Twin with higher fidelity, it system,”ProceedingsoftheIEEE,vol.88,no.7,pp.913–925,2000. is important to study more detailed attributes for modelling. [17] G.Bhatti,H.Mohan,andR.RajaSingh,“Towardsthefutureofsmart\nelectricvehicles:Digitaltwintechnology,”RenewableandSustainable\nEnergy Reviews, vol. 141, p. 110801, 2021. [Online].",
      "size": 625,
      "sentences": 10
    },
    {
      "id": 25,
      "content": "butes for modelling. [17] G.Bhatti,H.Mohan,andR.RajaSingh,“Towardsthefutureofsmart\nelectricvehicles:Digitaltwintechnology,”RenewableandSustainable\nEnergy Reviews, vol. 141, p. 110801, 2021. [Online]. Available:\nREFERENCES https://www.sciencedirect.com/science/article/pii/S1364032121000964\n[18] P. Beinschob, M. Meyer, C. Reinke, V. Digani, C. Secchi, and\n[1] J. Leng, H. Zhang, D. Yan, Q. Liu, X. Chen, and D. Zhang, “Digital L. Sabattini, “Semi-automated map creation for fast deployment\ntwin-drivenmanufacturingcyber-physicalsystemforparallelcontrolling of agv fleets in modern logistics,” Robotics and Autonomous\nof smart workshop,” Journal of Ambient Intelligence and Humanized Systems, vol. 87, pp. 281 – 295, 2017. [Online]. Available:\nComputing,vol.10,p.1155–1166,032019.",
      "size": 779,
      "sentences": 9
    },
    {
      "id": 26,
      "content": "logistics,” Robotics and Autonomous\nof smart workshop,” Journal of Ambient Intelligence and Humanized Systems, vol. 87, pp. 281 – 295, 2017. [Online]. Available:\nComputing,vol.10,p.1155–1166,032019. http://www.sciencedirect.com/science/article/pii/S0921889015302724\n[2] W. Kritzinger, M. Karner, G. Traar, J. Henjes, and W. Sihn, [19] M.Paajanen,“FactoryfloormodelingforDigitalTwingenerationusing\n“Digital twin in manufacturing: A categorical literature review AGVs,”2021. and classification,” IFAC-PapersOnLine, vol. 51, no. 11, pp. 1016 [20] L.G.Bao,T.G.Dang,andN.D.Anh,“Storageassignmentpolicyand\n– 1022, 2018, 16th IFAC Symposium on Information Control routeplanningofagvsinwarehouseoptimization,”in2019International\nProblems in Manufacturing INCOM 2018. [Online]. Available: ConferenceonSystemScienceandEngineering(ICSSE),2019,pp.599–\nhttp://www.sciencedirect.com/science/article/pii/S2405896318316021 604. [3] S.Sierla,M.Azangoo,andV.Vyatkin,“Generatinganindustrialprocess [21] May 2021.",
      "size": 993,
      "sentences": 13
    },
    {
      "id": 27,
      "content": "stemScienceandEngineering(ICSSE),2019,pp.599–\nhttp://www.sciencedirect.com/science/article/pii/S2405896318316021 604. [3] S.Sierla,M.Azangoo,andV.Vyatkin,“Generatinganindustrialprocess [21] May 2021. [Online]. Available: https://www.youtube.com/watch?v=\ngraph from 3d pipe routing information,” in 2020 25th IEEE Interna- pW0bwKN0v6o\ntional Conference on Emerging Technologies and Factory Automation\n(ETFA),vol.1,2020,pp.85–92. [4] M.Azangoo,J.O.Blech,andU.D.Atmojo,“Towardsformalmonitor-\ningofworkpiecesinagilemanufacturing,”in2020IEEEInternational\nConferenceonIndustrialTechnology(ICIT),2020,pp.334–339. [5] M. Azangoo, A. Taherkordi, and J. Olaf Blech, “Digital twins for\nmanufacturing using uml and behavioral specifications,” in 2020 25th\nIEEEInternationalConferenceonEmergingTechnologiesandFactory\nAutomation(ETFA),vol.1,2020,pp.1035–1038.",
      "size": 845,
      "sentences": 6
    }
  ]
}