{
  "source": "ArXiv",
  "filename": "026_Modeling_and_Design_of_the_Communication_Sensing_a.pdf",
  "total_chars": 32790,
  "total_chunks": 49,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\n3202\ntcO\n42\n]FP.sc[\n1v06551.0132:viXra\nModeling and Design of the Communication\nSensing and Control Coupled\nClosed-Loop Industrial System\nZeyang Meng, Dingyou Ma, Shengfeng Wang, Zhiqing Wei and Zhiyong Feng\nBeijing University of Posts and Telecommunications\nKey Laboratory of the Universal Wireless Communications, Beijing, China\n{mengzeyang, dingyouma, sfwang, weizhiqing, fengzy}@bupt.edu.cn\nAbstract—With the advent of 5G era, factories are transition-\ningtowards wirelessnetworkstobreakfreefromthelimitations SSeennssiinngg IInnffoorrmmaattiioonn\nCCoonnttrrooll IInnffoorrmmaattiioonn\nofwirednetworks.In5G-enabledfactories,unmannedautomatic\nCCoonnttrrooll LLoooopp\ndevices such as automated guided vehicles and robotic arms\nBase Station\ncomplete production tasks cooperatively through the periodic\ncontrol loops. In such loops, the sensing data is generated by Edge Control Center\nsensors, and transmitted to the control center through uplink\nwireless communications.",
      "size": 986,
      "sentences": 2
    },
    {
      "id": 2,
      "content": "ratively through the periodic\ncontrol loops. In such loops, the sensing data is generated by Edge Control Center\nsensors, and transmitted to the control center through uplink\nwireless communications. The corresponding control commands\nare generated and sent back to the devices through downlink\nwirelesscommunications.Sincewirelesscommunications,sensing\nAGV SSeennssoorr\nand control are tightly coupled, there are big challenges on the Sensor AGV with\nmodeling and design of such closed-loop systems. In particular, Robotic Arm\nexisting theoretical tools of these functionalities have different\nmodelings and underlying assumptions, which make it difficult\nFig. 1. A 5G enabled factory, with unmanned automatic devices, complete\nforthemtocollaboratewitheachother.Therefore,inthispaper,\ntasks through the collaboration of wireless communication, sensing and\nan analytical closed-loop model is proposed, where the perfor- control.",
      "size": 928,
      "sentences": 6
    },
    {
      "id": 3,
      "content": "forthemtocollaboratewitheachother.Therefore,inthispaper,\ntasks through the collaboration of wireless communication, sensing and\nan analytical closed-loop model is proposed, where the perfor- control. mancesandresourcesofcommunication,sensingandcontrolare\ndeeplyrelated.Toachievetheoptimalcontrolperformance,aco- sensing data results in an accurate state estimation in the\ndesignofcommunicationresourceallocationandcontrolmethod control center, but causes heavy communication loads in the\nis proposed, inspired by the model predictive control algorithm. uplinkchannel. Besides, the uncertaindelay and package loss\nNumerical results are provided to demonstrate the relationships ofthe wireless channelsunderlimited resourcesgreatlyaffect\nbetween the resources and control performances. the stability and convergenceof control.",
      "size": 824,
      "sentences": 5
    },
    {
      "id": 4,
      "content": "sults are provided to demonstrate the relationships ofthe wireless channelsunderlimited resourcesgreatlyaffect\nbetween the resources and control performances. the stability and convergenceof control. Furthermore,the up-\nIndexTerms—controlloop,wirelessnetwork,effectivecapacity,\nlinkanddownlinkcommunicationsofsuchclosed-loopsystem\nestimation theory, model predictive control\nare closely related through the generated control strategies. I. INTRODUCTION\nThe emergence of 5G technology is revolutionizing the Therefore, a joint design of such close-loop control system\ntraditional production modes, offering unprecedented oppor- is required, rather than designing communication, sensing,\ntunities for the factories to achieve greater productivity and and control in a separate manner.",
      "size": 782,
      "sentences": 5
    },
    {
      "id": 5,
      "content": "uction modes, offering unprecedented oppor- is required, rather than designing communication, sensing,\ntunities for the factories to achieve greater productivity and and control in a separate manner. The design and modeling\nprofitability.As a typicalapplicationscenario of 5G, factories of such closed-loop control systems are investigated in the\nare undergoing a transformation from wired networks to works of networked control systems [4]–[9] and unmanned\nwireless networkswith the aid of 5G mobile system. The low aerial vehicle networks [10]. However, in these studies, the\nlatency, exceptional bandwidth and high reliability features state information of the devices is usually assumed to be\nof 5G networks enable to reduce the wiring costs, improve perfectlysensed. Besides, the communicationin such systems\nthe equipment flexibility, and support more highly automated are usually regarded as independent tunnels, which ignores\nequipment to participate in the production process [1], [2].",
      "size": 994,
      "sentences": 5
    },
    {
      "id": 6,
      "content": "ionin such systems\nthe equipment flexibility, and support more highly automated are usually regarded as independent tunnels, which ignores\nequipment to participate in the production process [1], [2]. the potential tradeoffs between communication, sensing and\nAn example of the 5G enabled factory is shown in Fig. 1. In control. this scenario, unmannedautomatic devicessuch as automated In this paper, a joint sensing, communication and control\nguidedvehicles(AGVs)androboticarmscompleteproduction modelofthe closed-loopsystemis proposed.Theclosed-loop\ntasks cooperatively, where the control loops are carried out performancessuch as cycle time and package loss probability\nperiodicallyasFig.1.Sensors,locatedonthedevicesorsettled are derived with respect to the physical layer resources. independently in the factories, collect the states of devices, In addition, a stability-communication-sensing inequality is\nand forward them to the edge control center.",
      "size": 956,
      "sentences": 6
    },
    {
      "id": 7,
      "content": "the physical layer resources. independently in the factories, collect the states of devices, In addition, a stability-communication-sensing inequality is\nand forward them to the edge control center. Sensing data derived to reveal the communication, sensing and control\nfrom multiple sources is fused at the edge to provide more requirements for system convergence. To achieve the optimal\naccurateestimationofdevicestatus. Thecontrolstrategiesare controlperformance,theresourceallocationofcommunication\nthen calculated in the control center according to the global andthecontrolmethodarejointlydesigned.Numericalresults\nsensing data and sent back to the devices [3]. areutilizedtoverifytheeffectivenessoftheproposedmethod,\nThe modeling and design of such system face big chal- and to demonstrate the relationship between the resource\nlenges,sincetheperformancesofcommunication,sensingand allocation and control performance. control are tightly coupled.",
      "size": 951,
      "sentences": 7
    },
    {
      "id": 8,
      "content": "h system face big chal- and to demonstrate the relationship between the resource\nlenges,sincetheperformancesofcommunication,sensingand allocation and control performance. control are tightly coupled. For example, a large amount of The rest of the paper is organized as follows. Section II\n=== 페이지 2 ===\nDevice such as\nAGV\nState Sensors X\nControl\nCommand\nDownlink Channel\nController Estimated\nState\nEstimator\nOriginal Sensing\nData Uplink Channel\nU\nControl\nCenter\nObservation\nValue\nSensing Data Processing\n{Si}\nˆX\n{Y }i\nX of the device is assumed to be observed by k sensors s\nper loop, where the original sensing data is denoted by\n{S ,S ,··· ,S }. After processing at the control center, 1 2 ks\nk observation values {Y ,Y ,··· ,Y } of the state are\ns 1 2 ks\ngenerated, which satisfies\nY =X+N (1≤i≤k ), (1)\ni i s whereN istheGaussianwhitenoiseofobservations.Without i\nloss of generality, the noises {N } are assumed to have i\nthe same distribution and with the same variance σ2. The\nFig.2.",
      "size": 988,
      "sentences": 6
    },
    {
      "id": 9,
      "content": "+N (1≤i≤k ), (1)\ni i s whereN istheGaussianwhitenoiseofobservations.Without i\nloss of generality, the noises {N } are assumed to have i\nthe same distribution and with the same variance σ2. The\nFig.2. SystemModel\nmaximumlikelihoodestimationisutilizedtoestimatethestate\npresents the system model of the closed-loop system. In\nof the automated device using the observation values from\nSection III, the joint design of the resource allocation and\ndifferentsensors. With the aboveassumptions,the estimate of\ncontrolmethodisproposed.Numericalsimulationsareutilized X, denoted by Xˆ, is given by [11]\nto evaluate the proposed system and method in Section IV. 1\nks\nFinally, Section V provides concluding remarks. Xˆ = Y . (2)\ni\nk\nII. SYSTEMMODEL s Xi=1\nA model of the control loop, as shown in Fig. 2, is The mean-square error of Xˆ is expressed as\n1\nconstructedbyreferringtotheoverallmodelofthenetworked E{(Xˆ −X)2}= σ2. (3)\ncontrol system [5].",
      "size": 937,
      "sentences": 11
    },
    {
      "id": 10,
      "content": "s Xi=1\nA model of the control loop, as shown in Fig. 2, is The mean-square error of Xˆ is expressed as\n1\nconstructedbyreferringtotheoverallmodelofthenetworked E{(Xˆ −X)2}= σ2. (3)\ncontrol system [5]. The closed-loop control system, which is k s\nB. Communication Model\ncomposed of the automated devices, the sensors, the control\ncenter, and two communication links, aims at generating Inaclosed-loopsystem,communicationplaysapivotalrole\nappropriate commands based on the device state sensed by in the transmission of sensing data from the device to the\nthe sensors, and realize on-demand control of the device. control center, and distributing the control commands from\nThe loop starts from the automated device which can be an the control center to the device, as shown in the uplink and\nAGV or a robotic arm.",
      "size": 809,
      "sentences": 5
    },
    {
      "id": 11,
      "content": "control center, and distributing the control commands from\nThe loop starts from the automated device which can be an the control center to the device, as shown in the uplink and\nAGV or a robotic arm. The state information, such as the downlinkofFig.2.Theuplinkanddownlinkcommunications\nlocation and speed, is measured by the sensors mounted in are intimately coupled within the control loop, since the\nthe factory. The original sensing data is transferred to the control commands transmitted by the downlink channels are\ncontrol center located at the edge by wireless channels. The generated based on the estimated state of the devices using\ncontrol center is a high-performance server, which is utilized the sensing data conveyed by the uplink channels. Therefore,\nto process the sensing data, estimate the state of device, aclosed-loopcommunicationmodelisestablishedandstudied\nand generate the control commands.",
      "size": 913,
      "sentences": 5
    },
    {
      "id": 12,
      "content": "ng data conveyed by the uplink channels. Therefore,\nto process the sensing data, estimate the state of device, aclosed-loopcommunicationmodelisestablishedandstudied\nand generate the control commands. After transmitted to the inthissection.Thecommunicationprocessismodeledastwo\ncontrol center, the sensing data is processed in the control queues in series, corresponding to the uplink and downlink\ncenter to generate the observation values of the device state communications, respectively. from each sensor. The observation values are then merged to The arrival data of the uplink queue is originated from the\nobtain the final state estimation of the device. According to sensing information. For ease of analysis, the sensing data is\nthe estimated state, the control commands are generated, and assumed to be of the same size, which is denoted by β bits. the communication resources are allocated to the uplink and AssumethatthedeviceisrepeatedlysensedeveryT s seconds. downlink at the controller.",
      "size": 997,
      "sentences": 9
    },
    {
      "id": 13,
      "content": "umed to be of the same size, which is denoted by β bits. the communication resources are allocated to the uplink and AssumethatthedeviceisrepeatedlysensedeveryT s seconds. downlink at the controller. The control commands generated The sensing system generates βks bits of data per second,\nTs\nby the control center are next sent to the devices through the which means that the arrival rate of the uplink queue is\ndownlink channel to complete the control loop. The closed- λ = βk s . (4)\nu\nloopprocessisrepeatedcontinuouslytoensurethatthedevices T\ns\nreact quickly to the environmentalchanges. The arrival data of the downlink queue is the control com-\nIn the sequel, the single models and performance metrics mandscalculatedfrom the uplinktransmitted data. Therefore,\nof the sensing, communication, and control are introduced, the arrival rate of the downlink queue, denoted by λ d , is the\nrespectively. amount of data departing from the uplink queue per second,\ni.e.",
      "size": 966,
      "sentences": 9
    },
    {
      "id": 14,
      "content": "f the sensing, communication, and control are introduced, the arrival rate of the downlink queue, denoted by λ d , is the\nrespectively. amount of data departing from the uplink queue per second,\ni.e. the uplink departure rate L , multiplied by a coefficient,\nu\nA. Sensing Model which is Nγ\nλ = L , (5)\nd u\nThepurposeofsensingstageistocollectthedevice’sstates βk\ns\nwiththeon-boardandoff-boardsensors,soastoprovideprior where the coefficient Nγ denotes that every N control com-\nβks\ninformation for decision-making in the control center. Con- mands are generated from k sensing data, with γ being the\ns\nsidering the constraints such as power consumption, weight, size of each control package, and N being the number of\nandcost,sensorscannotpossessstrongcomputingcapabilities. control commands generated from the control center.",
      "size": 825,
      "sentences": 5
    },
    {
      "id": 15,
      "content": "such as power consumption, weight, size of each control package, and N being the number of\nandcost,sensorscannotpossessstrongcomputingcapabilities. control commands generated from the control center. Therefore, the raw sensing data is first transmitted to the The service rate of the queue denotes the average number\ncontrolcenterforfurtherprocessing.Subsequently,thecontrol of items that can be served by the queue per unit of time. center calculates and integrates the global sensing data to In the proposed communicationmodel, the service rate is the\nestimate the state of the device. average number of packages transmitted per second, i.e. the\nBasedontheaboveprocess,thesignalmodelofthesensing transmissionrateofthecommunicationchannel.Considerthat\nstage is presented as follows. As Fig.",
      "size": 791,
      "sentences": 7
    },
    {
      "id": 16,
      "content": "age number of packages transmitted per second, i.e. the\nBasedontheaboveprocess,thesignalmodelofthesensing transmissionrateofthecommunicationchannel.Considerthat\nstage is presented as follows. As Fig. 2, the current state the sensing and control packages transmitted in factories are\n=== 페이지 3 ===\nmainlyshortpackets[12],thecapacityunderfiniteblocklength Besides, Theorem2 holdsaccordingto the definitionof the\nis applied to be the service rate {R |i = u,d} of the uplink effective capacity. i\nand downlink queues, i.e.",
      "size": 518,
      "sentences": 5
    },
    {
      "id": 17,
      "content": ",thecapacityunderfiniteblocklength Besides, Theorem2 holdsaccordingto the definitionof the\nis applied to be the service rate {R |i = u,d} of the uplink effective capacity. i\nand downlink queues, i.e. [13] Theorem 2 (Inequalityof Effective Capacity): Accordingto\nR =W log (1+SNR)− V i f −1(e ) (i=u,d), (6) the definition of the effective capacity, C u (θ u ,W u ,e u ) and\ni i 2 i rL i Q i C d (θ d ,W d ,e d ) should satisfy\nwhere W i is the bandwidth of the communication channel, C (θ ,W ,e )≥λ (β,k ,T )= βk s , (13)\nL is the blocklength of the packages, e is the probability u u u u u s s T\ni i s\nof the irreparable distortion occurs, f\n−1\nis the inverse of and\nQ\ncomplementary Gaussian cumulative distribution function, V i C d (θ d ,W d ,e d )≥λ d (β,k s ,T s ,θ u ,θ d ,W u ,e u )\nis the channel dispersion, which can be approximated by Nγλ (β,k ,T ), 0≤θ ≤θ\nV i =1− (1+S 1 NR i )2 (i=u,d). (7) =  β β N k k s s γ θd u {(θ d − s θ u s )C u (θ u − d θ d ,W u u ,e u ) .",
      "size": 978,
      "sentences": 4
    },
    {
      "id": 18,
      "content": "u ,e u )\nis the channel dispersion, which can be approximated by Nγλ (β,k ,T ), 0≤θ ≤θ\nV i =1− (1+S 1 NR i )2 (i=u,d). (7) =  β β N k k s s γ θd u {(θ d − s θ u s )C u (θ u − d θ d ,W u u ,e u ) . (14)\n+λ (β,k ,T )θ }, θ >θ\nWe next discuss the metrics to evaluate the performanceof u s s u d u\nthe uplink and downlink communictions. Proof:The proof is given in Appendix B. Based on the above communication model, closed-loop C. Control Model\nperformance metrics such as the cycle time and the package The purpose of the control stage is to generate the control\nloss probability are derived later to describe the intricate commands based on the current state of the device, so as to\nfeedbackmechanismoftheclosed-loopsystem.Thecycletime enable the device to reach the expected state after a period\nisthetimeforasystemtocompleteonecontrolloopasFig.2 of time.",
      "size": 858,
      "sentences": 5
    },
    {
      "id": 19,
      "content": "e of the device, so as to\nfeedbackmechanismoftheclosed-loopsystem.Thecycletime enable the device to reach the expected state after a period\nisthetimeforasystemtocompleteonecontrolloopasFig.2 of time. In the control field, the state functions are often\n[14],whichrevealsthesystem’sresponsivenesstounexpected appliedtomodelthestateevolution.Thefollowingsubsections\nevents.Thepackagelossprobabilitystandsfortheprobability progressively establish the state function of AGV, advancing\nthat the communication is completed exceeding the required from the ideal model to the model with imperfect sensing,\ntimethreshold,onthepremisethatthepackagesaredroppedin and finally to the model influenced by the imperfect wireless\nan overtime transmission, which affects the control efficiency communication. of the system.",
      "size": 805,
      "sentences": 3
    },
    {
      "id": 20,
      "content": "hold,onthepremisethatthepackagesaredroppedin and finally to the model influenced by the imperfect wireless\nan overtime transmission, which affects the control efficiency communication. of the system. 1) Ideal Model of AGV: Denote the state of the AGV\nTorevealtherelationshipbetweentwometricsandphysical- as X = [δ,v,a]T, with δ, v, and a being the position,\nlayerparameters,theeffectivecapacitytheoryisappliedinthe velocity, and acceleration, respectively. The controller, which\nfollowing analysis, where the effective capacity is defined to is denoted by U, is designed to be the linear combination of\nbe themaximumacceptablearrivalrate ofthe communication the state X, i.e. U=KX, where K=[K 1 ,K 2 ,K 3 ] denotes\nqueues given by [15] the coefficient matrix of the linear transformation.",
      "size": 788,
      "sentences": 5
    },
    {
      "id": 21,
      "content": "ombination of\nbe themaximumacceptablearrivalrate ofthe communication the state X, i.e. U=KX, where K=[K 1 ,K 2 ,K 3 ] denotes\nqueues given by [15] the coefficient matrix of the linear transformation. The state\nfunction of the AGV is expressed as follows [17]\n1\nC\ni\n(θ\ni\n,W\ni\n,e\ni\n)=−\nθ i\nlog(E{exp(−θ\ni\nR\ni\n)}) (i=u,d), (8)\nX˙ =AX+BU, (15)\nwhere C and C representthe effective capacities of the up-\nu d where X˙ denotes the differentialof the state X, A represents\nlinkanddownlinkcommunications,respectively,θ represents\ni the state matrix, and B is the control matrix. The expressions\nthe decay rate of queue overflow probability, which satisfies\nof A and B are given by\nlnPr{q(∞)≥q }\nlim 0 =−θ i (i=u,d), (9) 0 1 0\nq0→∞ q\n0 A= 0 0 1 , (16)\nwith q(∞) being the length of the communication buffer 0 0 −1/ς\nqueue in steady state, and q being the buffer overflow  \n0\nand\nthreshold [15]. Both θ and θ are assumed to be constant\nu d B= 0,0,−1/ς T , (17)\nin the industry scenario [16].",
      "size": 984,
      "sentences": 5
    },
    {
      "id": 22,
      "content": "cation buffer 0 0 −1/ς\nqueue in steady state, and q being the buffer overflow  \n0\nand\nthreshold [15]. Both θ and θ are assumed to be constant\nu d B= 0,0,−1/ς T , (17)\nin the industry scenario [16]. According to the effective capacity theory, the cycle time respectively,whereς bein (cid:2) gaconstantr (cid:3) elatedtotheengine.In\nand package loss probability are derived as Theorem 1. (15), AX denotes the evolution of the device states without\nTheorem1(CycleTimeandPackageLossProbability):The controlinvolved,and BU denotesthe change of states owing\nmaximum value of the cycle time D c,max and package loss to the control commands.",
      "size": 635,
      "sentences": 4
    },
    {
      "id": 23,
      "content": "tes without\nTheorem1(CycleTimeandPackageLossProbability):The controlinvolved,and BU denotesthe change of states owing\nmaximum value of the cycle time D c,max and package loss to the control commands. probability ǫ c of the control loop can be approximated as For ease of analysis, (15) is discretized with the Euler’s\nmethod [18] as\nD =D +D , (10)\nc,max u,max d,max\n1\nǫ c ≈1−(1−ǫ u )(1−ǫ d ), (11) T (X t+1 −X t )=AX t +BU t , (18)\nd\na w n h d er d e ow ǫ u nl a i n n d k q ǫ d ue a u r e e s, th D e u p ,m ac a k x a a g n e d lo D ss d, p m r a o x ba a b re ili t t h ie e s m o a f x u im pl u in m k a b t y t s i u m b e sti t t , ut U in t g i X s ˙ t w he ith co T n 1 d tr ( o X l t+ co 1 m − m X an t ) d , w at he ti r m e e X t t , is an t d he T s d tat i e s\ndelays of uplink and downlink queues, and D u,max , D d,max , the time step where the state of the device is assumed to be\nǫ u , and ǫ d satisfy constant. (18) can be reorganized as\nln(ǫ )\nD i,max =− θ C (θ ,W i ,e ) (i=u,d).",
      "size": 1000,
      "sentences": 3
    },
    {
      "id": 24,
      "content": "ink queues, and D u,max , D d,max , the time step where the state of the device is assumed to be\nǫ u , and ǫ d satisfy constant. (18) can be reorganized as\nln(ǫ )\nD i,max =− θ C (θ ,W i ,e ) (i=u,d). (12) X t+1 =AX t +BU t , (19)\ni i i i i\nProof: The proof is provided in Appendix A. where A=T\nd\nA+I, and B e=T\nd\nB.e\ne e\n=== 페이지 4 ===\n2) The Model Considering Imperfect Sensing: The imper- whose value is determined based on the actual system. fect estimation makes it difficult for the controller that gener- Proof: See the proof in Appendix C.\nates the control commands based on the accurate perceptual\nIII. JOINT DESIGNOF RESOURCE ALLOCATIONAND\ninformation, thus results in the control deviation. Taking into\nCONTROL METHOD\naccount the effect of the imperfect estimation at the control\nAccordingto the above analysis, the performancesof com-\ncenter, the device receives the estimated-state-based control\ncommand Uˆ =KXˆ rather than U .",
      "size": 938,
      "sentences": 6
    },
    {
      "id": 25,
      "content": "effect of the imperfect estimation at the control\nAccordingto the above analysis, the performancesof com-\ncenter, the device receives the estimated-state-based control\ncommand Uˆ =KXˆ rather than U . Therefore, (19) can be munication,sensingandcontrolaretightlyunited.Thesystem\nt t t\nneeds to be globally optimized to achieve the closed-loop\ndeveloped as\nX =AX +BUˆ . (20) optimization. t+1 t t\nTherefore, to achieve the optimal control performance un-\n3) The Model Considering Imperfect Sensing And Wireless\ne e der the impact of limited resources, imprecise sensing, and\nCommunication: Theeffectofwirelesscommunicationcanbe\npackage losses, a model-predictive-control-basedjoint design\nattributed to the inaccurate control caused by communication\nof the resource allocation and control method is carried out\ndelay and the loss of control instructions due to the package\nat the control center, aiming at guaranteeing the minimum\nloss. control cost.",
      "size": 948,
      "sentences": 5
    },
    {
      "id": 26,
      "content": "f the resource allocation and control method is carried out\ndelay and the loss of control instructions due to the package\nat the control center, aiming at guaranteeing the minimum\nloss. control cost. The control cost is given as follows in the form\nWhen communication delay occurs, the device will receive\nof a quadratic function [21]\ncontrol commands corresponding to the previous state rather N−1\nthan the current state, resulting in a suboptimal control strat- J(X ,U )= XTPX +UTRU +XTSX , (25)\nt t t t t t N N\negy. However, the delay-compensated strategy can be applied Xt=1 (cid:0) (cid:1)\nto compensate for the impact of communication delay [20]. with N beingthe time horizonover which the controlactions\nBrieflyspeaking,thecontrolcenternotonlycalculatescontrol are optimized.",
      "size": 782,
      "sentences": 5
    },
    {
      "id": 27,
      "content": ":0) (cid:1)\nto compensate for the impact of communication delay [20]. with N beingthe time horizonover which the controlactions\nBrieflyspeaking,thecontrolcenternotonlycalculatescontrol are optimized. The term UTRU represents the energy re-\nt t\ncommandsbasedonthereceivedsensingdatabutalsopredicts quired in the controlactions at time t. The term XTPX and\nt t\nthe future states and corresponding control commands for XTSX , which can be reformed as (X −0)TP(X −0)\nN N t t\nthe subsequent time steps utilizing the state function and and (X −0)TS(X −0), are the distances to the control\nN N\ntransmitsthemcollectivelytothedevice.Thedevicecalculates objective X = 0 at time t and N, respectively. R and S\nthe cycle time based on the time difference between sensing represent the weights of the above three terms.",
      "size": 806,
      "sentences": 4
    },
    {
      "id": 28,
      "content": "ivelytothedevice.Thedevicecalculates objective X = 0 at time t and N, respectively. R and S\nthe cycle time based on the time difference between sensing represent the weights of the above three terms. The choice of\nand receiving control commands, subsequently selecting and P, R, and S dependson the system dynamicsand the design\nexecuting the control command corresponding to the cycle objectives,whichareoftendesignedtobepositivesemidefinite\ntime. to ensure convexity [23]. The joint design of the resource allocation and control\nAlthough the effect of the communication can be compen-\nmethod can be expressed as the following optimization prob-\nsated with the above algorithm, the effect of package loss\nlem given by\nin wireless transmission still remains non-negligible. When\nP1: min J(X ,U ) (26a)\nthe package loss occurs, the control commands will not be Kt,Wi,ǫi t t\nreceived by the device, then the state function (20) is revised (i=u,d)\nas\ns.t.",
      "size": 952,
      "sentences": 6
    },
    {
      "id": 29,
      "content": "ains non-negligible. When\nP1: min J(X ,U ) (26a)\nthe package loss occurs, the control commands will not be Kt,Wi,ǫi t t\nreceived by the device, then the state function (20) is revised (i=u,d)\nas\ns.t. C\nu\n≥λ\nu\n(β,k\ns\n,T\ns\n) (26b)\nX t+1 =AX t +ηBUˆ t , (21) C d ≥λ d (β,k s ,T s ,θ u ,θ d ,W u ,e u ) (26c)\nwhere η is a factor related to the packet loss that equals to 1\nD\nc,max\n≤D\n0\n(26d)\ne e\nwith probability 1−ǫ c and 0 with probability ǫ c . (1−ǫ c )F 1 (X t ,K t ,σ)≤F 2 (X t ) (26e)\nWe next discuss the performance metric of the control 0≤W u +W d ≤W 0 (26f)\nsystem.Afeasiblecontrolsystemisneededtobeconvergence, U t =K t X t (26g)\ni.e.",
      "size": 640,
      "sentences": 4
    },
    {
      "id": 30,
      "content": ". (1−ǫ c )F 1 (X t ,K t ,σ)≤F 2 (X t ) (26e)\nWe next discuss the performance metric of the control 0≤W u +W d ≤W 0 (26f)\nsystem.Afeasiblecontrolsystemisneededtobeconvergence, U t =K t X t (26g)\ni.e. the state of the controlled devices reaches the target state 0≤ǫ\nc\n≤1 (26h)\nwithina certainperiodoftime.Therefore,underthe proposed X\nt+1\n=AX\nt\n+(1−ǫ\nc\n)BU\nt\n(26i)\ndelay-compensated strategy and discretized state function, X =X , (26j)\nthe following theorem is proposed based on (3), (21), and 1 inei e\nLyapunov stability theory [19] to guarantee the asymptotic where W 0 and D 0 are thresholds of the total bandwidth and\nconvergence under communication delay, package loss, and cycletime. (26b)and(26c)ensurethattheeffectivecapacities\nsensing error. oftheuplinkanddownlinkchannelsaregreaterthanthearrival\nTheorem 3 (Stability-Communication-Sensing Inequality): rates, which are stated at Theorem 1.",
      "size": 898,
      "sentences": 5
    },
    {
      "id": 31,
      "content": "6c)ensurethattheeffectivecapacities\nsensing error. oftheuplinkanddownlinkchannelsaregreaterthanthearrival\nTheorem 3 (Stability-Communication-Sensing Inequality): rates, which are stated at Theorem 1. (26d) ensures that the\nThe system is asymptotic convergent when K t , ǫ c and σ cycletimeofthecontrolloopisconstrainedinD 0 . (26e)isthe\nsatisfies constraint on the package loss probability, sensing error, and\n(1−ǫ )F (X ,K ,σ)≤F (X ), (22) convergence,which is derived in Theorem 3. (26f) constrains\nc 1 t t 2 t\nthe available bandwidth of the communication. (26g) is the\nwhere\nrelationship between the control commands and the state,\nT\nF\n1\n(X\nt\n,K\nt\n,σ)= AX\nt\n+BK\nt\nX\nt\n·P AX\nt\n+BK\nt\nX\nt\nwhich is stated in the control model.",
      "size": 726,
      "sentences": 6
    },
    {
      "id": 32,
      "content": "bandwidth of the communication. (26g) is the\nwhere\nrelationship between the control commands and the state,\nT\nF\n1\n(X\nt\n,K\nt\n,σ)= AX\nt\n+BK\nt\nX\nt\n·P AX\nt\n+BK\nt\nX\nt\nwhich is stated in the control model. (26i) is the exception\n(cid:16) (cid:17) (cid:16) (cid:17) (23) of the state functionof the device,which is utilized to predict\n+Tr (cid:20) (BK t )TP(B e K t )· k e1 s σ2 (cid:21) − (cid:16) AX t (cid:17) eT P (cid:16) A e X t (cid:17) , w th i e th fu X ture b s e ta in te g . a (2 c 6 o j) ns i t s an th t e m i a n t i r t i i x a .",
      "size": 538,
      "sentences": 4
    },
    {
      "id": 33,
      "content": ") (BK t )TP(B e K t )· k e1 s σ2 (cid:21) − (cid:16) AX t (cid:17) eT P (cid:16) A e X t (cid:17) , w th i e th fu X ture b s e ta in te g . a (2 c 6 o j) ns i t s an th t e m i a n t i r t i i x a . l condition of the state X t ,\neF 2 (X t )= eXT t PX t− AXe t T P AXe t , (24) Probl i e ni msofsuch objectivefunctionwith decisionvariables\nwith P being the constant (cid:16) positiv (cid:17) e sem (cid:16) idefi (cid:17) nite matrices, K is proved to be a non-convex nonlinear programming\ne e t\n=== 페이지 5 ===\n20\n0\n-20\n-40\n-60\n-80\n-100\n0 5 10 15 20 25 30 35 40\nTime/s\n(a)PositiontrajectoriesofAGVwithdifferent\nnumbersofsensingsamples ks\nm/noitisoP\n40\n20\n0\n-20\n-40\n-60\n-80\n-100\n0 5 10 15 20 25 30 35 40\nTime/s\n(b)PositiontrajectoriesofAGVwithdifferent\navailable W0\nm/noitisoP\n(c)PositiontrajectoriesofAGVwithdifferent\ndelaythresholdD0\nFig.3. Numerical results ofAGVwithdifferent parameters\nproblem.",
      "size": 898,
      "sentences": 4
    },
    {
      "id": 34,
      "content": "40\nTime/s\n(b)PositiontrajectoriesofAGVwithdifferent\navailable W0\nm/noitisoP\n(c)PositiontrajectoriesofAGVwithdifferent\ndelaythresholdD0\nFig.3. Numerical results ofAGVwithdifferent parameters\nproblem. Typical methods for solving such problems involve increasessharply due to the greatpressure of the uplinkcom-\nemploying gradient projection or interior point algorithms to munication and the limited communication resources. Since\nfind the suboptimal points [24]. In the following section, the more time are consumed in the uplink communications, the\ninteriorpointalgorithmisappliedtosolvetheaboveproblem. controlcommandsare difficult to be transmitted to the device\ntimely. The benefits on sensing accuracy cannotoffset a large\nIV. NUMERICAL RESULTS\nnumber of package losses, resulting in the control disorder\nInthissection,theoptimizerIPOPT[25]isappliedtoobtain shown in Fig. 3a. the numerical results with interior point algorithm. Take the Fig.",
      "size": 946,
      "sentences": 11
    },
    {
      "id": 35,
      "content": "S\nnumber of package losses, resulting in the control disorder\nInthissection,theoptimizerIPOPT[25]isappliedtoobtain shown in Fig. 3a. the numerical results with interior point algorithm. Take the Fig. 3(b) illustrates the position trajectories of AGV with\nbrakecontrolof the AGV asan example,which needsto stop different available W , with k = 10 and D = 150 ms.\n0 s 0\nthe AGV at the target position 0. The resource allocation and When the bandwidth resource is sufficient, such as W =\n0\ncontroller design are simulated and analyzed in this section.",
      "size": 548,
      "sentences": 6
    },
    {
      "id": 36,
      "content": "D = 150 ms.\n0 s 0\nthe AGV at the target position 0. The resource allocation and When the bandwidth resource is sufficient, such as W =\n0\ncontroller design are simulated and analyzed in this section. 1.5 MHz and W = 1 MHz, sensing and control packages\n0\nThe AGV with an initial speed of 0 m/s is required to move can be transmitted quickly with few packet losses, thus the\nforward and stop at the position 100 m ahead, i.e., X ini = controlperformanceofthesystemisbasicallythesame.When\n[100,0,0].Therestofthesimulationparametersarepresented there is no sufficient bandwidth, the packet delay increases\ninTABLEI,andthetrajectoriesunderdifferentparametersare significantly, and the packages drop easily, resulting in large\nshown in Fig. 3. trajectory fluctuations and making it converge slowly. TABLEI Furthermore, the trajectories of AGV with differentthresh-\nSIMULATIONPARAMETERS oldsofthecycletimeD areshowninFig.3(c),withk =10\n0 s\nand W = 1.5 MHz.",
      "size": 948,
      "sentences": 5
    },
    {
      "id": 37,
      "content": "luctuations and making it converge slowly. TABLEI Furthermore, the trajectories of AGV with differentthresh-\nSIMULATIONPARAMETERS oldsofthecycletimeD areshowninFig.3(c),withk =10\n0 s\nand W = 1.5 MHz. The trajectories are nearly the same\n0\nParameters Value Parameters Value\nwith different delays unless the delay bound is too harsh to\nσ 1.5 L 200 maintain a low package loss rate, which indicates that the\nβ 1000bit T d 0.05s delay compensationmethodadoptedin this paper is effective. γ 20bit Ts 0.05s\nSNR u 20 θu 0.001 V. CONCLUSION\nSNR d 30 θ d 0.002 In this paper, an analytical model of the closed-loop sys-\neu 0.001 ς 0.125 tem with communication, sensing and control coupled was\ne d 0.002 N 10 proposed. Specifically, the sensing error was measured by\nthe mean-square error of the maximum likelihood estimation. Fig.",
      "size": 821,
      "sentences": 6
    },
    {
      "id": 38,
      "content": "0.125 tem with communication, sensing and control coupled was\ne d 0.002 N 10 proposed. Specifically, the sensing error was measured by\nthe mean-square error of the maximum likelihood estimation. Fig. 3(a) illustrates the trajectories of AGV with different The communication delay and package loss probability were\nnumbers of sensing samples k , with W = 1.5 MHz and derived through the effective capacity theory, which relates\ns 0\nD =150ms.Whenk issmall,thereissignificantjitterinthe link layer performances with communication resources. The\n0 s\nstate trajectory, especially in the trajectory around 0, because control model under communication delay, package loss and\nthe small amount of sensing data cannot reduce the effect sensing error was established afterwards, and the stability-\nof the noise of sensing. When k becomes larger, the state communication-sensing inequality was derived.",
      "size": 891,
      "sentences": 6
    },
    {
      "id": 39,
      "content": "sing data cannot reduce the effect sensing error was established afterwards, and the stability-\nof the noise of sensing. When k becomes larger, the state communication-sensing inequality was derived. Besides, an\ns\ntrajectoriestendsto be a smootherprofile,and the increase of optimization problem was proposed to allocate the resources\nk leads to a faster convergence. However, when k reaches and obtain the controlcommandssimultaneously.The numer-\ns s\n17, the convergence speed of the system decreases sharply, ical results demonstrated the effectiveness of the proposed\nandthetrajectoryexceedsthetargetposition,whichwillbring algorithm and the complex relationships between system per-\ngreat collision risk when obstacles such as walls are located formance and resources. at the target position. The reason for this phenomenonis that APPENDIX A\nwhen k is small, the system has sufficient communication PROOF OF THEOREM1\ns\nresourcesto completethe uplinksensing services.",
      "size": 970,
      "sentences": 6
    },
    {
      "id": 40,
      "content": ". at the target position. The reason for this phenomenonis that APPENDIX A\nwhen k is small, the system has sufficient communication PROOF OF THEOREM1\ns\nresourcesto completethe uplinksensing services. In contrast, According to [15], the probability that the communication\nthe increasing number of the sensing samples enhances the delay {D i |i = d,u} exceeds the delay threshold D i,max\naccuracy of control instructions and thus improves the speed satisfies\nof state convergence. When k s is large, the packet loss rate Pr{D i ≥D i,max }≈e −θiCi(θi,Wi)Di,max =ǫ i , (27)\n=== 페이지 6 ===\nwhere ǫ\nu\nand ǫ\nd\nare the probabilities that the communication REFERENCES\ndelays of uplink and downlink communication exceeds D\nu [1] S. K. Rao, R. Prasad. “Impact of 5G technologies on industry 4.0,” in\nand D d respectively. Wireless personalcommunications, vol.100,pp.145–159,2018. According to (27), the uplink and downlink delays are [2] M. Attaran.",
      "size": 937,
      "sentences": 8
    },
    {
      "id": 41,
      "content": ". “Impact of 5G technologies on industry 4.0,” in\nand D d respectively. Wireless personalcommunications, vol.100,pp.145–159,2018. According to (27), the uplink and downlink delays are [2] M. Attaran. “The impact of 5G on the evolution of intelligent automa-\ntion and industry digitization,” in Journal of Ambient Intelligence and\nderived as\nHumanizedComputing, PP.1-17,2021. D =− ln(ǫ i ) (i=u,d) (28) [3] Technical Specification Group Services and System Aspects; Service\ni,max requirements forthe5Gsystem,3GPPTS22.261V19.1.0,2022\nθ C (θ ,W ,e )\ni i i i i [4] J.G.Dai,M.Gluzman.“Queueing networkcontrols viadeepreinforce-\nSince the calculation delay of the control commands and mentlearning,” inStochastic Systems, vol.12,no.1,pp.30–67,2022. the sensing delay of the sensors are relatively small in the [5] X. M. Zhang, Q. L. Han, X. Ge, et al. “Networked control systems: A\nsurveyoftrendsandtechniques,”inIEEE/CAAJ.Autom.Sin.,vol.7,no.",
      "size": 937,
      "sentences": 8
    },
    {
      "id": 42,
      "content": "022. the sensing delay of the sensors are relatively small in the [5] X. M. Zhang, Q. L. Han, X. Ge, et al. “Networked control systems: A\nsurveyoftrendsandtechniques,”inIEEE/CAAJ.Autom.Sin.,vol.7,no. controlloop,the maximumvalue of the cycle time D can be\nc 1,pp.1–17,2019. approximated as the sum of the maximum uplink delay and [6] H.Yang,K.Zhang,K.Zheng,etal.“Leveraginglinearquadraticregulator\ndownlink delay, i.e., costandenergyconsumptionforultrareliableandlow-latencyIoTcontrol\nsystems,”inIEEEInternetThingsJ.,vol.7,no.9,pp.8356–8371,2020. D c,max =D u,max +D d,max . (29) [7] K.Huang,W.Liu,Y.Li,A.SavkinandB.Vucetic,“WirelessFeedback\nControlWithVariablePacketLengthforIndustrialIoT,”inIEEEWireless\nIfthedelaysofthepackagesexceedthemaximumthreshold\nCommunications Letters, vol.9,no.9,pp.1586–1590, Sept.2020.",
      "size": 815,
      "sentences": 6
    },
    {
      "id": 43,
      "content": "Vucetic,“WirelessFeedback\nControlWithVariablePacketLengthforIndustrialIoT,”inIEEEWireless\nIfthedelaysofthepackagesexceedthemaximumthreshold\nCommunications Letters, vol.9,no.9,pp.1586–1590, Sept.2020. settled,thepackageswillbedropped.Inthiscase,thepackage [8] K. Huang, W. Liu, Y. Li, B. Vucetic and A. Savkin, “Optimal Down-\ndrop probability of the system is link–Uplink Scheduling of Wireless Networked Control for Industrial\nIoT,”in IEEEInternet ofThings Journal, vol. 7, no. 3,pp. 1756–1772,\nǫ c =1−(1−ǫ u )(1−ǫ d ). (30) March2020. [9] Z. Lu, G. Guo, “Control and communication scheduling co-design for\nnetworkedcontrolsystems:asurvey,”inInternationalJournalofSystems\nAPPENDIX B\nScience, vol.54,no.1,pp.189–203,2023. PROOF OF THEOREM2 [10] B. Chang, W. Tang, X. Yan, X. Tong and Z. Chen, “Integrated\nScheduling of Sensing, Communication, and Control for mmWave/THz\nThe inequality (13) is derived by the definition that the Communications inCellularConnected UAVNetworks,”inIEEEJ.Sel.",
      "size": 987,
      "sentences": 8
    },
    {
      "id": 44,
      "content": "en, “Integrated\nScheduling of Sensing, Communication, and Control for mmWave/THz\nThe inequality (13) is derived by the definition that the Communications inCellularConnected UAVNetworks,”inIEEEJ.Sel. AreasCommun.,vol.40,no.7,pp.2103-2113, 2022.\neffectivecapacityof theuplinkcommunicationisgreaterthan\n[11] S. M. Kay, Fundamentals of statistical signal processing: estimation\nthe corresponding arrival rate (4). theory.Prentice-Hall, Inc.,1993. As for inequality (14), since the departure process L of [12] A. Slalmi, R. Saadane, A. Chehri, et al. “How will 5G transform\nu industrial IoT: Latency and reliability analysis,” Human Centred Intel-\nthe uplink queue is [22, Eqn. 10]\nligent Systems: Proceedings of KES-HCIS 2020 Conference. Springer\nλ\nu\n, 0≤θ\nd\n≤θ\nu\nSingapore, vol.189,pp.335–345,2021. L u (θ u ,θ d )=  + θ 1 d λ { u ( θ θ u d } − , θ u θ ) d C > u θ (θ u u−θ d ,B u ,e u ) . (31) [13] 2 b 3 Y lo 5 . c 9 P k , l o e 2 l n y 0 g a 1 t n 0 h s . k re iy g , im H e .",
      "size": 979,
      "sentences": 11
    },
    {
      "id": 45,
      "content": "pp.335–345,2021. L u (θ u ,θ d )=  + θ 1 d λ { u ( θ θ u d } − , θ u θ ) d C > u θ (θ u u−θ d ,B u ,e u ) . (31) [13] 2 b 3 Y lo 5 . c 9 P k , l o e 2 l n y 0 g a 1 t n 0 h s . k re iy g , im H e . ,” V. in P I o E o E r, E S T . r V a e n r s d . ú I . nf “ . C T h h a e n o n r e y l ,v c o o l d . i 5 n 6 g , r n a o te .5 i , n p t p h . e 2 fi 30 n 7 it – e\nBy substituting (  31) into (5), the arrival rate of the downlink [14] National Institute of Standards and Technology (NIST), “Guide to\nqueue λ is given as follows Industrial Control Systems (ICS) Security: Revision 2,\" NIST Special\nd Publication 800–822,May2015. λ (β,k ,T ,θ ,θ ,B ,e )=\nd s s u d u u [15] D.Wu,R.Negi.“Effectivecapacity: awirelesslinkmodelforsupport\nβ\nN\nk\nγ\ns\nλ\nu\n, 0≤θ\nd\n≤θ\nu (32) p\no\np\nf\n. q\n6\nu\n3\na\n0\nli\n–\nty\n64\no\n3\nf\n,\ns\n2\ne\n0\nr\n0\nv\n3\nic\n. e,” in IEEE Trans. Wireless Commun., vol. 2, no. 4,\n  βk N s γ θd {(θ d −θ u )C u (θ u−θ d ,B u ,e u ) .",
      "size": 937,
      "sentences": 18
    },
    {
      "id": 46,
      "content": "N\nk\nγ\ns\nλ\nu\n, 0≤θ\nd\n≤θ\nu (32) p\no\np\nf\n. q\n6\nu\n3\na\n0\nli\n–\nty\n64\no\n3\nf\n,\ns\n2\ne\n0\nr\n0\nv\n3\nic\n. e,” in IEEE Trans. Wireless Commun., vol. 2, no. 4,\n  βk N s γ θd {(θ d −θ u )C u (θ u−θ d ,B u ,e u ) . [16] I.Muhammad,H.Alves,N.H.Mahmood,etal.“Missioneffective ca-\n+λ u θ u}, θ d >θ u pacity—Anoveldependabilitymetric:Astudycaseofmulticonnectivity-\nenabled URLLC for IIoT,” in IEEE Trans. Ind. Inf., vol. 18, no. 6, pp. Therefore,according to the definition of the effective ca-\n4180–4188,2021. pacity, the inequality (14) holds. [17] J.Mei,K.Zheng,L.Zhao,L.LeiandX.Wang,“JointRadioResource\nAllocationandControlforVehiclePlatooninginLTE-V2VNetwork,”in\nIEEETrans.Veh.Technol.,vol.67,no.12,pp.12218-12230, 2018. APPENDIX C\n[18] Z. Galias, X. Yu. “Euler’s discretization of single input sliding-mode\nPROOF OF THEOREM3 control systems,” in IEEE Trans. Autom. Control, vol. 52, no. 9, pp. 1726–1730,2007. Defining a quadratic Lyapunov function\n[19] S. Sastry.",
      "size": 952,
      "sentences": 22
    },
    {
      "id": 47,
      "content": "scretization of single input sliding-mode\nPROOF OF THEOREM3 control systems,” in IEEE Trans. Autom. Control, vol. 52, no. 9, pp. 1726–1730,2007. Defining a quadratic Lyapunov function\n[19] S. Sastry. “Lyapunov stability theory,” Nonlinear Systems: Analysis,\n∆(X )=XTPX (33) Stability, andControl, PP.182–234,1999. t t t [20] G. P. Liu, J. X. Mu, D. Rees, et al. “Design and stability analysis of\nwith P given as a positive definite matrix. networkedcontrolsystemswithrandomcommunicationtimedelayusing\nAccording to LaSalle’s invariance principle [19], the suffi- the modified MPC,” in International Journal of Control, vol. 79, no. 4,\npp.288–297,2006. cient conditions of an asymptotic convergentsystem is\n[21] B. R. JBJ, D. Q. Mayne. Model predictive control theory and design. E[∆(X )|X ]≤∆(X ). (34) NobHillPub,Llc,1999. t+1 t t\n[22] Y. Wang, X. Tao, Y. T. Hou, et al. “Effective capacity-based resource\nSubstituting(3)and(21)into(34),thetheoremcanbeproved.",
      "size": 959,
      "sentences": 19
    },
    {
      "id": 48,
      "content": "heory and design. E[∆(X )|X ]≤∆(X ). (34) NobHillPub,Llc,1999. t+1 t t\n[22] Y. Wang, X. Tao, Y. T. Hou, et al. “Effective capacity-based resource\nSubstituting(3)and(21)into(34),thetheoremcanbeproved. allocation inmobileedge computing withtwo-stage tandem queues,” in\nIEEETrans.Commun.,vol.67,no.9,pp.6221–6233,2019. [23] F. L. Lewis “Linear quadratic regulator (LQR) state feedback design,”\nACKNOWLEDGMENT LecturenotesinDept.Elect.Engineering,UniversityofTexas,Arlington,\n2008. This work was supported in part by the National Natural [24] Z.Cheng,J.Ma,X.Li,etal.“Second-Order NonConvexOptimization\nScience Foundation of China (NSFC) under Grant 92267202, forConstrained Fixed-Structure Static OutputFeedback Controller Syn-\nthesis,” inIEEE Trans. Autom. Control, vol. 67, no. 9, pp. 4854–4861,\nin part by the National Key Research and Development\n2022. Programof China underGrant 2020YFA0711303,and in part [25] Y. Kawajir, C. Laird, A. Waechter.",
      "size": 946,
      "sentences": 14
    },
    {
      "id": 49,
      "content": "Autom. Control, vol. 67, no. 9, pp. 4854–4861,\nin part by the National Key Research and Development\n2022. Programof China underGrant 2020YFA0711303,and in part [25] Y. Kawajir, C. Laird, A. Waechter. Introduction to Ipopt: A tutorial\nby the NationalNaturalScience Foundationof China (NSFC) fordownloading,installing,andusingIpopt.(2023). [Online].Available:\nhttps://coin-or.github.io/Ipopt/\nunder Grant 62271081, and U21B2014.",
      "size": 426,
      "sentences": 8
    }
  ]
}