{
  "source": "ArXiv",
  "filename": "025_Coverage_Hole_Elimination_System_in_Industrial_Env.pdf",
  "total_chars": 31517,
  "total_chunks": 47,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nCoverage Hole Elimination System in Industrial\nEnvironment\nMervat Zarour∗, Shreya Tayade∗, Sergiy Melnyk∗ and Hans D. Schotten∗†\n∗Intelligent Networks Research Group, German Research Center for Artificial Intelligence, Kaiserslautern, Germany\n{mervat.zarour, shreya.tayade, sergiy.melnyk, Hans Dieter.Schotten}@dfki.de\n†Department of Wireless Communication and Navigation, Technical University of Kaiserslautern, Kaiserslautern, Germany\nschotten@eit.uni-kl.de\nAbstract—The paper proposes a framework to identify and thewirelesschannelreliabilityrequirements[4].Thereceivedsignal\navoid the coverage hole in an indoor industry environment. powerintheCHislowerthanthereceiver’ssensitivity,whichleads\nWe assume an edge cloud co-located controller that followers to channel failure and increased packet error rate. The significant\nthe Automated Guided Vehicle (AGV) movement on a factory challenge for ensuring system stability in the real-time closed-loop\nfloor over a wireless channel.",
      "size": 996,
      "sentences": 3
    },
    {
      "id": 2,
      "content": "creased packet error rate. The significant\nthe Automated Guided Vehicle (AGV) movement on a factory challenge for ensuring system stability in the real-time closed-loop\nfloor over a wireless channel. The coverage holes are caused controlledsystemisthedataexchangebetweenthesensors,actuators,\ndue to blockage, path-loss, and fading effects. An AGV in the and the edge cloud via highly reliable radio channels. Therefore,\ncoverageholemayloseconnectivitytotheedge-cloudandbecome the CH problem significantly impacts the stability of the networked\nunstable. To avoid connectivity loss, we proposed a framework controlled actuator.",
      "size": 626,
      "sentences": 6
    },
    {
      "id": 3,
      "content": "eholemayloseconnectivitytotheedge-cloudandbecome the CH problem significantly impacts the stability of the networked\nunstable. To avoid connectivity loss, we proposed a framework controlled actuator. The trajectory follower is a class of closed-\nthat identifies the position of coverage hole using a Support- loop control systems that provides the ability to track a reference\nVector Machine (SVM) classifier model and constructs a binary trajectory using error convergence between the current position and\ncoverageholemapincorporatingtheAGVtrajectoryre-planning the reference trajectory, under the condition that the reliability of\nto avoid the identified coverage hole. The AGV’s re-planned the transmission ensures the maintenance of closed-loop stability\ntrajectory is optimized and selected to avoid coverage hole the conditions [5].",
      "size": 838,
      "sentences": 4
    },
    {
      "id": 4,
      "content": "id the identified coverage hole. The AGV’s re-planned the transmission ensures the maintenance of closed-loop stability\ntrajectory is optimized and selected to avoid coverage hole the conditions [5]. If the AGV could be located in an area of CH, the\nshortestcoverage-hole-freetrajectory.Wefurtherinvestigatedthe connection outage can cause a delay in control input or the current\nlook-ahead time’s impact on the AGV’s re-planned trajectory sensor data update. Due to shadowing and multipath propagation,\nperformance. The results reveal that an AGV’s re-planned dynamic wireless coverage holes with high packet loss and packet\ntrajectory can be shorter and further optimized if the coverage delayprobabilityarecausedintheindustrialenvironment.Therefore,\nhole position is known ahead of time.",
      "size": 790,
      "sentences": 5
    },
    {
      "id": 5,
      "content": "s with high packet loss and packet\ntrajectory can be shorter and further optimized if the coverage delayprobabilityarecausedintheindustrialenvironment.Therefore,\nhole position is known ahead of time. increasing wireless signal propagation problems in the industrial\nKeywords— coverage hole detection, coverage hole map, trajec- environment requires a suitable solution to eliminate their effects of\ntory re-planning, wireless controlled AGV, SVM, binary classifica- the AGV mobility. tion\nA. Related work\nI. INTRODUCTION\nThe occurrence of a coverage hole in the current AGV trajectory\nIn Industry 4.0, edge-cloud computing technology in wireless increases the number of successive packet drops to the tolerance\nnetworked control systems receives growing attention.",
      "size": 764,
      "sentences": 5
    },
    {
      "id": 6,
      "content": "rent AGV trajectory\nIn Industry 4.0, edge-cloud computing technology in wireless increases the number of successive packet drops to the tolerance\nnetworked control systems receives growing attention. The major limit[6],whichincreasesthecontrolerror.IftheAGV’sdeviationis\nadvantage in this context is the ability to collect and process the more from the trajectory, it will not reach the target position and\nmassive amount of data generated by sensors and actuators at the leads to the controller’s instability. The author in [7] proposed a\nnetwork’sedge.Thisensuresreal-timedataprocessingandfacilitates systemtodetectthecoverageholebythedronewithouttransmitting\nthecontrollertoreacttoindustrialissues.Thereal-timerequirement a user report via a backhaul link. The Unmanned aerial vehicle\nin the edge cloud control system depends on the quality of the (UAV) has two modes as a user and as a base station. The UAV-\nwireless connection [1].",
      "size": 937,
      "sentences": 5
    },
    {
      "id": 7,
      "content": "via a backhaul link. The Unmanned aerial vehicle\nin the edge cloud control system depends on the quality of the (UAV) has two modes as a user and as a base station. The UAV-\nwireless connection [1]. So the high-reliability performance of the as-user measures the received signal power and switches the UAV\nwireless link in an industrial environment is essential as the signal to the second mode when a coverage hole is detected. The author\nmaybeblockedduetomanylargemachinesandmetalsurfaces.Also, in [8] proposed a goal-oriented communication system based on the\ntheenvironmentalstructureontheindustryfloorleadstopoorsignal adaptivedatarateaimingtocontrolgainimprovement.Theauthorhas\npropagation due to shadowing, blocking, and reflection effects. The modeled the packet delay and information freshness.",
      "size": 803,
      "sentences": 6
    },
    {
      "id": 8,
      "content": "orleadstopoorsignal adaptivedatarateaimingtocontrolgainimprovement.Theauthorhas\npropagation due to shadowing, blocking, and reflection effects. The modeled the packet delay and information freshness. Based on this,\npoorreceivedsignalpowerhasthepotentialtocauseaninterruption thewirelessnetworkedcontrolsystemisoptimizedusinganadaptive\nintheradiochannelandcoverageholesintheradiopowermap.Nev- datarate.Theauthorin[9]proposesMulti-LinkConnectivity(MLC)\nertheless, shadow fading and multi-path fading behave as stochastic to support highly reliable, low-latency wireless links. The goal-\nresponsesdependingonthedynamicsoftheenvironmentdepending oriented communication can be used as a solution for power map\nontheobstaclepositionorenvironmentlayoutchange.Theradiomap optimization. However, this conditions the knowledge of the signal\nforthewholepropagationenvironmentisthenrequired.Thedriving strength map.",
      "size": 903,
      "sentences": 5
    },
    {
      "id": 9,
      "content": "ontheobstaclepositionorenvironmentlayoutchange.Theradiomap optimization. However, this conditions the knowledge of the signal\nforthewholepropagationenvironmentisthenrequired.Thedriving strength map. The received signal strength map can be estimated\ntestisnotjusttimeintensive,butitiscomputationallyexpensive [2]. via stochastic or deterministic indoor propagation model [10]. The\nThe3rdGenerationPartnershipProject(3GPP)proposedaminimized stochasticmodelhasalowestimationaccuracysincetheexactindoor\ntest drive using User Equipment (UE) report information and UE geometry is not considered. The deterministic method, like the ray\nlocation assessment, so UE privacy is not considered [3]. Besides, tracing method, has a high accuracy level as the stochastic however,\nchannelestimationrequiresincreasedtransmissionbandwidth,which this method has relatively high computational time.",
      "size": 878,
      "sentences": 7
    },
    {
      "id": 10,
      "content": "ed [3]. Besides, tracing method, has a high accuracy level as the stochastic however,\nchannelestimationrequiresincreasedtransmissionbandwidth,which this method has relatively high computational time. The trajectory\nis a significant challenge in the current mobile communication planning algorithms such as Probabilistic Road-maps (PRM), which\nstandard.Therefore,theapplicationofmachinelearningalgorithmsis useasampledenvironmentmap,caneffectivelyfindtheshortesttra-\nappropriateinwirelesschannelmodelingandestimation.TheCover- jectoryfromthestarttothetargetpositionviasearchalgorithms[11].",
      "size": 588,
      "sentences": 3
    },
    {
      "id": 11,
      "content": "ningalgorithmsis useasampledenvironmentmap,caneffectivelyfindtheshortesttra-\nappropriateinwirelesschannelmodelingandestimation.TheCover- jectoryfromthestarttothetargetpositionviasearchalgorithms[11]. ageHole(CH)areacanbedefinedasanyareaintheenvironmentand The detected coverage hole positions can be iteratively added to the\nwithinapredefinedtransmittercoveragerange,whichdoesnotmeet sampledtrajectorysearchmaptofindtheoptimalcoverage-hole-free\n3202\nvoN\n7\n]IN.sc[\n1v11040.1132:viXra\n=== 페이지 2 ===\nEdge cloud Factory floor\nReferencetrajectory Wireless AGV control closed\nDetection Coverage Hole loop\nelimination (CHE) system\nCH-classifier\n(SVC model)\nBlind spot binary\noccupancy map 𝜒 Currentposition\nFactory Optimal avoidance\ndatabase C\nde\nH\nt\n-\ne\nlo\nc\nc\nto\na\nr\nl [(xbs,ybs),(xr,yr)] Re\n(S\n-p\nS\nla\nP\nn\nR\nn\n)\ner T\nt\nr\nr\na\na\nj\nc\ne\nk\nc\ni\nt\nn\no\ng\nry\nAGV\nCurrentreferencepath(xr,yr) Alternative trajectories\nTrajectoryplanner Control input\nReference\nFigure1.",
      "size": 953,
      "sentences": 2
    },
    {
      "id": 12,
      "content": "to\na\nr\nl [(xbs,ybs),(xr,yr)] Re\n(S\n-p\nS\nla\nP\nn\nR\nn\n)\ner T\nt\nr\nr\na\na\nj\nc\ne\nk\nc\ni\nt\nn\no\ng\nry\nAGV\nCurrentreferencepath(xr,yr) Alternative trajectories\nTrajectoryplanner Control input\nReference\nFigure1. EnhancededgecloudAGVtrajectoriesfollowerwiththeCHelimination(CBSE)system\ntrajectory. In [12], the author proposed the avoidance concept with cloudasabinarymap.Theblackpixelsrepresentblockedpositions,\nBe´zier curve optimization for an unknown binary map environment whichcannotbeenteredbyAGV,whereasthewhitepixelsrepresent\nvia a trajectory re-direction around the blocked position using the the free AGV-working area 5a. After coverage hole detection, the\nclose-set positions before and behind the blocked position. So in binary Coverage Hole (CH) map is constructed.",
      "size": 765,
      "sentences": 5
    },
    {
      "id": 13,
      "content": "ked position using the the free AGV-working area 5a. After coverage hole detection, the\nclose-set positions before and behind the blocked position. So in binary Coverage Hole (CH) map is constructed. Based on the CH-\nthiswork,theproposedtrajectoryre-planalgorithmfindsthesecond localdetectorresponse,thecurrentreferencepathisupdatedviathe\noptimal trajectory as an alternative trajectory, which describes the trajectory re-planner generating the alternative CH-free trajectory as\nshortest coverage-hole-free trajectory to the target position. a reference input for trajectories follower. The reference trajectories\nT consist of the reference trajectory positions (x ,y ) in (x,y)-\nr r r\nB. Contribution and organization of the paper industry area coordinates, AGV orientation to the x-axis (θ ) and\nc\nThe effect of coverage holes on AGV trajectory acquisition re- the reference linear as well as angular velocity (v r ,ω r ). The CH\nquires coverage hole position detection and an avoidance strategy.",
      "size": 998,
      "sentences": 8
    },
    {
      "id": 14,
      "content": "The effect of coverage holes on AGV trajectory acquisition re- the reference linear as well as angular velocity (v r ,ω r ). The CH\nquires coverage hole position detection and an avoidance strategy. classifier constructs the CH binary map. There are two classes of\nSothisworkproposesanML-binarycoverageholemapconstruction receiver power: The positions with a receiving power below the\nfor the whole industry layout map iterative considering the layout sensitivity threshold of the receiver are assigned to the CH-class\nor wireless transmission parameter change. So it is a binary rep- (y = 0). Otherwise, the position with sufficient receiving power\nresentation of the detected coverage or non-coverage hole positions. above the receiver’s sensitivity threshold is categorized as the non-\nThen,thecoverageholeavoidancestrategyproposesviaanalternative CH-class (y = 1). The industry map can be represented as a CH\ntrajectory re-planning algorithm.",
      "size": 946,
      "sentences": 8
    },
    {
      "id": 15,
      "content": "vity threshold is categorized as the non-\nThen,thecoverageholeavoidancestrategyproposesviaanalternative CH-class (y = 1). The industry map can be represented as a CH\ntrajectory re-planning algorithm. The trajectory re-planner maintains binarymapχusingeachposition’sclassassignment.Sotheposition\nthat the alternative trajectory is the second optimal trajectory in with the CH-class is represented as a black pixel in the binary map. the sampled environment map. To the author’s knowledge, such a And the position with the non-CH-class is described as a white\ncoverage hole elimination system for edge cloud wireless trajectory pixel. As shown in Figure 1, the CH detection is performed in two\ncontrol has yet to be proposed. steps. First, the CH classifier should be able to assign the industry\nSection 2 provides an overview and a detailed description of positions after training to two classes yˆ ∈ {0,1}.",
      "size": 906,
      "sentences": 8
    },
    {
      "id": 16,
      "content": "to be proposed. steps. First, the CH classifier should be able to assign the industry\nSection 2 provides an overview and a detailed description of positions after training to two classes yˆ ∈ {0,1}. Then, a binary\nthe enhanced edge cloud AGV trajectories via the coverage hole CHmapχcanbecreatedusingindustrypositionclassassignments. elimination (CHE) system. Section 3 describes the implementation Second, considering the current CH binary map can determine the\nof the binary coverage hole map construction. Furthermore, the local detector if the current reference trajectory contains any CH. performances of coverage hole detection are analyzed. Section 4 Then, the position of the CH (x bs ,y bs ) should be submitted to the\npresents the performance of trajectory tracking considering the re- trajectories re-planner. That means the AGV has prior information\nplanned trajectory. Finally, in Section 5, the paper is summarized.",
      "size": 929,
      "sentences": 11
    },
    {
      "id": 17,
      "content": "esents the performance of trajectory tracking considering the re- trajectories re-planner. That means the AGV has prior information\nplanned trajectory. Finally, in Section 5, the paper is summarized. about the CH position, which can occur after a time interval Look-\nAheadTime(LAT)inreferencepositions.Thetrajectoriesre-planner\nII. SYSTEMMODEL createsalternativeoptimalreferencetrajectoriesconsideringtheLAT\nTheFigure1describestheco-locatedCoverageHoleElimination betweenthecurrentAGVpositionatthetimestepkandthedetected\n(CHE) system in the AGV wireless trajectory following.",
      "size": 575,
      "sentences": 5
    },
    {
      "id": 18,
      "content": "cetrajectoriesconsideringtheLAT\nTheFigure1describestheco-locatedCoverageHoleElimination betweenthecurrentAGVpositionatthetimestepkandthedetected\n(CHE) system in the AGV wireless trajectory following. Each AGV CHpositionatthetimestepk bs .Thenupdatedreferencetrajectories\nis assisted via a wireless trajectory follower to track a predefined are utilized at the trajectories follower to return a corresponding\ntrajectoryfromastartpositiontoatargetpositiononthefactoryfloor controlinputtoAGVtominimizetheerrorbetweenthecurrentAGV\nwithinagiventimeT.Thedataisexchangedbetweentheedgecloud positionandthereferenceposition(x r ,y r ,θ r ).Theinputinformation\nand the industrial floor via wireless communication. The trajectory for the CH classifier is obtained from the industry database.",
      "size": 780,
      "sentences": 3
    },
    {
      "id": 19,
      "content": "d positionandthereferenceposition(x r ,y r ,θ r ).Theinputinformation\nand the industrial floor via wireless communication. The trajectory for the CH classifier is obtained from the industry database. This\nplannerdeterminestheoptimalreferencetrajectorypositions(x ,y ), information should include the current industry conditions and the\nr r\nand the corresponding reference interpolated trajectories T in the available RF-propagation information. Therefore, at each iteration\nr\n(x,y)-industrialcoordinatesystem.Atrajectoryplannerandfollower kth,theCHEshoulddetecttheCHinthecurrentreferencetrajectory\nare located in the edge cloud. Each AGV receives the necessary and then avoid them accordingly. trajectory control information to follow the reference trajectory. The\nproposedCHEsystemtargetstodetectthepositionoftheCHinthe\nIII. COVERAGEHOLEDETECTION\ncurrent AGV reference trajectory and to provide optimal alternative As shown in Figure 2, the possible position of the CH on the\ntrajectories.",
      "size": 990,
      "sentences": 8
    },
    {
      "id": 20,
      "content": "detectthepositionoftheCHinthe\nIII. COVERAGEHOLEDETECTION\ncurrent AGV reference trajectory and to provide optimal alternative As shown in Figure 2, the possible position of the CH on the\ntrajectories. The sample time interval of the CHE system is dt. The reference trajectory is determined in two steps. In the first step, a\ncoverageholeshouldbedetectedandavoidedateachkth timestep. trained binary classifier model should detect the CH positions using\nThe AGV obtains the control input from the trajectory follower at support vector machine approach SVM. Each ith position has true\neach kth time step.",
      "size": 600,
      "sentences": 7
    },
    {
      "id": 21,
      "content": "sifier model should detect the CH positions using\nThe AGV obtains the control input from the trajectory follower at support vector machine approach SVM. Each ith position has true\neach kth time step. The industry layout is represented in the edge class assignments y ∈ {0,1} and detected class assignments from\n[표 데이터 감지됨]\n\n=== 페이지 3 ===\nCoverage hole classifiermodeltraining Coverage hole detection\n(𝐑𝐒𝐒𝐬𝐟)\n𝐑𝐒𝐒𝐩𝐥 test data set\n(𝐑𝐒𝐒𝐬𝐟) Data assignment (𝐲𝐢∈{𝟏,𝟎})\n(X(cid:2919)∈𝑅(cid:3040)) (𝑦(cid:2919)∈{1,0})\nTraining algorithm(SVM) Classifiermodel(SVC) (𝑦(cid:3548)(cid:2919)∈{1,0}) Classification\nperformance\nBinary occupancymap (x(cid:2928),y(cid:2928)) Current\nreferencepath\n𝐑𝐒𝐒𝐩𝐥 Training data set(𝐗𝐢∈𝑹𝒎)\nlocal-detection (x(cid:2912)(cid:2929),y(cid:2912)(cid:2929))\nCov\np\ne\no\nra\ns\ng\nit\ne\nio\nh\nn\nole\nFigure2. CHclassifiermodel(SVC),CHbinarymapconstruction,CHlocal-detectioninthecurrentreferencepath.",
      "size": 904,
      "sentences": 4
    },
    {
      "id": 22,
      "content": "∈𝑹𝒎)\nlocal-detection (x(cid:2912)(cid:2929),y(cid:2912)(cid:2929))\nCov\np\ne\no\nra\ns\ng\nit\ne\nio\nh\nn\nole\nFigure2. CHclassifiermodel(SVC),CHbinarymapconstruction,CHlocal-detectioninthecurrentreferencepath. theclassifiermodelyˆ ∈{0,1}inthetrainingphase.Then,detected two classes requires a nonlinear hyperplane feature space Rm using\ni\nclassassignmentsintheclassifiertestphaseareconsideredtocreate Radial Basis Kernel (RBK) kernel. The penalty parameter in the\nthe binary CH map. The second step is local-determining the CH in SVC represents the inverse effect of the regularization parameter. thecurrentreferencetrajectory.ThedetectedCHcoordinateposition The penalty parameter and kernel parameter are determined by L-\n(x ,y ) should be forwarded to the trajectories re-planner. The fold cross-validation. bs bs\nindustry database has information for each position on the industry\nfloor. This information is intended to keep the available information A.",
      "size": 946,
      "sentences": 9
    },
    {
      "id": 23,
      "content": "trajectories re-planner. The fold cross-validation. bs bs\nindustry database has information for each position on the industry\nfloor. This information is intended to keep the available information A. Channel measurement\nabout the RF propagation at each time, the industry layout the For a specific industry layout, the received signal power can be\noperating frequency, the transmitter position, the transmitter height, changed depending on several parameters, e.g., the variation of the\nand the mean RF path-loss at each position. However, the machine height and the position of the transmitter, as well as the operating\nlearning classifier will consider the RF signal loss by the multi-path frequency and the distance to the transmitter. The mean path-loss\nand shadow fading as a binary CH map.",
      "size": 794,
      "sentences": 7
    },
    {
      "id": 24,
      "content": "as well as the operating\nlearning classifier will consider the RF signal loss by the multi-path frequency and the distance to the transmitter. The mean path-loss\nand shadow fading as a binary CH map. That means the trained value under change of these parameter changes should obtain at the\nclassifier should find the correct position class assignment based on modeltrainingfromthepath-lossmapRSS mapwhereRSS map\npl pl\nthedatavectorforeachposition.TheSupportVectorClassifier(SVC) is obtained considering Hata’s model in the QuaDRiGa industrial\nis trained with true position assignments y ∈ {0,1} based on the scenario. Furthermore, the data assignment is done from the RSS\nsf\nReceived Signal Strength (RSS) map in Non-Line-of-Sight (NLOS) industrialmapconsideringtheshadowingeffectaswellasthemulti-\npropagation model. Each ith position in the industry map will be path effect.",
      "size": 875,
      "sentences": 5
    },
    {
      "id": 25,
      "content": "eceived Signal Strength (RSS) map in Non-Line-of-Sight (NLOS) industrialmapconsideringtheshadowingeffectaswellasthemulti-\npropagation model. Each ith position in the industry map will be path effect. A random decrease in the signal strength occurs due to\ndescribedbyafeaturesvectorX i inanm-dimensionalfeaturespace reflections,scatteringfrommetallicsurfaces,andmultipleduplicates\nRm.Thesefeaturesareprovidedasinputinformationtotheclassifier\nof the transmitted signal arrive. At the receiver, multiple paths lead\nfor each position from the industry database. It should contain the to variations in the received signal strength. consequently a CH can\nRFtransmissionparameterandtheavailableRFindustrypropagation occur in the RSS coverage map. As shown in Figure 2, the area\nsf\nconditionsateachpositionusingQUAsiDeterministicRadIochannel around (25,−20) is the industry RSS map with height loss of\nsf\nGenerAtor(QuaDRiGa)channelmodelintheindustrialenvironment, received signal power.",
      "size": 978,
      "sentences": 7
    },
    {
      "id": 26,
      "content": "tionsateachpositionusingQUAsiDeterministicRadIochannel around (25,−20) is the industry RSS map with height loss of\nsf\nGenerAtor(QuaDRiGa)channelmodelintheindustrialenvironment, received signal power. Although, in the RSS map, this wireless\npl\n[13]. After that, the unlabeled data set is described as a matrix channel loss does not appear in this area. The training data set is\n[ w X it i h j ] n m ×m is ; t ( h i e = nu 1 mb : er n) of ob fe se a r tu v r a e ti s o . n E p ac o h siti i o th ns, ob a s n e d rv ( a j tio = n p 1 os : it m ion ) A as f s t i e g r ne th d at w , i t t h h e th tr e ai c n o e r d re S ct V p C os s it h i o o u n ld as b si e gn a m bl e e nt t s o v a i s a si t g h n e C R H SS P p s o f s v it a i l o u n e s . should be assigned to one of the two classes y i = {0,1}. The asapositiveclassbasedontheavailableinputinformationfromthe\nclass assignments y are obtained from the received signal power industry floor.",
      "size": 955,
      "sentences": 7
    },
    {
      "id": 27,
      "content": "hould be assigned to one of the two classes y i = {0,1}. The asapositiveclassbasedontheavailableinputinformationfromthe\nclass assignments y are obtained from the received signal power industry floor. As in Figure 2 show, the QuaDRiGa,[13], is used to\nmap, including multi-path and shadow fading effects. Therefore, the createtheRSSmap;theredpositionisthetransmitterwithmultiple\ntraining and validation phase determines the nonlinear hyperplane randomly distributed receivers. parameter. So the trained SVC can separate the positions of the\nindustrial map in the m-dimensional features space Rm using the B. Coverage hole detection performance\nlabeled data set [X ,y ]. The trained SVC should then be able to\ni i Since the CH classifier is used to separate imbalanced binary\nprovide the correct position assignment yˆ ∈ {0,1} using the test\ni classes based on the available database information.",
      "size": 894,
      "sentences": 8
    },
    {
      "id": 28,
      "content": "n be able to\ni i Since the CH classifier is used to separate imbalanced binary\nprovide the correct position assignment yˆ ∈ {0,1} using the test\ni classes based on the available database information. The Receiver\ndataset.TheSVCresponseyˆ describesbinarypositionassignments\ni Operating Characteristic (ROC) curve is proposed to determine the\nthat can be represented in the (x,y) industry coordinate as a CH\noperating point for the classifier model as shown in Figure 3. The\nbinarymap.Inthesecondstep,thecurrentAGVreferencetrajectory\ntrue positive and the false positive CH class ”0” prediction rate is\n(x ,y ) at each time step (k = 0 : T) is checked to determine\nr r dt calculated with a variable prediction threshold. However, with the\nif it has the potential to contain a CH. As illustrated in Figure 2,\noptimal threshold selection, the overfitting problem is avoided.",
      "size": 870,
      "sentences": 5
    },
    {
      "id": 29,
      "content": "alculated with a variable prediction threshold. However, with the\nif it has the potential to contain a CH. As illustrated in Figure 2,\noptimal threshold selection, the overfitting problem is avoided. On\nwehaveimplementedtheRSS mapwithconsiderationofthemean\npl the other side, the trade-off between true and false decisions, the\npath-loss values using the empirical industrial channel model and\nCH,isestablished.Thefree-CHareacanbereducediftheCHfalse\nthe RSS map with consideration of the shadow and multi-path\nsf alarm detection is higher. The classifier has 0.97 Area Under Curve\nfading propagation effects. Both power maps in Figure 2 include\n(AUC),whichmeansthatourclassifierhasthepotentialtopredictthe\natransmitter(redpoint)andmulti-randomdistributedreceivers(blue\nCHclasscorrectlybutstillneedstofindtheoptimaloperationpoint\npoints) in an industry layout [13]. The input information [X ]\nij n×m which balances the false and true positive rate.",
      "size": 947,
      "sentences": 7
    },
    {
      "id": 30,
      "content": "ibutedreceivers(blue\nCHclasscorrectlybutstillneedstofindtheoptimaloperationpoint\npoints) in an industry layout [13]. The input information [X ]\nij n×m which balances the false and true positive rate. The geometric mean\nis extracted from the RSS maps for the model training as well as\npl betweenthefalsepositiverate(FPR)andthetruepositiverate(TPR)\nfor model testing. However, the position assigning in two categories\nisusedtodetectit.Theoperationpointoftheclassifierisdetermined\ny ∈ {0,1} are obtained from the RSS map. The labeled test\ni sf with 87% true positive rate as shown inFigure 3 as a red point. data set is also necessary to analyze the model performance by\nNevertheless,itisaccompaniedbya2%falsepositiveCHprediction\ncomparing the correct class assignment y from the RSS map and\ni sf rate. However, as shown in Figure 4, the classifier performance is\nthe class assignments form the classifier yˆ.",
      "size": 906,
      "sentences": 7
    },
    {
      "id": 31,
      "content": "ositiveCHprediction\ncomparing the correct class assignment y from the RSS map and\ni sf rate. However, as shown in Figure 4, the classifier performance is\nthe class assignments form the classifier yˆ. The separation of the\ni analyzed regarding the CH class so that the CH detection metrics\n[표 데이터 감지됨]\n\n=== 페이지 4 ===\nBlind spot classifier model (SVC)\n1\nnoitceted\nstopsdnilb\nevitisop\neurt\nfo\netaR 0\n0\n0\n0\n. . . . 2\n4\n6\n8 (0.02,0.87)\nPo\nA\ns\nU\niti\nC\nve\n=\nc\n0\nla\n. s\n9\ns\n7\n: 0\nR\nAr\nO\ne\nC\na u\nc\nn\nu\nd\nrv\ne\ne\nr curve (AUC)\nCurrent classifier\n0\n0 0.2 0.4 0.6 0.8 1\nRate of false positive blindspots detection\nFigure3. Receiveroperatingcharacteristic(ROC)ofthetrainedmodel\nFN\n997\nFP\n487\nPredictedclass\nssalclautcA\n‘‘0‘‘\n‘‘1‘‘\nlength trajectory segments [14]. So, each segment is optimized with\nthe Be´zier curve. B. Trajectories re-planner using SSPR\nThe optimization of the alternative trajectory is accomplished\nconsidering the look-ahead time.",
      "size": 937,
      "sentences": 12
    },
    {
      "id": 32,
      "content": "ments [14]. So, each segment is optimized with\nthe Be´zier curve. B. Trajectories re-planner using SSPR\nThe optimization of the alternative trajectory is accomplished\nconsidering the look-ahead time. The look-ahead time defines the\ntimerangeinwhichthesystemshouldfindanoptimalalternative.The\nalgorithmfindstheoptimalalternativetrajectoryinthecorresponding\nPRM map based on the current CH binary map χ. Then, using\nthe proposed Start Selection Path Re-planning (SSPR) algorithms\na start position for the trajectory re-route SP (t = t ) should re re\nbe determined to provide a shorter alternative trajectory from the\ninitial start position to the target position. As illustrated in 5a, CH\npositionsareclassifiedatthetimestepk,andtheCHbinarymapis\nupdated. A start position for trajectory re-routing is planned within\nthelook-aheadtime.Thealternativeoptimizationmethodguarantees\nthat the AGV follows the first optimal trajectory within a specific\nTP TPR FNR timebeforestartingtheavoidanceprocess.",
      "size": 992,
      "sentences": 8
    },
    {
      "id": 33,
      "content": "ng is planned within\nthelook-aheadtime.Thealternativeoptimizationmethodguarantees\nthat the AGV follows the first optimal trajectory within a specific\nTP TPR FNR timebeforestartingtheavoidanceprocess. 5apresentedaCHbinary\n2527 71.7% 28.2% map χ(k) as an example of the classifier output at the time step k.\nThe initial trajectory, which is presented in red, is planned in the\nTN PPV FPR previous coverage hole binary map χ(k−1); thereby, the position\n26592 83.9% PPV 1.8% at (20,21) was assigned to the CH-free workspace. Then, the CH\n83.9% map is updated at the next time step (k), and a coverage hole is\n‘‘0‘‘ ‘‘1‘‘ Class ‘‘0‘‘ prediction determined at (20,21). The CH detector gives the CH position at performance\ntime step k to the trajectories re-planner. bs\nFigure4. ConfusionmatrixofthemodeltestandCHdetectionperformance;\nTP:truepositive,FN:falsenegative. C. Trajectory re-planning performance\nThis section analyzes the performance of the SSPR.",
      "size": 950,
      "sentences": 7
    },
    {
      "id": 34,
      "content": "planner. bs\nFigure4. ConfusionmatrixofthemodeltestandCHdetectionperformance;\nTP:truepositive,FN:falsenegative. C. Trajectory re-planning performance\nThis section analyzes the performance of the SSPR. The AGV\nshould avoid the CH position and reach the target position with an\nare extracted from the classification confusion matrix. As expected, acceptable trajectory coordinate error. Under the condition of the\nthe classifier model can predict the CH class with a true positive AGV speed limitation v , the re-planning performance depends\nmax\nrate TPR = TP = 71.7%. However, this is also accompanied ontheLATisanalyzed,ascanbeseeninFigure6.Thisisexpected\nTP+FN\nby the false positive CH prediction rate FPR = FP = 1.8%.",
      "size": 718,
      "sentences": 8
    },
    {
      "id": 35,
      "content": "performance depends\nmax\nrate TPR = TP = 71.7%. However, this is also accompanied ontheLATisanalyzed,ascanbeseeninFigure6.Thisisexpected\nTP+FN\nby the false positive CH prediction rate FPR = FP = 1.8%. thatgreaterLATprovidesmoretrajectoryre-routingpossibilities.The\nTN+FP\nThe increase in the accuracy of CH prediction is achieved with an optimalalternativetrajectorystronglydependsonLATandisgetting\nincreased prediction rate of false alarm, which reduces the working reduced with increased LAT; if we make a CH detection earlier, we\nspaceofAGV.Nevertheless,thistrade-offbetweenTPRandFPRis gainmorepossibilitiestoachievemoreoptimizationatCHavoidance. limited within the ROC curve. Conversely, The LAT depends on how often the CH on the AGV\ntrajectoryoccursanddisappears.InFigure6,theanalysisofmultiple\nIV.",
      "size": 802,
      "sentences": 5
    },
    {
      "id": 36,
      "content": "itiestoachievemoreoptimizationatCHavoidance. limited within the ROC curve. Conversely, The LAT depends on how often the CH on the AGV\ntrajectoryoccursanddisappears.InFigure6,theanalysisofmultiple\nIV. COVERAGEHOLEAVOIDANCE LATisexecutedat10simulations,andtheaveragetrajectorylengthis\nWhen a CH occurs in the current (x,y)-reference trajectory, plotted.Therandomlydistributednodepositionischanged.Thusthe\nthe trajectories re-planner should find alternative optimal reference PRM map is updated at each experiment due to the change of node\ntrajectories based on the updated CH binary map from the CH positions.Thetargetpositionremainsthesameinallexperiments.It\nclassifier.Thetrajectoryre-plannershouldfindtheoptimaltrajectory isclearthatatlargerLAT,theadditionaldistanceduetothetrajectory\nre-routing start SP to the initial target position, considering the re-route is reduced, and the alternative trajectory is minimized. re\nLAT between the current AGV position and the CH position.",
      "size": 980,
      "sentences": 5
    },
    {
      "id": 37,
      "content": "tory\nre-routing start SP to the initial target position, considering the re-route is reduced, and the alternative trajectory is minimized. re\nLAT between the current AGV position and the CH position. Then Furthermore, in Figure 6 is shown that with the increase of the\nthealternativetrajectorypositionsshouldinterpolateas(x r ,y r )and roadmapparameterN andD max thealternativetrajectorylengthis\nfrom it should calculate the appropriate reference AGV orientation minimizedforthesameremainingLAT.Nevertheless,theincreaseof\nθ , the linear as well as the winkle velocity (v ,w ). roadmapparametersislimitedbecauseofthecomputationresources\nr r r\nand the real-time system requirements. Consequently, the earlier the\nA. Trajectory planner using PRM coverage hole is identified, the shorter the alternative trajectory can\nbe found. But if the coverage hole position is assigned to the free\nUsing PRM the optimal initial reference trajectory is generated.",
      "size": 947,
      "sentences": 6
    },
    {
      "id": 38,
      "content": "age hole is identified, the shorter the alternative trajectory can\nbe found. But if the coverage hole position is assigned to the free\nUsing PRM the optimal initial reference trajectory is generated. AGV workspace after the re-route trajectory to start. Then, the LAT\nA search algorithm A-Star (A*) can find an optimal trajectory with\nshoulddecreasesincethemultiplere-routingincreasesthetrajectories\nminimallengthinthePRMmapundergivenstartandtargetpositions. following coordinate error. However, the multiple re-routing can be\nThe implementations of PRM are categorized into two phases a\noptimizedbyadjustingthePRMmapparametersandtheprobability\npreparationphaseandaqueryphase.Inthepreparationphase,aPRM\nof coverage hole occurrence and disappearance.",
      "size": 749,
      "sentences": 6
    },
    {
      "id": 39,
      "content": "PRM are categorized into two phases a\noptimizedbyadjustingthePRMmapparametersandtheprobability\npreparationphaseandaqueryphase.Inthepreparationphase,aPRM\nof coverage hole occurrence and disappearance. For highly dynamic\nmap is constructed using generated random nodes N in the industry\nRF propagation changes, the map parameters should increase to\nmap’sfreeAGVworkspaceandtheconnectionfromeachnodetoits\navoid the coverage hole considering the reduction of the alternative\nnearest neighbors by a straight line distance smaller than the radius\ntrajectory length and the tracked trajectory coordinates error. D .ThepossibleedgesE betweennodesN buildthePRMmap. max\nThen a graph search is performed using A* in PRM map to find\nV. CONCLUSION\noptimaltrajectorypoints.Therefore,thereferencetrajectoriesareall\npredefined trajectory information as reference data extracted from The proposed CHE system can detect and avoid the coverage\n(x,y)-trajectory points using the trajectory interpolation optimiza- hole.",
      "size": 999,
      "sentences": 4
    },
    {
      "id": 40,
      "content": "predefined trajectory information as reference data extracted from The proposed CHE system can detect and avoid the coverage\n(x,y)-trajectory points using the trajectory interpolation optimiza- hole. We evaluate the performance of coverage hole elimination\ntion.Thelinearandangularvelocityshouldbecustomizedunderthe in wireless controlled AGV use case in an industry environment. technical conditions of the AGV. The cubic Basis Spline (B-spline) With environment layout dependence, the trained SVC model can\ninterpolation with Be´zier function Ψ(·) can interpolate the variable identifythecoverageholepositionwithhighdetectionperformance.",
      "size": 639,
      "sentences": 4
    },
    {
      "id": 41,
      "content": "pline) With environment layout dependence, the trained SVC model can\ninterpolation with Be´zier function Ψ(·) can interpolate the variable identifythecoverageholepositionwithhighdetectionperformance. [표 데이터 감지됨]\n\n=== 페이지 5 ===\nBlind spot binary map\n100 3\n0.2\n90\n2.5\n80 .m\nn\n0.15\n.m\nn i\ne ta\nn id\nro\no c -y\n3\n4\n5\n6\n7\n0\n0\n0\n0\n0\nSSPR, LAT= 6.7 sec\ni ro\nrre\ne\nta n\nid\nro o c\n)y\n0\n0\n.0\n.1\n5 (\n(\nx,\n)\ny\ne\n)\nr\ne\nro\nrr\nr\no\ni\nr\nn\ni n\ntr a\ntr\nj\na\ne\nj\nc\ne\nt\nc\no\nt\nr\no\ny\nr y\nfo\nf\nl\no\nlo\nll\nw\no\ne\nw\nr\ner 1\n1\n2\n.5\n.d a\nr n\ni ro\nrre\n-\nInitial reference path ,x\n20 Alternative path ( Rerout start time step 0.5\nAGV traked path 0\n10\n0\n0\n0 20 40 60 80 100 1100 1150 1200 1250 1300 1350 1400 1450\nx-coordinate in m. Time step k\n(a)IndustryCHbinarymap[5]. (b)Thetrajectoryfollowererror. Figure5. Trajectoriesplanning,re-planning,andfollowing.",
      "size": 822,
      "sentences": 5
    },
    {
      "id": 42,
      "content": "0 40 60 80 100 1100 1150 1200 1250 1300 1350 1400 1450\nx-coordinate in m. Time step k\n(a)IndustryCHbinarymap[5]. (b)Thetrajectoryfollowererror. Figure5. Trajectoriesplanning,re-planning,andfollowing. PRM map prameter\nREFERENCES\n.m120\nn i\nh\nN\nN\nN\n=\n=\n=\n3\n4\n5\n0\n0\n0\n0\n0\n0\n,\n,\n,\nD\nD\nD\n=\n=\n=\n1\n1\n1\n0\n0\n0\nm\nm\nm\nN\nN\n=\n=\n5\n5\n0\n0\n0\n0\n,\n,\nD\nD\n=\n=\n5\n8\n0\nm\nm [1]\nt\nS\no\n.D\nre\ni\na\np\nl\ne\n-t\ns\ni\nh\nm\na\ne\nn\nf\nd\nra\nM\nct\n. io\nA\nn\nx\nal\nay\nd\n,\ne\n“\nla\nD\ny\ni\ns\nsc\na\nre\nn\nt\nd\ne-\np\nti\na\nm\nck\ne\ne\ns\nt\nli\nl\nd\no\ni\ns\nn\ns\ng\nes\nm\nf\no\no\nd\nr\ne\nn\nc\ne\no\ntw\nnt\no\nr\nr\no\nk\nll\ne\ne\nd\nr\nc\nsu\no\nb\nn\nj\nt\ne\nro\nc\nl\nt\nta115 system,”2017. ro\np\ne [2] H.-W.Liang,C.-H.Ho,L.-S.Chen,W.-H.Chung,S.-Y.Yuan,andS.-Y. f\nh\ntg\nv\nita\nn 110\nK\npr\nu\no\no\np\n,\nag\n“\na\nC\nt\no\nio\nv\nn\ner\nm\nag\no\ne\nde\nh\nl\no\n,”\nle\nin\nd\n2\ne\n0\nte\n1\nc\n6\nti\n2\no\nn\nn\nd\nin\nInt\nc\ne\ne\nr\nl\nn\nlu\na\nl\nt\na\nio\nr\nn\nn\na\ne\nl\ntw\nCo\no\nn\nrk\nfe\ns\nre\nw\nn\ni\nc\nth\neo\nd\nn\net\nI\ne\nn\nr\nt\nm\nel\ni\nl\nn\nig\nis\ne\nt\nn\nic\nt\nn e re GreenBuildingandSmartGrid(IGBSG),2016.\nl fo\ne\ntla\nd e 105\n[3]\nP\nA\n. .",
      "size": 978,
      "sentences": 9
    },
    {
      "id": 43,
      "content": "Int\nc\ne\ne\nr\nl\nn\nlu\na\nl\nt\na\nio\nr\nn\nn\na\ne\nl\ntw\nCo\no\nn\nrk\nfe\ns\nre\nw\nn\ni\nc\nth\neo\nd\nn\net\nI\ne\nn\nr\nt\nm\nel\ni\nl\nn\nig\nis\ne\nt\nn\nic\nt\nn e re GreenBuildingandSmartGrid(IGBSG),2016.\nl fo\ne\ntla\nd e 105\n[3]\nP\nA\n. . M\nG\na¨\na\nh\nl\no¨\nin\nn\nd\nen\no\n,\n-S\n“\ne\nA\nr\nu\nra\nto\nn\nm\no,\nat\nB\ned\n. c\nS\no\na\nv\ny\ne\nr\nr\na\na\nc\ng\n,\ne\nS\nh\n. ole\nBe\nd\nn\nete\nJ\nc\ne\nti\nm\non\naa\nf\n,\nor\nJ.\nce\nR\nllu\nii\nl\nh\na\ni\nr\nja¨\nn\nr\ne\nv\nt\ni\nw\n,\no\na\nr\nn\nk\nd\ns\nu la tc e usingradioenvironmentmaps,”2013. v\nn a e M\nle\ns m u 100\n[4]\nc o\nR\no n\n. v S\nJ\ne\nu\ni r g a\nrd\nn g\ni\na e\n,\nls h\nJ\n, o\n. S le\nG\ny s s\n. : te W\nA\nm\nn\nh s\nd\n, e\nr\nr a\ne\ne n\nw\nd t\ns\no\n,\nC d\nD\no e m\n. ns p\nP\ni u f\na\ny t\nr\ne\ns\n? r\no\n” s\nn\n, i\ns\nn 2\n,\n0 2\na\n1 0\nn\n7 1\nd\n. 7\nR\n5\n. 1s\nW\nt\n. A\nH\nsil\ne\no\na\nm\nth\na\n,\nr\n“\nC\nId\no\ne\nn\nn\nf\nt\ne\ni\nr\nf\ne\ny\nn\nin\nc\ng\ne\nm [5] S.Melnyk,S.Tayade,M.Zarour,andH.Schotten,“Wirelessindustrial\nin\nim\n95\ncommunicationandcontrolsystem:Aiassistedblindspotdetection-and-\ne\navoidanceforagvs,”2022.",
      "size": 921,
      "sentences": 14
    },
    {
      "id": 44,
      "content": "e\nn\nn\nf\nt\ne\ni\nr\nf\ne\ny\nn\nin\nc\ng\ne\nm [5] S.Melnyk,S.Tayade,M.Zarour,andH.Schotten,“Wirelessindustrial\nin\nim\n95\ncommunicationandcontrolsystem:Aiassistedblindspotdetection-and-\ne\navoidanceforagvs,”2022. h t 90 [6] S.Tayade,P.Rost,A.Ma¨der,andH.Schotten,“Cloudcontrolagvover\n0 1 2 3 4 5 6 7 rayleighfadingchannel-thefasterthebetter,”2019. Look ahead time in sec. [7] S.A.Al-Ahmed,M.Z.Shakir,andS.A.R.Zaidi,“Optimal3duavbase\nstation placement by considering autonomous coverage hole detection,\nFigure6. ThealternativetrajectorylengthwithvariousLAT. wirelessbackhaulanduserdemand,”2020. [8] P.M.d.S.Ana,N.Marchenko,B.Soret,andP.Popovski,“Goal-oriented\nwireless communication for a remotely controlled autonomous guided\nvehicle,”IEEEWirelessCommunications,2023. Then, the detected coverage hole is successfully avoided via the\n[9] M. Ehrig, M. Petri, V. Sark, A. G. Tesfay, S. Melnyk, H. Schotten,\nsuggested SSPR trajectory re-planner algorithm.",
      "size": 937,
      "sentences": 8
    },
    {
      "id": 45,
      "content": "nications,2023. Then, the detected coverage hole is successfully avoided via the\n[9] M. Ehrig, M. Petri, V. Sark, A. G. Tesfay, S. Melnyk, H. Schotten,\nsuggested SSPR trajectory re-planner algorithm. The AGV follows W.Anwar,N.Franchi,G.Fettweis,andN.Marchenko,“Reliablewire-\nthe optimal alternative trajectory and reaches the target position. lesscommunicationandpositioningenablingmobilecontrolandsafety\nThe larger LAT can improve coverage hole avoidance performance applications in industrial environments,” in 2017 IEEE International\nconsidering the AGV trajectory length. Moreover, the re-planning ConferenceonIndustrialTechnology(ICIT),2017.\nperformance regarding the alternative trajectory length can also be [10] D. Romero and S.-J. Kim, “Radio map estimation: A data-driven\nenhanced by increasing the PRM map parameters. However, the approachtospectrumcartography,”IEEESignalProcessingMagazine,\n2022.",
      "size": 908,
      "sentences": 7
    },
    {
      "id": 46,
      "content": "so be [10] D. Romero and S.-J. Kim, “Radio map estimation: A data-driven\nenhanced by increasing the PRM map parameters. However, the approachtospectrumcartography,”IEEESignalProcessingMagazine,\n2022. PRMmapparameterincreaseisconstrainedduetothecomputational\n[11] S.Alarabi,C.Luo,andM.Santora,“Aprmapproachtopathplanning\nedge cloud resources and real-time conditions. Nevertheless, the\nwithobstacleavoidanceofanautonomousrobot,”in20228thInterna-\nLATshouldadjustwiththecoverageholechangefrequencybecause\ntionalConferenceonAutomation,RoboticsandApplications(ICARA),\nthe unnecessary avoidance with larger LAT can increase the AGV 2022.\ncoordinate error. [12] J. Li and C. Yang, “Auv path planning based on improved rrt and\nbezier curve optimization,” in 2020 IEEE International Conference on\nACKNOWLEDGEMENTS MechatronicsandAutomation(ICMA),2020.",
      "size": 842,
      "sentences": 6
    },
    {
      "id": 47,
      "content": "error. [12] J. Li and C. Yang, “Auv path planning based on improved rrt and\nbezier curve optimization,” in 2020 IEEE International Conference on\nACKNOWLEDGEMENTS MechatronicsandAutomation(ICMA),2020. [13] S. Jaeckel, N. Turay, L. Raschkowski, L. Thiele, R. Vuohtoniemi,\nThe authors acknowledge the financial support by the Federal\nM. Sonkki, V. Hovinen, F. Burkhardt, P. Karunakaran, and T. Heyn,\nMinistry of Education and Research of the Federal Republic of\n“Industrial indoor measurements from 2-6 ghz for the 3gpp-nr and\nGermany(BMBF)intheproject“Open6GHub”withfundingnumber quadrigachannelmodel,”2019. (DFKI-16KISK003K) and in the project “AIRPoRT” with funding [14] P. E. Koch and K. Wang, “The introduction of b-splines to trajectory\nnumber (01MT19006A). The authors alone are responsible for the planningforrobotmanipulators,”Departmentofnumericalmathematics,\ncontent of the paper. 1988. [표 데이터 감지됨]",
      "size": 906,
      "sentences": 7
    }
  ]
}