{
  "source": "ArXiv",
  "filename": "040_Smart_Inventory_Management_System_for_Photovoltaic.pdf",
  "total_chars": 15403,
  "total_chunks": 22,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nISSN 2347 - 3983\nVolume 7, No. 10 October 2019\nJanus Jade A. Basa et al., International Journal of Emerging Trends in Engineering Research, 7(9), September 2019, 393 - 397\nInternational Journal of Emerging Trends in Engineering Research\nAvailable Online at http://www.warse.org/IJETER/static/pdf/file/ijeter057102019.pdf\nhttps://doi.org/10.30534/ijeter/2019/057102019\nSmart Inventory Management System for Photovoltaic-Powered Freezer Using\nWireless Sensor Network\nJanus Jade A. Basa1, Patrick Lourenz G. Cu2, Nathaniel N. Malabag3, Luigi Angelo V. Naag4, Dan Frederico P.\nAbacco5, Mar Jun M. Siquihod6, Gilfred Allen Madrigal7, Lean Karlo S. Tolentino8\n1,2,3,4,5,6,7,8Department of Electronics Engineering, Technological University of the Philippines, Manila,\nPhilippines\n8University Extension Services Office, Technological University of the Philippines, Manila, Philippines\n determining what is in stock or not and what is approaching\nABSTRACT end of shelf life.",
      "size": 980,
      "sentences": 2
    },
    {
      "id": 2,
      "content": "pines\n8University Extension Services Office, Technological University of the Philippines, Manila, Philippines\n determining what is in stock or not and what is approaching\nABSTRACT end of shelf life. Respondents’ suggestions were identified: it\nwould be helpful to receive recipes for leftovers; they like to\nAn inventory management system for the freezer powered by get advisories on how to best preserve and handle their food;\nphotovoltaic panels was developed in this study. It aims to and several would like to receive information on the shelf life\npromote energy efficiency and the responsible use of food. Its and freshness of its contents. Most respondents stated they\nsensor network is an Arduino-based wireless network of would prefer to use modern technology to receive this\nsensors on a solar-powered freezer that is used to develop a information, mainly by e-mail and software application for\nsmart inventory management system that is accessible and is smartphone. easy to use.",
      "size": 989,
      "sentences": 6
    },
    {
      "id": 3,
      "content": "rs on a solar-powered freezer that is used to develop a information, mainly by e-mail and software application for\nsmart inventory management system that is accessible and is smartphone. easy to use. By having network of sensors implemented inside\nthe freezer, the inventory of perishable and non-perishable By the socio-economic problems stated above and taking\nitems can easily be monitored without having to physically advantage of the survey results, this project aims to turn a\ncheck the inside of the freezer. In connection with this, a traditional chest freezer into a smart freezer, achieving a good\ncomplemental Android application was developed that would food management and storage, eco-efficiency and efficient\nreceive and display the data sent from the sensor network energy efficiency. The features implemented is not only to\nthrough GSM Shield SIM800L. mitigate food waste but also to utilize solar energy by using\nphotovoltaic panel.",
      "size": 950,
      "sentences": 6
    },
    {
      "id": 4,
      "content": "a sent from the sensor network energy efficiency. The features implemented is not only to\nthrough GSM Shield SIM800L. mitigate food waste but also to utilize solar energy by using\nphotovoltaic panel. They are designed not only for domestic\nKey words : inventory, food management, smart freezer, use but also for commercial and catering industries, as the\nwireless sensor network system is easy to reproduce in a large scale. The smart food\nmanagement and energy efficiency is the primary core of this\n1. INTRODUCTION system. Globally, about one third of human food produced is wasted 2. REVIEW OF RELATED LITERATURE\nwhich is roughly about 1.3 billion tons per year [1]. Food\nwaste increases losses in financial and global natural The smart refrigerator in [4] is a standard refrigerator that is\nresources.",
      "size": 805,
      "sentences": 8
    },
    {
      "id": 5,
      "content": "ITERATURE\nwhich is roughly about 1.3 billion tons per year [1]. Food\nwaste increases losses in financial and global natural The smart refrigerator in [4] is a standard refrigerator that is\nresources. The depletion of this natural resources is not fitted with a host of sensors and an image processing software\njustified by the consumption efficiency of produced food from for inventory and item recognition is an improved\nit. Food losses from those developing countries almost do not vision-based object detection and recognition of food\ndiffer from those industrialized countries, the food losses that inventory for the previous smart fridge. One drawback of its\noccur in post-harvest and processing levels is more than 40%, system is it cannot detect multiple items and object\nwhereas in industrialized countries, about 40% of food losses recognition was done by template matching which causes the\ntakes place in retail and consumer levels [2].",
      "size": 946,
      "sentences": 5
    },
    {
      "id": 6,
      "content": "etect multiple items and object\nwhereas in industrialized countries, about 40% of food losses recognition was done by template matching which causes the\ntakes place in retail and consumer levels [2]. The introduction\nimage processing application to crash. of intelligent way of retail food management is necessary to\nmitigate the problem of food waste. Meanwhile, [5] used a sensor network system that can\nmonitor the stocks inside the refrigerator wirelessly. All data\nIn a recent survey conducted in Italy [3] that puts light to food\nand images will be processed to provide the user an Internet of\nwaste unveiled that 48.2% of food waste past due the\nThings (IoT) [6]-[10] application through the cloud-based\nexpiration date, whereas 36.7% and 11.5% had been left\nwebsite Temboo. Temboo will have access to send data to the\nforgotten in the fridge or pantry for too long. A possible\nDropbox.",
      "size": 893,
      "sentences": 7
    },
    {
      "id": 7,
      "content": "the cloud-based\nexpiration date, whereas 36.7% and 11.5% had been left\nwebsite Temboo. Temboo will have access to send data to the\nforgotten in the fridge or pantry for too long. A possible\nDropbox. The user can monitor the stocks of the fridge\nsolution has come up from the same survey to mitigate food\nwirelessly using Android Application. waste. It showed 46.5% said that intelligent refrigerators\nwould be helpful in planning a shopping list, automatically\nThe HighChest [11] is an innovative smart freezer designed to\npromote energy efficient behavior and the responsible storage\n393\n[표 데이터 감지됨]\n\n=== 페이지 2 ===\nJanus Jade A. Basa et al., International Journal of Emerging Trends in Engineering Research, 7(9), September 2019, 393 - 397\nof food. It features smart services such as weight sensing, freezer, four micro loadcells with a maximum load capacity of\ntemperature sensing, barcode reading matched with manual 200kg, 2 HX711 load cell amplifier breakout board.",
      "size": 970,
      "sentences": 7
    },
    {
      "id": 8,
      "content": "vices such as weight sensing, freezer, four micro loadcells with a maximum load capacity of\ntemperature sensing, barcode reading matched with manual 200kg, 2 HX711 load cell amplifier breakout board. The\nrecording of expiration dates of its contents all accessible platform of the loadcell is made of acrylic glass. through a tablet attached externally to the chest freezer. 3.3 Circuit Diagram\n3. METHODOLOGY\nFigure 3 below is the actual wiring of four micro load cell\nThe core of the study is sensor networks which are used to connected as a Wheatstone bridge to load cell amplifier board\ndetect the amount of the contents and the internal temperature to an Arduino with a maximum capacity of 200kg. The\nof the chest freezer. It uses cellular technology by GSM platform is made of acrylic glass or plexiglass. module connected to an Arduino to access required inventory\ninformation by the user.",
      "size": 896,
      "sentences": 8
    },
    {
      "id": 9,
      "content": "0kg. The\nof the chest freezer. It uses cellular technology by GSM platform is made of acrylic glass or plexiglass. module connected to an Arduino to access required inventory\ninformation by the user. 3.1 Experimental Setup\nFigure 1: Process Flow of the System Figure 3: Actual Wiring for Load Cell 200 kg\nThe block diagram above (figure 3) shows how the system Figure 4 below is the actual wiring of straight bar load cell\nworks. The food stock as the input to the system as weight. connected to a load cell amplifier board to an Arduino with a\nThe weight of the food stock is measured using loadcell and maximum capacity of 20kg. The platform is made of acrylic\nthe temperature is determined by using a DS18B20 digital glass or plexiglass. temperature sensor.",
      "size": 760,
      "sentences": 9
    },
    {
      "id": 10,
      "content": "e food stock is measured using loadcell and maximum capacity of 20kg. The platform is made of acrylic\nthe temperature is determined by using a DS18B20 digital glass or plexiglass. temperature sensor. The sensor network continuously reads\ndetect the weight and temperature, upon request by the user\nthrough a phone call the GSM module transmits the real-time\nraw data from the sensor network to smartphone of the user by\nSMS, the android application then converts the raw data into\nan information comprehensible to the user – the number of\nfood stock inside the chest freezer. 3.2 Hardware Design\nFigure 4: Actual Wiring for Load Cell 20 kg\nFigure 2: Overview of the Hardware Setup\nThe figure 2 above shows the setup of the chest freezer and\nsensor network inside. The system is composed of Arduino\nmicrocontroller attached to it is a GSM module, digital\n(a) (b)\ntemperature sensor DS18B20, a straight bar load cell with\nFigure 5: (a) Actual Wiring of DS18B20 Digital Temperature.",
      "size": 979,
      "sentences": 6
    },
    {
      "id": 11,
      "content": "mposed of Arduino\nmicrocontroller attached to it is a GSM module, digital\n(a) (b)\ntemperature sensor DS18B20, a straight bar load cell with\nFigure 5: (a) Actual Wiring of DS18B20 Digital Temperature. (b)\nmaximum capacity of 20Kg for the elevated part of the chest GSM Shield SIM800L\n394\n=== 페이지 3 ===\nJanus Jade A. Basa et al., International Journal of Emerging Trends in Engineering Research, 7(9), September 2019, 393 - 397\nThe DS18B20 connected to the Arduino this produces, this SIM800L is the communication link between the sensor\ntemperature sensor produces digital signal and a pull-up network and the Android application. resistor is not required to be connected to data pin, the\nArduino is already configured mimic a pull-up resistor\nconnected from VCC pin to Data pin.",
      "size": 778,
      "sentences": 3
    },
    {
      "id": 12,
      "content": "and a pull-up network and the Android application. resistor is not required to be connected to data pin, the\nArduino is already configured mimic a pull-up resistor\nconnected from VCC pin to Data pin. The GSM Shield\n3.4 Flow Chart\nFigure 6: Flow Chart of Wireless Sensor Network to Android Application\n395\n=== 페이지 4 ===\nJanus Jade A. Basa et al., International Journal of Emerging Trends in Engineering Research, 7(9), September 2019, 393 - 397\nFigure 7: Flow Chart of Wireless Sensor Network to Android Application, continued. which the success rate in measuring the exact weight is\nFigures 6 and 7 shows the flow chart of the wireless sensor approximately 99.5%. network to the Android application. The SIM800L GSM\nTable 1: Percentage errors accounted for 5 samples for load cell\nshield module will act as the communication link between the (200 kg)\nfreezer and the Android app.",
      "size": 879,
      "sentences": 6
    },
    {
      "id": 13,
      "content": "ndroid application. The SIM800L GSM\nTable 1: Percentage errors accounted for 5 samples for load cell\nshield module will act as the communication link between the (200 kg)\nfreezer and the Android app. As an authorized user clicks the Actual Weight Measured Weight Percent\n“Check” button, it will give a call to the SIM800L GSM Error\nShield module which will prompt a process that will get the 1 kg 1 kg 0\nquantity of the stocks inside the freezer as well as the\n10 kg 9.94 kg 0.602\ntemperature. The Arduino will timely monitor the weight of\n20 kg 19.91 kg 0.451\nthe products to check whether it exceeded the limits which are\n30 kg 30 kg 0\n20kg for the elevated platform and 80kg for the other\n40 kg 40.02 kg 0.05\nplatform. Once either the two (2) exceeded the limit, a text\nmessage (SMS) coming from the GSM module will be sent\nThe second load cell (20kg) was calibrated with a calibration\nnotifying the owner that they had exceeded the limit.",
      "size": 942,
      "sentences": 5
    },
    {
      "id": 14,
      "content": "2) exceeded the limit, a text\nmessage (SMS) coming from the GSM module will be sent\nThe second load cell (20kg) was calibrated with a calibration\nnotifying the owner that they had exceeded the limit. factor of 40100 and an offset scale of 190468 using a sample\nweight of 1 kg, 5 kg, 10k g, 15 kg and 20 kg. In table 2, it\n4. RESULTS AND DISCUSSIONS shows that the percentage error is 1.98019802, 1.816347124,\n.0, 0.066644452 and .02002002 for weights 1 kg, 5 kg, 10 kg,\nThe Smart Inventory Management System was tested to 15 kg, and 20 kg respectively in which the success rate in\nassess the accuracy of the temperature and weight sensors and measuring the exact weight is approximately 99.2%. the responsiveness of the GSM shield SIM800L.",
      "size": 739,
      "sentences": 5
    },
    {
      "id": 15,
      "content": "espectively in which the success rate in\nassess the accuracy of the temperature and weight sensors and measuring the exact weight is approximately 99.2%. the responsiveness of the GSM shield SIM800L. The sensors`\naccuracies greatly affect the performance of the system since Table 2: Percentage errors accounted for 5 samples for load cell (20\nkg)\nthe weight should be check occasionally for the freezer has a\nActual Weight Measured Weight Percent Error\nweight capacity of 100Kg as well as the maintaining\n1 kg 1.02 kg 1.98\ntemperature of the stored food thus temperature is significant. 5 kg 4.91 kg 1.816\n10 kg 10 kg 0\nThe first load cell (100kg) was calibrated with a calibration\n15 kg 15.01 kg 0.067\nfactor of -9475 and an offset scale of -922696 using a sample\n20 kg 19.96 kg 0.2\nweight of 1kg, 10kg, 20kg, 30kg and 40kg.",
      "size": 826,
      "sentences": 4
    },
    {
      "id": 16,
      "content": "rst load cell (100kg) was calibrated with a calibration\n15 kg 15.01 kg 0.067\nfactor of -9475 and an offset scale of -922696 using a sample\n20 kg 19.96 kg 0.2\nweight of 1kg, 10kg, 20kg, 30kg and 40kg. In Table 1, it\nshows that the percentage error is 0, .601, .451, 0 and .049 for\nweights 1kg, 10kg, 20kg, 30kg, and 40kg respectively in\n396\n[표 데이터 감지됨]\n\n=== 페이지 5 ===\nJanus Jade A. Basa et al., International Journal of Emerging Trends in Engineering Research, 7(9), September 2019, 393 - 397\nThe temperature sensor was calibrated in five different 2. FAO. Global Food Losses and Food Waste—Extent,\ntemperatures of 36 (cid:0), 20 (cid:0), 10 (cid:0), 0 (cid:0), and -10 (cid:0). In table 3, Causes and Prevention. FAO; Rome, Italy: 2011\nit shows that the percentage error is 0, 5.128, 11.321, 0, and 3.",
      "size": 801,
      "sentences": 6
    },
    {
      "id": 17,
      "content": "eratures of 36 (cid:0), 20 (cid:0), 10 (cid:0), 0 (cid:0), and -10 (cid:0). In table 3, Causes and Prevention. FAO; Rome, Italy: 2011\nit shows that the percentage error is 0, 5.128, 11.321, 0, and 3. S. Gaiani, Lo spreco alimentare domestico in Italia:\n10.526 for 36 (cid:0), 20 (cid:0), 10 (cid:0), 0 (cid:0), and -10 (cid:0) respectively in stime, cause ed impatti, PhD diss., alma, 2013.\nwhich the success of rate in measuring the exact temperature 4. J. K. P. Aranilla, T. A. C. Dela Fuente, T. Y. Quintos, E.\nis approximately 95%. O. Samonte, J. P. Ilao, and F. P. Lai. Liveitup! 2 Smart\nRefrigerator: Improving Inventory Identification and\nTable 3: Percentage errors accounted for 5 samples for DS18B20 Recognition, in Research Congress 2013 De La Salle\nActual Measured Percent Error University Manila, pp. 1-9, 2013. Temperature Temperature 5. J. Velasco, L. Alberto, H. D. Ambatali, M. Canilang, V.\n36 ℃ 36 ℃ 0 Daria, J.",
      "size": 928,
      "sentences": 11
    },
    {
      "id": 18,
      "content": "arch Congress 2013 De La Salle\nActual Measured Percent Error University Manila, pp. 1-9, 2013. Temperature Temperature 5. J. Velasco, L. Alberto, H. D. Ambatali, M. Canilang, V.\n36 ℃ 36 ℃ 0 Daria, J. B. Liwanag, G. A. Madrigal, E. Galido, and L.\n20 ℃ 18.974 ℃ 5.128 K. Tolentino. Internet of Things-based (IoT)\n10 ℃ 8.868 ℃ 11.321 Inventory Monitoring Refrigerator using Arduino\n0 ℃ 0 ℃ 0 Sensor Network, Indonesian Journal of Electrical\n-10 ℃ -8.947 ℃ 10.526 Engineering and Computer Science, In press. 6. B. N. Fortaleza, R. O. Serfa Juan, and L. K. S. Tolentino. 5. CONCLUSION IoT-based Pico-Hydro Power Generation System\nUsing Pelton Turbine, Journal of Telecommunication,\nElectronic and Computer Engineering (JTEC), vol. 10,\nWith the increase of adoption of solar-powered freezer into\nno. 1-4, pp. 189-192, 2018.\nthe home environment especially on remote areas, the\n7. R. T. M. Cruz, L. K. S. Tolentino, R. O. Serfa Juan, and\npresence of solution for food and beverages management is\nH. S. Kim.",
      "size": 999,
      "sentences": 14
    },
    {
      "id": 19,
      "content": "p. 189-192, 2018.\nthe home environment especially on remote areas, the\n7. R. T. M. Cruz, L. K. S. Tolentino, R. O. Serfa Juan, and\npresence of solution for food and beverages management is\nH. S. Kim. IoT-based monitoring model for\nessential for inventory and monitoring goods inside the\npre-cognitive impairment using pH level as analyte,\nfreezer, even more so than in refrigerators. In this paper, the\nInternational Journal of Engineering Research and\nSmart Inventory Management System for\nTechnology, vol. 12, no. 5, pp. 711-718, 2019. Photovoltaic-Powered Freezer Using Wireless Sensor\n8. L. K. Tolentino, et al. AQUADROID: AN APP FOR\nNetwork is presented with the purpose of monitoring the\nAQUAPONICS CONTROL AND MONITORING,\ntemperature and quantity of the goods inside the freezer. in 6th International Conference on Civil Engineering\n(6th ICCE 2017), pp. 1-8, 2017. The system is very efficient since it is dependent on several\n9. A D. M. Africa, G. Ching, K. Go, R. Evidente, and J. Uy.",
      "size": 993,
      "sentences": 14
    },
    {
      "id": 20,
      "content": "International Conference on Civil Engineering\n(6th ICCE 2017), pp. 1-8, 2017. The system is very efficient since it is dependent on several\n9. A D. M. Africa, G. Ching, K. Go, R. Evidente, and J. Uy. factors which are the accuracy of the sensors and the\nA Comprehensive Study on Application Development\nresponsiveness of the GSM shield SIM800L. For the accuracy\nSoftware Systems, International Journal of Emerging\nof the sensors, the temperature and weight sensors are\nTrends in Engineering Research, vol. 7, no. 8, pp. calibrated on certified temperature and weights and showed a\n99-103, 2019.\nnegligible percentage error. In addition, the responsiveness of\nhttps://doi.org/10.30534/ijeter/2019/03782019\nGSM shield SIM800L is based on how strong the\n10. E. R. Magsino. Energy Monitoring System\ntransmission and reception of text messages and calls are in\nIncorporating Energy Profiling and Predictive\nyour area.",
      "size": 912,
      "sentences": 12
    },
    {
      "id": 21,
      "content": "ld SIM800L is based on how strong the\n10. E. R. Magsino. Energy Monitoring System\ntransmission and reception of text messages and calls are in\nIncorporating Energy Profiling and Predictive\nyour area. Household Movement for Energy Anomaly Detection,\nInternational Journal of Emerging Trends in\nAn image processing software for inventory and item Engineering Research, vol. 7, no. 8, pp. 151-156, 2019.\nrecognition could be designed as a future activity to enhance https://doi.org/10.30534/ijeter/2019/08782019\nthe capability of the system to handle several types of items. 11. M. Bonaccorsi, S. Betti, G. Rateni, D. Esposito, A. Likewise, other methods for the communication link between Brischetto, M. Marseglia, P. Dario, and F. Cavallo. the sensor network and Android application could be ‘HighChest’: An Augmented Freezer Designed for\nimplemented for faster acquisition of data.",
      "size": 881,
      "sentences": 11
    },
    {
      "id": 22,
      "content": "ween Brischetto, M. Marseglia, P. Dario, and F. Cavallo. the sensor network and Android application could be ‘HighChest’: An Augmented Freezer Designed for\nimplemented for faster acquisition of data. The wireless Smart Food Management and Promotion of\nsensor network for Smart Inventory Management system Eco-Efficient Behaviour, Sensors, vol. 17, no. 6, pp. could contribute for easier handling and obtaining precise 1-21, 2017.\nquantity of the stored item. https://doi.org/10.3390/s17061357\nREFERENCES\n1. S. Caronna. Report on How to Avoid Food Wastage:\nStrategies for Improving the Efficiency of the Food\nChain in the EU. Committee on Agriculture and Rural\nDevelopment, European Parliament; Brussels, Belgium. 2011\n397\n[표 데이터 감지됨]",
      "size": 733,
      "sentences": 11
    }
  ]
}