{
  "source": "ArXiv",
  "filename": "014_A_Survey_of_5G-Based_Positioning_for_Industry_4.0_.pdf",
  "total_chars": 35586,
  "total_chunks": 50,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nA Survey of 5G-Based Positioning for Industry 4.0:\nState of the Art and Enhanced Techniques\nKarthik Muthineni∗†, Alexander Artemenko∗, Josep Vidal†, Montse Njar†\n∗ Corporate Sector Research and Advance Engineering, Robert Bosch GmbH, Renningen, Germany\n† Department of Signal Theory and Communications, Universitat Politcnica de Catalunya (UPC), Barcelona, Spain\nEmail: ∗{karthik.muthineni, alexander.artemenko}@de.bosch.com, †{josep.vidal, montse.najar}@upc.edu\nAbstract—The fifth generation (5G) mobile communication points are motivating the industries to deploy AGVs in their\ntechnology integrates communication, positioning, and mapping facilities to improve the daily operations like transportation\nfunctionalities as an in-built feature. This has drawn significant\nof goods in manufacturing units and sorting/picking of items\nattention from industries owing to the capability of replacing\nfrom warehouses.",
      "size": 926,
      "sentences": 2
    },
    {
      "id": 2,
      "content": "alities as an in-built feature. This has drawn significant\nof goods in manufacturing units and sorting/picking of items\nattention from industries owing to the capability of replacing\nfrom warehouses. For instance, an autonomous transport sys-\nthe traditional wireless technologies used in industries with\n5G infrastructure that can be used for both connectivity and tem called ActiveShuttle is implemented to transport goods in\npositioning. To this end, we identify the Automated Guided industrial sites, replacing traditional conveyor belts [3]. Vehicle (AGV) as a primary use case to benefit from the 5G The deployment of a large number of AGVs in industries\nfunctionalities.Giventhattherehavebeenvariousworksfocusing can be seen as a big step in modernizing the industrial trans-\non 5G positioning, it is necessary to analyze the existing works\nportation systems that pave the way for building future I4.0.",
      "size": 909,
      "sentences": 5
    },
    {
      "id": 3,
      "content": "sfocusing can be seen as a big step in modernizing the industrial trans-\non 5G positioning, it is necessary to analyze the existing works\nportation systems that pave the way for building future I4.0. about their applicability with AGVs in industrial environments\nHowever, there are certain problems associated with the de-\nand provide insights to future research. In this paper, we\npresent state of the art in 5G-based positioning, with a focus ploymentofAGVs,thatdonotallowtousethemeverywhere. on key features, such as Millimeter Wave (mmWave) system, The first problem that AGVs need to overcome is positioning. Massive Multiple Input Multiple Output (MIMO), Ultra-Dense They need a precise positioning system to help them navigate\nNetwork (UDN), Device-to-Device (D2D) communication, and\nto the right pickup station to load the goods and also make\nReconfigurable Intelligent Surface (RIS).",
      "size": 892,
      "sentences": 5
    },
    {
      "id": 4,
      "content": "positioning system to help them navigate\nNetwork (UDN), Device-to-Device (D2D) communication, and\nto the right pickup station to load the goods and also make\nReconfigurable Intelligent Surface (RIS). Moreover, we present\nuse of the same positioning system to navigate to the docking\ntheshortcomingsinthecurrentstateoftheart.Additionally,we\npropose enhanced techniques that can complement the accuracy station to undock the goods. Table I shows the requirements\nof 5G-based positioning in controlled industrial environments. of AGV in the industrial environment. The second problem\nIndex Terms—5G, AGV, mmWave, MIMO, UDN, D2D, RIS is related to the robustness of wireless communication. AGV\ncommunicate with other AGVs and localization servers using\nI. INTRODUCTION\nwireless communication.",
      "size": 788,
      "sentences": 7
    },
    {
      "id": 5,
      "content": "rms—5G, AGV, mmWave, MIMO, UDN, D2D, RIS is related to the robustness of wireless communication. AGV\ncommunicate with other AGVs and localization servers using\nI. INTRODUCTION\nwireless communication. Today, most AGVs use WiFi as a\nThe fifth generation (5G) mobile communication systems communication channel and if the industry has poor wireless\nhave the potential to estimate the positions, orientations, and connectivity, it affects the entire fleet of AGVs. The third\nclock bias of the User Equipment (UE) and map the propaga- problem is associated with the mapping of plant information. tion environment around UE without any additional hardware It is necessary to create the map, identifying the positions of\n[1]. This is made possible by taking the advantage of 5G pickup/dropstations,chargingdocks,andparkingslots,which\npositioning capabilities: high frequencies, large bandwidths, AGVs will use during positioning.",
      "size": 922,
      "sentences": 7
    },
    {
      "id": 6,
      "content": "is made possible by taking the advantage of 5G pickup/dropstations,chargingdocks,andparkingslots,which\npositioning capabilities: high frequencies, large bandwidths, AGVs will use during positioning. The process of creating\nmultiple antennas, Ultra-Dense Network (UDN), and Device- maps itself is a tedious job and it requires experts in the field\nto-Device(D2D)communication.Ofmanyapplicationscenar- to conduct several on-site procedures, which might be time-\nios, where 5G is considered beneficial, industrial automation consuming. benefits highly from the 5G positioning capabilities because To achieve maximum efficiency from AGV, authors believe\npositioning information can help track the process flow and that industries need strong advances in two technological\nautomate manual tasks. fields: 1) wireless communication and 2) indoor positioning.",
      "size": 851,
      "sentences": 4
    },
    {
      "id": 7,
      "content": "sitioning information can help track the process flow and that industries need strong advances in two technological\nautomate manual tasks. fields: 1) wireless communication and 2) indoor positioning. The transport vehicles in industries are used to assist the To this end, 5G is considered a key enabler for I4.0 due to its\nworkersinloading/unloadingthegoodsandtransportingthem capabilitiesthatextendbeyondsmartdevices.Intheliterature,\nto the desired destination within the industry. However, these there are various research works that focus on achieving pre-\nvehicles are either manually operated or are pre-programmed cisepositioningwith5Gusingdifferentapproaches.However,\nto move along a specified path, by following the magnetic there is a lack in the analysis of their applicability to AGV in\ntape installed on the floor. The vision of Industry 4.0 (I4.0) the industrial environment.",
      "size": 889,
      "sentences": 5
    },
    {
      "id": 8,
      "content": "a specified path, by following the magnetic there is a lack in the analysis of their applicability to AGV in\ntape installed on the floor. The vision of Industry 4.0 (I4.0) the industrial environment. is to introduce the autonomous feature in transport vehicles, The main contributions of this paper are as follows:\nto navigate in manufacturing units and warehouses without 1) A comprehensive review of recent developments in 5G-\nmanual intervention [2]. Such a transport vehicle is called based positioning and presents their shortcomings. an Automated Guided Vehicle (AGV), which offers several 2) Enhanced techniques that have the potential to improve\nbenefitsforindustriessuchasdecreasedlaborcosts,improved the accuracy of 5G-based positioning for the use case\nproduct safety, and improved work efficiency. These strong of AGV in a controlled industrial environment. 4202\npeS\n02\n]PS.ssee[\n1v80331.9042:viXra\n=== 페이지 2 ===\nTABLEI (RTT).",
      "size": 938,
      "sentences": 7
    },
    {
      "id": 9,
      "content": "tioning for the use case\nproduct safety, and improved work efficiency. These strong of AGV in a controlled industrial environment. 4202\npeS\n02\n]PS.ssee[\n1v80331.9042:viXra\n=== 페이지 2 ===\nTABLEI (RTT). Continuing the target of achieving precise positioning\nAUTOMATEDGUIDEDVEHICLE(AGV)REQUIREMENTS. in indoors, Release 17 has introduced methods to enhance\nthe accuracy of measurements and mitigate the timing delays\nPositioning Orientation Latency Obstacle Reference\ndetection betweenthebasestationandUE[6].Inthissection,wepresent\n<1cm 1◦ <10ms Yes [3] the recent developments in 5G-based positioning. Table II\nsummarizes the recent developments. The works presented in\nthe literature are mainly based on simulation results, not all\nII. CRAMERRAOLOWERBOUNDASPOSITIONING\nassumptionsarerealistic,anddonotconsiderheavymultipath\nPERFORMANCEINDICATOR\nconditions in an industrial environment. Indoor positioning can be considered as an estimation\nA.",
      "size": 940,
      "sentences": 9
    },
    {
      "id": 10,
      "content": "AOLOWERBOUNDASPOSITIONING\nassumptionsarerealistic,anddonotconsiderheavymultipath\nPERFORMANCEINDICATOR\nconditions in an industrial environment. Indoor positioning can be considered as an estimation\nA. 5G Millimeter Wave System\nproblem,wheretheAGVestimatesitspositionintheindustry\nbased on the signals received from multiple base stations. As per the 3GPP, frequencies in the Frequency Range (FR)\nHowever,thepresenceofheavymetallicobjectsintheindustry 2,startingfrom30GHzarecalledMillimeterWave(mmWave)\ncan cause signal reflections and diffractions. Therefore, the frequencies [6]. At these frequencies, the large available\nestimator function should be capable of estimating the AGV bandwidth provides high time resolution in delay estimate,\nposition from noisy observations. The two main criteria for becauseofwhichaccurateTimeofArrival(ToA)measurement\nan efficient estimator are: the estimates should be unbiased for MultiPath Component (MPC) can be achieved.",
      "size": 959,
      "sentences": 7
    },
    {
      "id": 11,
      "content": "observations. The two main criteria for becauseofwhichaccurateTimeofArrival(ToA)measurement\nan efficient estimator are: the estimates should be unbiased for MultiPath Component (MPC) can be achieved. However,\nand should have low variance (from the true value of the higherpropagationlossesatmmWavefrequenciesareamajor\nparameter). The estimator is said to be unbiased if the mean challenge. Therefore, it is important to understand the limits\nof its estimates equals the true value of the parameter, which of these frequencies for positioning. In [7], authors derived\ncanbeverifiedmathematically.But,verifyingtheestimatorfor the CRLB for position and orientation errors.",
      "size": 669,
      "sentences": 6
    },
    {
      "id": 12,
      "content": "true value of the parameter, which of these frequencies for positioning. In [7], authors derived\ncanbeverifiedmathematically.But,verifyingtheestimatorfor the CRLB for position and orientation errors. Moreover, au-\nthelowvariancecriteriaisdifficult.CramerRaoLowerBound thors investigated how the low-scattering nature of mmWave\n(CRLB) provides the lowest bound or the minimum variance frequencies can deduce the problem of multipath estimation\nthat can be achieved by any unbiased estimator, trying to to multiple single-path parameter estimation. In their model,\nestimate a particular parameter [4]. The Position Error Bound authors considered a single base station with multiple anten-\n(PEB)andOrientationErrorBound(OEB)arethetwoknown nas and a UE operating at a carrier frequency of 38 GHz,\nperformance indicators for positioning technology which can orientated by an angle of 10◦.",
      "size": 883,
      "sentences": 5
    },
    {
      "id": 13,
      "content": "n-\n(PEB)andOrientationErrorBound(OEB)arethetwoknown nas and a UE operating at a carrier frequency of 38 GHz,\nperformance indicators for positioning technology which can orientated by an angle of 10◦. The Fisher Information Matrix\nbederivedbyperformingthesquarerootofCRLBofposition (FIM) is computed for the Angle of Arrival (AoA), Angle of\nand orientation. Departure (AoD), and ToA of multipath signals. From FIM,\nthe error bounds for position and orientation were calculated. III. STATEOFTHEART Their results show that the state of UE can be estimated with\nThe requirement laid to network operators by United a sub-meter position error and a one-degree orientation error. States Federal Communications Commission (FCC) to pro- Ingeneral,thepositionofUEisestimatedbyassumingthat\nvide emergency positioning (E-911) in the mid-1990s and both UE and the base station are time synchronized.",
      "size": 886,
      "sentences": 7
    },
    {
      "id": 14,
      "content": "Communications Commission (FCC) to pro- Ingeneral,thepositionofUEisestimatedbyassumingthat\nvide emergency positioning (E-911) in the mid-1990s and both UE and the base station are time synchronized. But, this\nby European Union (EU) Coordination Group on Access to isnottrueallthetime.In[8],authorsremovedthisassumption\nLocation Information for Emergency Services (CGALIES) andestimatedthepositionofUEusingTwo-WayLocalization\nto provide location information (E-112) in 2000 had begun (TWL) model. Their model is based on two protocols: 1)\nthe demand for Location-Based Services (LBS) in cellular Round Trip Localization Protocol (RLP), where the base\nnetworks [5]. Subsequently, the Third Generation Partnership stationsendsasignaltotheUE,which,inturn,respondsback\nProject (3GPP) has introduced specifications for positioning to the base station with another signal after a pre-agreed time\nmethods in cellular networks (2G, 3G, 4G) by designing new interval.",
      "size": 957,
      "sentences": 4
    },
    {
      "id": 15,
      "content": "sback\nProject (3GPP) has introduced specifications for positioning to the base station with another signal after a pre-agreed time\nmethods in cellular networks (2G, 3G, 4G) by designing new interval. Thereafter, the position and orientation of UE can\napproaches to provide position estimates with existing signal be estimated. 2) Collaborative Localization Protocol (CLP),\nstructures. However, until now, the cellular networks (2G, wherethebasestationinadditiontotheresponsefromtheUE\n3G, and 4G) fell short in providing the positioning accuracy also receives another response through an error-free feedback\nneededbyAGVfornavigatingautonomouslyinindustries,due channel. Based on the two received signals the localization\nto noisy observations resulting from multipath fading, Non- is performed. The PEB and OEB for both protocols are\nLine-of-Sight (NLoS) situations, and due to synchronization calculated. error among base stations [5]. On the other hand, the 3GPP\nB.",
      "size": 966,
      "sentences": 8
    },
    {
      "id": 16,
      "content": "fading, Non- is performed. The PEB and OEB for both protocols are\nLine-of-Sight (NLoS) situations, and due to synchronization calculated. error among base stations [5]. On the other hand, the 3GPP\nB. 5G Massive Multiple Input Multiple Output System\nService and System Aspects (SA) group study on the 5G\npositioning for indoor environments has targeted the accuracy The massive Multiple Input Multiple Output (MIMO) con-\nofdecimeters.Tothisend,in3GPPRelease16,theRadioAc- cept uses multiple antennas equipped on both transmitter and\ncess Network (RAN) group introduced new measurements for receiver to detect and estimate the AoA of received signals\npositioning, which include the DownLink Time Difference of accurately. The availability of temporal and spatial resolution\nArrival (DL-TDoA), UpLink Time Difference of Arrival (UL- in MIMO systems can be used to harness the position and\nTDoA), DownLink Angle of Departure (DL-AoD), UpLink orientationinformationoftheUEfromtheNLoScomponents.",
      "size": 989,
      "sentences": 6
    },
    {
      "id": 17,
      "content": "UpLink Time Difference of Arrival (UL- in MIMO systems can be used to harness the position and\nTDoA), DownLink Angle of Departure (DL-AoD), UpLink orientationinformationoftheUEfromtheNLoScomponents. Angle of Arrival (UL-AoA), and Multi-Cell Round Trip Time In[9],authorsusedFIMtostudytheinfluenceofNLoSonthe\n=== 페이지 3 ===\nUEstate.TheyshowedthateachNLoScomponentcontributes transmission, where it fuses the information from all vehicles\nto the positioning accuracy of UE, thereby, reducing the PEB to create a global map of the environment. This global map is\nand OEB. The results show that even in the absence of Line- further shared with the vehicles in downlink transmission. of-Sight (LoS), UE position and orientation can be estimated\nE. Reconfigurable Intelligent Surface\nwith at least 3 NLoS components. Moreover, the beams from\nthe base station should be narrow to illuminate the obstacles At mmWave frequencies, the large available bandwidth\nthat generate MPCs.",
      "size": 969,
      "sentences": 6
    },
    {
      "id": 18,
      "content": "urface\nwith at least 3 NLoS components. Moreover, the beams from\nthe base station should be narrow to illuminate the obstacles At mmWave frequencies, the large available bandwidth\nthat generate MPCs. provides high time resolution in delay estimate, because\nAuthors in [10] proposed a new technique to estimate of which accurate ToA measurements for MPCs can be\nthe speed, direction, and position of a moving UE. Their achieved. However, if the amplitude of MPC is too small,\nmodel is based on the time reversal focusing effect, where the ToA measurement of this MPC can lead to an error, due\nthe power of the transmitted signal is focused at the intended to which the performance of multipath-assisted localization\nlocation. Based on this focusing beam received by the UE, degrades. To address this issue, Reconfigurable Intelligent\ntheAutoCorrelationFunction(ACF)iscomputed.Thereafter, Surface (RIS) assisted positioning has been proposed.",
      "size": 940,
      "sentences": 7
    },
    {
      "id": 19,
      "content": "cusing beam received by the UE, degrades. To address this issue, Reconfigurable Intelligent\ntheAutoCorrelationFunction(ACF)iscomputed.Thereafter, Surface (RIS) assisted positioning has been proposed. RIS\nthe localization algorithm computes the speed, direction, and is a planar surface that consists of multiple small elements\nposition of the UE by taking the ACF of the received signal that can be programmed to control the radio waves impinging\nand the geometry position of the base stations as inputs. on it and directing them toward the UE by changing the\nphase of the reflected waves. In this way, RIS adds new\nC. 5G Ultra-Dense Network\ncontrollable paths, thereby, improving positioning accuracy. The high-density deployment of base stations in a given Authors of [13] developed the positioning model for RIS\nindustrial area allows UEs to have LoS with multiple base in near-field communications, where the large size RIS is\nstations in most cases.",
      "size": 954,
      "sentences": 6
    },
    {
      "id": 20,
      "content": "ven Authors of [13] developed the positioning model for RIS\nindustrial area allows UEs to have LoS with multiple base in near-field communications, where the large size RIS is\nstations in most cases. Authors in [11], proposed a UDN decomposed into L small segments with a size smaller than\narchitecture-based edge cloud 5G system to estimate the UE signal propagation distance. Therefore, the channels from the\npositions. Their model uses AoA of LoS components to l-th segment of RIS to the base station and the UE are in far-\nestimatetheUEpositionthroughatwo-stageapproach.Inthe field communications. A new positioning framework called\nfirststage,ExtendedKalmanFilter(EKF)ateachbasestation the coarse-to-fine algorithm was introduced, where the initial\nestimates the AoA of the incoming signal from UE. In the positionestimateofUEisgivenbymeasuringtheAoAofthe\nsecond stage, EKF running in the edge cloud fuses the AoA incoming signal from the RIS segment.",
      "size": 956,
      "sentences": 6
    },
    {
      "id": 21,
      "content": "imates the AoA of the incoming signal from UE. In the positionestimateofUEisgivenbymeasuringtheAoAofthe\nsecond stage, EKF running in the edge cloud fuses the AoA incoming signal from the RIS segment. Followed by defining\nestimates of all the base stations to estimate the UE position. a rectangular area based on the coarse estimate and refining\nThe uplink signals sent from the UE to the base station are the positioning results through grid search. usedtoestimatetheAoA.TheMaximumLikelihoodEstimator The overview of RIS-enabled localization for different sce-\n(MLE) and EKF are used to estimate the channel parameters. narios was presented in [14]. In particular, the authors pre-\nFromtheresults,itisevidentthatEKFoutperformsMLE,and sentedtheRISoperationindownlinklocalizationwithrespect\nthe positioning accuracy of the sub-meter is achieved even at tothenumberofbasestations,wide-bandsignaling,andmulti-\nlow frequencies by using UDN architecture.",
      "size": 949,
      "sentences": 7
    },
    {
      "id": 22,
      "content": "rationindownlinklocalizationwithrespect\nthe positioning accuracy of the sub-meter is achieved even at tothenumberofbasestations,wide-bandsignaling,andmulti-\nlow frequencies by using UDN architecture. antennasystems.Moreover,thecomparisonsbetweenRISand\nbase station deployment scenarios were drawn in terms of\nD. 5G Device-to-Device Communication\ncost, accuracy, and energy usage. According to the authors,\nThe D2D communication allows each UE in the network RIS has low manufacturing costs compared to base stations\nto talk to neighboring UEs using 5G communication links. A as they can be manufactured with low-cost devices and can\nUE which is not connected to the base station can acquire the be mounted on buildings. Moreover, as RIS is envisioned as a\ninformation from the adjacent UE. This enables cooperative passivebeamformer,theenergyconsumptionislowcompared\npositioning among UEs and improves accuracy and coverage tothatofabasestation.Intermsofaccuracy,thelargenumber\narea.",
      "size": 983,
      "sentences": 6
    },
    {
      "id": 23,
      "content": "t UE. This enables cooperative passivebeamformer,theenergyconsumptionislowcompared\npositioning among UEs and improves accuracy and coverage tothatofabasestation.Intermsofaccuracy,thelargenumber\narea. In [12], authors proposed cooperative positioning and ofelementsonRISgeneratesnarrowerbeamscomparedtothe\nmapping method, where each vehicle in the environment uses basestationwithmultipleantennas.However,thedirectsignal\nSimultaneous Localization and Mapping (SLAM) to build the path from the base station to the UE has a low path loss than\njoint vehicle map density, which is further shared with the the one from a RIS. Therefore, other factors like operating\nother vehicles through the base station, to enable cooperative frequency and network geometry need to be considered to\npositioning among vehicles. According to the authors, the draw a conclusion between the base station and RIS in terms\nsource of the received signal can be a base station, reflecting of positioning accuracy.",
      "size": 985,
      "sentences": 5
    },
    {
      "id": 24,
      "content": "ning among vehicles. According to the authors, the draw a conclusion between the base station and RIS in terms\nsource of the received signal can be a base station, reflecting of positioning accuracy. surface, or a Scattering Point (SP). The authors assume that Authorsof[15]achievedsub-meterpositioningaccuracyof\nthe location of the base station is known to the vehicle. UE by deploying multiple RISs in place of base stations. In\nThe locations of the other two sources are found by locally their model, each RIS consists of m elements with a single\nrunning Probability Hypothesis Density (PHD) filter-based receiver radio frequency chain for estimating the channel. A\nSLAM on each vehicle. At every instant of time, this filter UE with a single antenna at an unknown position transmits\npredicts/updates the vehicle’s trajectory and map information the pilot sequences, which are received by each RIS. The\n(locations of reflecting surfaces and SP).",
      "size": 948,
      "sentences": 9
    },
    {
      "id": 25,
      "content": "enna at an unknown position transmits\npredicts/updates the vehicle’s trajectory and map information the pilot sequences, which are received by each RIS. The\n(locations of reflecting surfaces and SP). The information basebandmeasurementscollectedatm-thelementofeachRIS\ncollected by each vehicle is sent to the base station in uplink aresenttoacontroller,wheretheAoAofLoScomponentfrom\n=== 페이지 4 ===\nTABLEII\nRECENTWORKSON5G-BASEDPOSITIONING.",
      "size": 438,
      "sentences": 3
    },
    {
      "id": 26,
      "content": "lectedatm-thelementofeachRIS\ncollected by each vehicle is sent to the base station in uplink aresenttoacontroller,wheretheAoAofLoScomponentfrom\n=== 페이지 4 ===\nTABLEII\nRECENTWORKSON5G-BASEDPOSITIONING. Application Environment Frequency Bandwidth Method Accuracy Reference\nUEpositioning Simulation 60GHz 100MHz Coarse-to-fine Millimeter [13]\nConnectedcar Simulation 38GHz 125MHz Two-waylocalization Sub-meter [8]\nUEpositioning Indoor 60GHz Unknown Lineintersection Sub-meter [14]\nUEpositioning Simulation 28GHz Unknown Autocorrelationfunction Centimeter [10]\nConnectedcar Outdoor 3.42GHz 15.36MHz Extendedkalmanfilter Sub-meter [11]\nUEpositioning Simulation 30GHz Unknown Maximumlikelihoodestimator Sub-meter [15]\nConnectedcar Simulation mmWave Unknown PHDfilter Sub-meter [12]\nConnectedcar Simulation mmWave Unknown EK-PHDfilter Sub-meter [16]\nConnectedcar Simulation mmWave Unknown PHD-SLAM Sub-meter [17]\nUEpositioning Simulation 30GHz Unknown Carrierphasepositioning Centimeter [18]\nUEpositioning Simulation 28GHz 20MHz Geometricchannel Sub-meter [19]\nUEpositioning Indoor 220GHz Unknown SLAM Centimeter [20]\nUEpositioning Simulation mmWave Unknown Messagepassing Sub-meter [21]\neach RIS is estimated using the Orthogonal Matching Pursuit B.",
      "size": 1242,
      "sentences": 2
    },
    {
      "id": 27,
      "content": "eter [19]\nUEpositioning Indoor 220GHz Unknown SLAM Centimeter [20]\nUEpositioning Simulation mmWave Unknown Messagepassing Sub-meter [21]\neach RIS is estimated using the Orthogonal Matching Pursuit B. Simultaneous Localization and Mapping\n(OMP)algorithm.FromtheAoAestimations,theUEposition\nTheavailabilityofhighbandwidthsandlargeantennaarrays\nis extracted using MLE. in 5G allows for the resolution of the MPCs using time and\nangular domains. Furthermore, these MPCs can be mapped\nIV. SHORTCOMINGSINRECENTWORKSOF5G-BASED to the physical objects present in the environment, creating\nPOSITIONING a digital map.",
      "size": 607,
      "sentences": 5
    },
    {
      "id": 28,
      "content": "s using time and\nangular domains. Furthermore, these MPCs can be mapped\nIV. SHORTCOMINGSINRECENTWORKSOF5G-BASED to the physical objects present in the environment, creating\nPOSITIONING a digital map. Such maps can be used to localize the AGV\nthroughamethodcalledChannel-SLAM[22].However,there\nIn this section, we present the shortcomings found in the\narecertainchallengesinvolvedinusingChannel-SLAM.First,\nrecent works of 5G-based positioning and manifest the need\neach AGV has a certain Field-of-View (FoV), up to which it\nto explore future research directions for the development of\ncan detect the objects. There is a probability that even the ob-\nprecise I4.0 indoor positioning technology. Our analysis was\njectsthatareinsidetheAGVFoVcangoundetectedduetothe\nbased on the AGVs point-of-view, which are deployed in\nreceiver’simperfections.Secondly,themisdetectionofobjects\nchallenging environments like industries. due to the effect of noise on channel estimation.",
      "size": 966,
      "sentences": 7
    },
    {
      "id": 29,
      "content": "on the AGVs point-of-view, which are deployed in\nreceiver’simperfections.Secondly,themisdetectionofobjects\nchallenging environments like industries. due to the effect of noise on channel estimation. Lastly, the\ndata-association problem corresponds to identifying the origin\nA. Simulation environment of MPCs. To address these challenges of SLAM, different\nmethods like geometry-based, message passing, and Random\nThe majority of research works on 5G-based positioning\nFinite Set (RFS) have been proposed in the literature. In [20]\nassessed the performance of their methods and models in\nand [21], geometry-based and message-passing methods are\na simulated environment [16], [17]. The challenge of using\nusedfortheSLAM.However,theproblemofdataassociation\nthese simulation environments is that they cannot capture the\nisnotconsideredbytheauthorsintheseworks.In[12],authors\nreal world perfectly, leading to unrealistic conditions and the\naddressed the above challenges of SLAM using RFS theory.",
      "size": 991,
      "sentences": 6
    },
    {
      "id": 30,
      "content": "they cannot capture the\nisnotconsideredbytheauthorsintheseworks.In[12],authors\nreal world perfectly, leading to unrealistic conditions and the\naddressed the above challenges of SLAM using RFS theory. results obtained cannot covenant the same experience in the\nIn their model, authors employed the PHD filter to map the\nreal world. Some of the factors that have been ignored in\nobjects in the environment and classified them as the base\nthe previous works based on simulations are: 1) the path-loss\nstation, SP, and Virtual Anchor (VA). However, the authors\nmodeldoesnotconsidertheattenuationduetowallsandother\nevaluated their model using simulation and considered only a\nobjects in the surrounding environment, 2) the positioning\nsinglebasestation.Theefficiencyoftheirmodelinlarge-scale\nof UE was done by considering only the base stations that\nscenarios like industries was not investigated.",
      "size": 892,
      "sentences": 4
    },
    {
      "id": 31,
      "content": "ding environment, 2) the positioning\nsinglebasestation.Theefficiencyoftheirmodelinlarge-scale\nof UE was done by considering only the base stations that\nscenarios like industries was not investigated. are in LoS with the UE, 3) the number of objects (reflectors\nand scatters) considered in the environment is limited, 4) the\nC. Network infrastructure geometry\npositioning algorithm considers only the specular multipath\nwhile ignoring the Diffuse Multipath (DM), 5) the UE and The general way of estimating AGV position with radio\nbase stations are assumed to be perfectly synchronized, 6) the signals is by using range-based methods, where signals from\nnetwork deployment model for deploying the base stations the base stations located at known positions are used by the\nwas not considered [18], [19]. In contrast to the unrealistic positioning algorithm.",
      "size": 855,
      "sentences": 3
    },
    {
      "id": 32,
      "content": "work deployment model for deploying the base stations the base stations located at known positions are used by the\nwas not considered [18], [19]. In contrast to the unrealistic positioning algorithm. In previous cellular networks, where\nassumptions made in simulations, the industrial environment the distance between base stations and UE is in the order of\nconsists of multiple base stations deployed over a large area a few kilometers, the positioning accuracy used to be affected\nhavingobjectsofdifferentshapesandroughnessvalues,giving mainly by the Signal-to-Noise Ratio (SNR) of the received\nrise to specular and diffuse reflections, which reach the AGV signal at UE. On the other hand, in 5G networks with UDN,\nin more than one path. In the literature, there is a lack of it is now possible to have a much shorter distance between\ninvestigationofthe5G-basedpositioningaccuracyinindustrial the base station and UE, a higher probability of LoS, and a\nenvironments. high density of base stations.",
      "size": 999,
      "sentences": 6
    },
    {
      "id": 33,
      "content": "have a much shorter distance between\ninvestigationofthe5G-basedpositioningaccuracyinindustrial the base station and UE, a higher probability of LoS, and a\nenvironments. high density of base stations. In such a scenario, the only\n=== 페이지 5 ===\nfactor that influences the positioning accuracy will be the\nnetworkgeometry.Thesub-meterpositioningaccuracycannot\nbe achieved by using 5G UDN alone but through an effective estimation\ndeployment model of base stations, where at least three base\nstations will be involved in positioning the UE [23]. The 5G\nnetwork should be designed and deployed by keeping the\nabove points in mind. Some of the common infrastructure Sensor fusion optimization\ninformation\ndeploymentmodelsusedinliteraturearePoissonPointProcess\n(PPP) and Hard Core Point Process (HCPP). However, the\nresearch works on 5G-based positioning haven’t considered Fig.1. ProposedpositioningarchitectureforAGV. thedeploymentmodelsfortheUDN,despiteitscorrelationto\npositioning accuracy.",
      "size": 987,
      "sentences": 8
    },
    {
      "id": 34,
      "content": "(HCPP). However, the\nresearch works on 5G-based positioning haven’t considered Fig.1. ProposedpositioningarchitectureforAGV. thedeploymentmodelsfortheUDN,despiteitscorrelationto\npositioning accuracy. structures can act as prior knowledge. These locations can be\nV. ENHANCEDTECHNIQUES used as landmarks to correct the 5G positioning errors. The\nlandmarksshouldbestaticandalsobeavailableatalltimesfor\nThe 5G technology alone cannot satisfy the accuracy re-\ntheAGVwhileitismoving.But,itdoesnotneedtobeareal\nquirements of AGV in the industrial environment. Therefore,\nphysical structure. The VA, formed from the mirror image of\nit is necessary to work on new possibilities for improving\nthe real anchor can also be used as a landmark because these\npositioning accuracy by complementing the 5G technology\nVAsaretime-invariantandaresynchronizedwithrealanchors. with other technologies.",
      "size": 879,
      "sentences": 10
    },
    {
      "id": 35,
      "content": "ng\nthe real anchor can also be used as a landmark because these\npositioning accuracy by complementing the 5G technology\nVAsaretime-invariantandaresynchronizedwithrealanchors. with other technologies. In this section, we present enhanced\nEachMPCcanbeassumedtobetransmittedfromVA,inLoS\ntechniques that can enhance the 5G-based positioning accu-\nscenario.Therefore,whenAGVismovingaroundtheindustry\nracy,whileremainingincongruencewiththe5Gsystemspec-\nit can make use of VAs to improve its position prediction. ifications. Fig. 1 shows the proposed positioning architecture\nfor AGV. C. Network Optimization\nEfficient network optimization functions are necessary to\nA. Sensor Fusion\nachieve precise positioning accuracy in 5G networks. The\nThe accuracy of 5G-based positioning can be improved by radioresources(suchastransmittingpower,transmittingtime,\ncombining the measurements with the exteroceptive and pro- and signal bandwidth) allocated to base stations will have\nprioceptive sensors.",
      "size": 985,
      "sentences": 8
    },
    {
      "id": 36,
      "content": "by radioresources(suchastransmittingpower,transmittingtime,\ncombining the measurements with the exteroceptive and pro- and signal bandwidth) allocated to base stations will have\nprioceptive sensors. A proprioceptive sensor like the Inertial a great impact on positioning accuracy. For instance, two\nMeasurement Unit (IMU) is used to track the positions of AGVs exchanging ranging information with the base station\nAGV at regular intervals. On the other hand, exteroceptive simultaneously can cause packet collision. Moreover, AGV\nsensorslikeLightDetectionandRanging(LIDAR)andcamera communicating with the base station using poor link quality\nare used to sense the environment around AGV through can result in measurement errors. To address these issues,\nSLAM by creating a map of obstacle positions to avoid networkfunctionslikenodeactivation,nodeprioritization,and\ncollisions [24]. By combining multi-modal sensors data with node deployment need to be employed.",
      "size": 962,
      "sentences": 7
    },
    {
      "id": 37,
      "content": "reating a map of obstacle positions to avoid networkfunctionslikenodeactivation,nodeprioritization,and\ncollisions [24]. By combining multi-modal sensors data with node deployment need to be employed. The goal of the node\n5G measurements data the positioning error can be reduced activationfunctionistoselectacertainnumberofAGVsinthe\nbecause these sensors deployed on the AGV observe the networkthatareallowedtomakemeasurementswiththebase\nsame environment and are used to sense different parameters stations at a particular time instant in order to avoid packet\n(acceleration, angular velocity, distances). These parameters collisions and minimize the positioning error.",
      "size": 669,
      "sentences": 4
    },
    {
      "id": 38,
      "content": "sense different parameters stations at a particular time instant in order to avoid packet\n(acceleration, angular velocity, distances). These parameters collisions and minimize the positioning error. The goal of\nhold the location information and when processed correctly the node prioritization function is to ensure that each AGV\ncanbeneficiallycontributetothepositionestimation.However, in the network is provided with sufficient radio resources to\nwhen the sensor data need to be fused with the 5G measure- make measurements with the base stations as well as with the\nmentsdata,anintegrationproblemarises.Thelooselycoupled neighboringAGVs.Thegoalofthenodedeploymentfunction\nfusion results in independent measurements and provides two is to determine the positions of new base stations in the\ndifferent position estimations. To overcome this problem, networksuchthattheperformanceandpositioningaccuracyof\nefficient data fusion algorithms are needed. existing base stations can be maximized.",
      "size": 991,
      "sentences": 5
    },
    {
      "id": 39,
      "content": "e\ndifferent position estimations. To overcome this problem, networksuchthattheperformanceandpositioningaccuracyof\nefficient data fusion algorithms are needed. existing base stations can be maximized. Moreover, network\ntopology optimization by seamless activation and deactivation\nB. Context Information\nof certain base stations in a UDN can positively impact the\nThe context information available in the form of industrial accuracy of the measurement data by reducing interference\nprocessescanbeusedtoimprovethepositionpredictionofthe effects [25]. currentobserver,AGV.Thisadditionalinformationisprovided\nD. Reconfigurable Intelligent Surface Assisted Positioning\ntoAGVbeforeitbeginsitsoperationsintheformofamapand\ncanalsobeobtainedbyAGVitselfduringitsdynamicmotion.",
      "size": 766,
      "sentences": 6
    },
    {
      "id": 40,
      "content": "V.Thisadditionalinformationisprovided\nD. Reconfigurable Intelligent Surface Assisted Positioning\ntoAGVbeforeitbeginsitsoperationsintheformofamapand\ncanalsobeobtainedbyAGVitselfduringitsdynamicmotion. The NLoS condition between the transmitter and receiver\nIn the former case, the locations in the industry consisting of is a very common problem to occur in large-scale environ-\nobstacles (objects, other UEs) with distinctive features and ments like industries. Though the MPCs resulting from NLoS\nalso areas that result in the unique pattern of received signals condition can be exploited by the 5G system for positioning,\n(RSS, ToA) due to the presence of heavy metallic beam-like it all depends on the quality of MPCs. RIS has evolved\n=== 페이지 6 ===\nas a promising technology for controlling signal propagation [8] Z.Abu-Shaban,H.Wymeersch,T.Abhayapala,andG.Seco-Granados,\nand customizing the environment to 5G SLAM requirements.",
      "size": 931,
      "sentences": 4
    },
    {
      "id": 41,
      "content": "olved\n=== 페이지 6 ===\nas a promising technology for controlling signal propagation [8] Z.Abu-Shaban,H.Wymeersch,T.Abhayapala,andG.Seco-Granados,\nand customizing the environment to 5G SLAM requirements. “Single-anchortwo-waylocalizationboundsfor5GmmWavesystems,”\nIEEETransactionsonVehicularTechnology,vol.69,no.6,pp.6388–\nCompared to the traditional wireless repeaters used in cellular\n6400,2020.\nsystems, which can also control signal propagation, the RIS [9] R.Mendrzik,H.Wymeersch,G.Bauch,andZ.Abu-Shaban,“Harness-\ncomes with low hardware complexity and cost as it does ing NLOS components for position and orientation estimation in 5G\nmillimeter wave MIMO,” IEEE Transactions on Wireless Communica-\nnot require amplifiers [26]. To this end, we believe that the\ntions,vol.18,no.1,pp.93–107,2019. deployment of RIS in industries can further enhance the 5G [10] X. Zeng, F. Zhang, B. Wang, and K. J. R. Liu, “Massive MIMO for\nSLAM accuracy.",
      "size": 938,
      "sentences": 4
    },
    {
      "id": 42,
      "content": "d, we believe that the\ntions,vol.18,no.1,pp.93–107,2019. deployment of RIS in industries can further enhance the 5G [10] X. Zeng, F. Zhang, B. Wang, and K. J. R. Liu, “Massive MIMO for\nSLAM accuracy. However, certain challenges related to RIS- high-accuracytargetlocalizationandtracking,”IEEEInternetofThings\nJournal,vol.8,no.12,pp.10131–10145,2021. assisted positioning need to be addressed. First, the channel\n[11] E. Y. Menta, N. Malm, R. Jntti, K. Ruttik, M. Costa, and K. Lepp-\nmodel with multiple scatterers for the indoor environment nen, “On the performance of AoAbased localization in 5G ultradense\nneeds to be modeled. Second, to direct the reflected beam networks,”IEEEAccess,vol.7,pp.33870–33880,2019. [12] H.Kim,K.Granstrm,L.Gao,G.Battistelli,S.Kim,andH.Wymeersch,\ntoward the AGV, each element of RIS has to be configured\n“5GmmWavecooperativepositioningandmappingusingmulti-model\nwith a particular phase shift value.",
      "size": 929,
      "sentences": 7
    },
    {
      "id": 43,
      "content": "nstrm,L.Gao,G.Battistelli,S.Kim,andH.Wymeersch,\ntoward the AGV, each element of RIS has to be configured\n“5GmmWavecooperativepositioningandmappingusingmulti-model\nwith a particular phase shift value. However, identifying the PHDfilterandmapfusion,”IEEETransactionsonWirelessCommuni-\noptimal phase shift value from a large number of possible cations,vol.19,no.6,pp.3782–3795,2020. [13] B. Luo, M. Dong, H. Wu, Y. Li, L. Yang, X. Chen, and B. Bai,\nvalues (between +90°and −90°) is challenging [26]. “Reconfigurable intelligent surface assisted millimeter wave indoor\nlocalization systems,” in ICC 2022 - IEEE International Conference\nVI. CONCLUSIONANDFUTUREWORK\nonCommunications,2022,pp.4535–4540. This paper surveys the recent advances in 5G-based po- [14] K. Keykhosravi, B. Denis, G. C. Alexandropoulos, Z. S. He, A. Al-\nbanese,V.Sciancalepore,andH.Wymeersch,“LeveragingRIS-enabled\nsitioning with a particular focus on its enabling features.",
      "size": 942,
      "sentences": 6
    },
    {
      "id": 44,
      "content": "sed po- [14] K. Keykhosravi, B. Denis, G. C. Alexandropoulos, Z. S. He, A. Al-\nbanese,V.Sciancalepore,andH.Wymeersch,“LeveragingRIS-enabled\nsitioning with a particular focus on its enabling features. smart signal propagation for solving infeasible localization problems:\nFor each enabling feature, we provide a review of methods Scenarios,keyresearchdirections,andopenchallenges,”IEEEVehicular\nrecently proposed, along with their shortcomings. From our TechnologyMagazine,pp.2–10,2023. [15] G.C.Alexandropoulos,I.Vinieratou,andH.Wymeersch,“Localization\nanalysis, the current solutions lack an evaluation of their\nvia multiple reconfigurable intelligent surfaces equipped with single\nperformance level on a large-scale and in live production receive RF chains,” IEEE Wireless Communications Letters, vol. 11,\nenvironments. Finally, we propose some enhanced techniques no.5,pp.1072–1076,2022.",
      "size": 890,
      "sentences": 6
    },
    {
      "id": 45,
      "content": "nce level on a large-scale and in live production receive RF chains,” IEEE Wireless Communications Letters, vol. 11,\nenvironments. Finally, we propose some enhanced techniques no.5,pp.1072–1076,2022. [16] O. Kaltiokallio, Y. Ge, J. Talvitie, H. Wymeersch, and M. Valkama,\nthat can complement the accuracy of 5G-based positioning\n“mmWave simultaneous localization and mapping using a computa-\nfor the use case of AGV. In our future work, we will focus on tionally efficient EK-PHD filter,” in 2021 IEEE 24th International\nthesetechniquestoconceptimprovedpositioningtechnologies ConferenceonInformationFusion(FUSION),2021,pp.1–8. [17] H. Kim, J. Lee, Y. Ge, F. Jiang, S. Kim, and H. Wymeersch, “Coop-\nfor I4.0. erative mmWave PHD-SLAM with moving scatterers,” in 2022 25th\nACKNOWLEDGMENT International Conference on Information Fusion (FUSION), 2022, pp. 1–6.",
      "size": 857,
      "sentences": 8
    },
    {
      "id": 46,
      "content": "Jiang, S. Kim, and H. Wymeersch, “Coop-\nfor I4.0. erative mmWave PHD-SLAM with moving scatterers,” in 2022 25th\nACKNOWLEDGMENT International Conference on Information Fusion (FUSION), 2022, pp. 1–6. This work has received funding from the European Union’s [18] S. Fan, W. Ni, H. Tian, Z. Huang, and R. Zeng, “Carrier phase-based\nHorizon 2020 research and innovation programme under the synchronizationandhigh-accuracypositioningin5Gnewradiocellular\nnetworks,” IEEE Transactions on Communications, vol. 70, no. 1, pp. Marie Sklodowska-Curie grant agreement ID 956670. Also,\n564–577,2022. partially funded through the project ROUTE56 (funded by [19] F.WenandH.Wymeersch,“5Gsynchronization,positioning,andmap-\nthe Agencia Estatal de Investigacin, PID2019-104945GB- ping from diffuse multipath,” IEEE Wireless Communications Letters,\nvol.10,no.1,pp.43–47,2021. I00 / AEI / 10.13039/501100011033).",
      "size": 892,
      "sentences": 10
    },
    {
      "id": 47,
      "content": "oning,andmap-\nthe Agencia Estatal de Investigacin, PID2019-104945GB- ping from diffuse multipath,” IEEE Wireless Communications Letters,\nvol.10,no.1,pp.43–47,2021. I00 / AEI / 10.13039/501100011033). [20] M. Aladsani, A. Alkhateeb, and G. C. Trichopoulos, “Leveraging\nmmWave imaging and communications for simultaneous localization\nREFERENCES\nandmapping,”inICASSP2019-2019IEEEInternationalConference\n[1] C. Baquero Barneto, E. Rastorgueva-Foi, M. F. Keskin, T. Riihonen,\nonAcoustics,SpeechandSignalProcessing(ICASSP),2019,pp.4539–\nM.Turunen,J.Talvitie,H.Wymeersch,andM.Valkama,“Millimeter- 4543.\nwavemobilesensingandenvironmentmapping:Models,algorithmsand [21] R.Mendrzik,F.Meyer,G.Bauch,andM.Win,“Localization,mapping,\nvalidation,”IEEETransactionsonVehicularTechnology,vol.71,no.4, andsynchronizationin5GmillimeterwavemassiveMIMOsystems,”in\n2019IEEE20thInternationalWorkshoponSignalProcessingAdvances\npp.3900–3916,2022.",
      "size": 920,
      "sentences": 3
    },
    {
      "id": 48,
      "content": "alidation,”IEEETransactionsonVehicularTechnology,vol.71,no.4, andsynchronizationin5GmillimeterwavemassiveMIMOsystems,”in\n2019IEEE20thInternationalWorkshoponSignalProcessingAdvances\npp.3900–3916,2022. [2] M. De Ryck, M. Versteyhe, and F. Debrouwere, “Automated guided\ninWirelessCommunications(SPAWC),2019,pp.1–5. vehicle systems, state-of-the-art control algorithms and techniques,” [22] C. Gentner, T. Jost, W. Wang, S. Zhang, A. Dammann, and U.-C.\nJournalofManufacturingSystems,vol.54,pp.152–173,2020. Fiebig, “Multipath assisted positioning with simultaneous localization\n[3] Bosch Rexroth, “Energize your intralogistics with the autonomous\nandmapping,”IEEETransactionsonWirelessCommunications,vol.15,\ntransportsystemactiveshuttle,”AccessedSep.09,2022. [Online].Avail- no.9,pp.6104–6117,2016.",
      "size": 794,
      "sentences": 5
    },
    {
      "id": 49,
      "content": "nergize your intralogistics with the autonomous\nandmapping,”IEEETransactionsonWirelessCommunications,vol.15,\ntransportsystemactiveshuttle,”AccessedSep.09,2022. [Online].Avail- no.9,pp.6104–6117,2016. able: https://www.boschrexroth.com/en/xc/products/product-groups/ [23] J.D.Roth,M.Tummala,andJ.C.McEachen,“Fundamentalimplica-\nassembly-technology/topics/intralogistics/template-neuprodukt-seite-6 tions for location accuracy in ultra-dense 5G cellular networks,” IEEE\n[4] A.JagannathamandB.Rao,“Cramer-raolowerboundforconstrained Transactions on Vehicular Technology, vol. 68, no. 2, pp. 1784–1795,\ncomplexparameters,”IEEESignalProcessingLetters,vol.11,no.11, 2019.\npp.875–878,2004. [24] B.P.E.AlvaradoVasquez,R.Gonzalez,F.Matia,andP.DeLaPuente,\n[5] J. A. del Peral-Rosado, R. Raulefs, J. A. Lpez-Salcedo, and G. Seco- “Sensor fusion for tour-guide robot localization,” IEEE Access, vol. 6,\nGranados,“Surveyofcellularmobileradiolocalizationmethods:From pp.78947–78964,2018.",
      "size": 973,
      "sentences": 10
    },
    {
      "id": 50,
      "content": "R. Raulefs, J. A. Lpez-Salcedo, and G. Seco- “Sensor fusion for tour-guide robot localization,” IEEE Access, vol. 6,\nGranados,“Surveyofcellularmobileradiolocalizationmethods:From pp.78947–78964,2018. 1Gto5G,”IEEECommunicationsSurveys&Tutorials,vol.20,no.2, [25] D. J. Torrieri, “Statistical theory of passive location systems,” IEEE\npp.1124–1148,2018. TransactionsonAerospaceandElectronicSystems,vol.AES-20,no.2,\n[6] 3GPP, “Location and positioning,” Accessed Nov. 02, 2022. [Online]. pp.183–198,1984. Available:https://www.3gpp.org/technologies/location-and-positioning [26] E.Bjrnson,.zdogan,andE.G.Larsson,“Reconfigurableintelligentsur-\n[7] Z. Abu-Shaban, X. Zhou, T. Abhayapala, G. Seco-Granados, and faces: Three myths and two critical questions,” IEEE Communications\nH. Wymeersch, “Error bounds for uplink and downlink 3D localiza-\nMagazine,vol.58,no.12,pp.90–96,2020. tion in 5G millimeter wave systems,” IEEE Transactions on Wireless\nCommunications,vol.17,no.8,pp.4939–4954,2018.",
      "size": 987,
      "sentences": 9
    }
  ]
}