{
  "source": "ArXiv",
  "filename": "036_142_GHz_Multipath_Propagation_Measurements_and_Pat.pdf",
  "total_chars": 31218,
  "total_chunks": 45,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nS. Ju and T. S. Rappaport, “142 GHz Multipath Propagation Measurements and Path Loss Channel Modeling in Factory\nBuildings,” 2023 IEEE International Conference on Communications (ICC), May. 2023, pp. 1-6. 142 GHz Multipath Propagation Measurements and\nPath Loss Channel Modeling in Factory Buildings\nShihao Ju and Theodore S. Rappaport\nNYU WIRELESS, Tandon School of Engineering, New York University, Brooklyn, NY, 11201\n{shao, tsr}@nyu.edu\nAbstract—Thispaperpresentssub-Terahertz(THz)radioprop- indoorofficeandoutdoorurbanenvironmentsbetween100and\nagation measurements at 142 GHz conducted in four factories 300 GHz, which have shown that, despite the fewer observed\nwith various layouts and facilities to explore sub-THz wireless multipathcomponentsthanmmWavefrequencies,thenon-line-\nchannels for smart factories in 6G and beyond.",
      "size": 846,
      "sentences": 4
    },
    {
      "id": 2,
      "content": "n that, despite the fewer observed\nwith various layouts and facilities to explore sub-THz wireless multipathcomponentsthanmmWavefrequencies,thenon-line-\nchannels for smart factories in 6G and beyond. Here we study\nof-sight (NLOS) propagation created by specular reflection\nspatialandtemporalchannelresponsesat82transmitter-receiver\n(TX-RX)locationsacrossfourfactoriesintheNewYorkCityarea and diffuse scattering is remarkably substantial in sub-THz\nand over distances from 5 m to 85 m in both line-of-sight (LOS) wireless system design and deployment [4], [5], [8]. and non-LOS (NLOS) environments.",
      "size": 597,
      "sentences": 3
    },
    {
      "id": 3,
      "content": "e scattering is remarkably substantial in sub-THz\nand over distances from 5 m to 85 m in both line-of-sight (LOS) wireless system design and deployment [4], [5], [8]. and non-LOS (NLOS) environments. The measurements were Advanced industrial Internet of things (IIOT) with increas-\nperformedwithasliding-correlation-basedchannelsounderwith\ning automated guided vehicles (AGVs) and autonomous mo-\n1 GHz RF bandwidth with steerable directional horn antennas\nbile robots (AMRs) has rapidly transformed modern factories,\nwith 27 dBi gain and 8° half-power beamwidth at both TX and\nRX, using both vertical and horizontal antenna polarizations, creating an unprecedented demand for fast and reliable in-\nyielding over 75,000 directional power delay profiles. Channel factory communication networks and centimeter-level posi-\nmeasurements of two RX heights at 1.5 m (high) emulating tioning and sensing [9].",
      "size": 900,
      "sentences": 4
    },
    {
      "id": 4,
      "content": "lding over 75,000 directional power delay profiles. Channel factory communication networks and centimeter-level posi-\nmeasurements of two RX heights at 1.5 m (high) emulating tioning and sensing [9]. Therefore, the ultrawide transmission\nhandheld devices and at 0.5 m (low) emulating automated\nbandwidth at sub-THz frequencies, together with the steerable\nguidedvehicles(AGVs)wereconductedforautomatedindustrial\npencilbeamsgeneratedbylargeantennaarrayswithamassive\nscenarios with various clutter densities. Results yield the first\npath loss models for indoor factory (InF) environments at 142 numberofantennaelements,maysatisfythestringentrequire-\nGHz and show the low RX height experiences a mean path loss ments for communication and sensing in smart factories. increaseof10.7dBand6.0dBwhencomparedwiththehighRX\nThis work presents a recent 142 GHz radio propagation\nheight at LOS and NLOS locations, respectively.",
      "size": 915,
      "sentences": 5
    },
    {
      "id": 5,
      "content": "r communication and sensing in smart factories. increaseof10.7dBand6.0dBwhencomparedwiththehighRX\nThis work presents a recent 142 GHz radio propagation\nheight at LOS and NLOS locations, respectively. Furthermore,\nmeasurement campaign in four factory buildings in Brooklyn,\nflatandrotatablemetalplateswereleveragedaspassivereflecting\nsurfaces(PRSs)inchannelenhancementmeasurementstoexplore NY. Extensive channel measurements were conducted at 16\nthe potential power gain on sub-THz propagation channels, transmitter (TX) locations and 60 receiver (RX) locations\ndemonstrating a range from 0.5 to 22 dB improvement with a across four factories, resulting in 30 line-of-sight (LOS) lo-\nmean of 6.5 dB in omnidirectional channel gain as compared to\ncationpairs,48NLOSlocationpairs,andfouroutagelocation\nwhen no PRSs are present.",
      "size": 824,
      "sentences": 4
    },
    {
      "id": 6,
      "content": "s four factories, resulting in 30 line-of-sight (LOS) lo-\nmean of 6.5 dB in omnidirectional channel gain as compared to\ncationpairs,48NLOSlocationpairs,andfouroutagelocation\nwhen no PRSs are present. pairs over a T-R separation distance range from 5 m to 85\nIndex Terms—Channel Measurement; Channel Modeling; In-\ndoor Factory; Sub-Terahertz; 140 GHz; Reconfigurable intelli- m. The TX antenna was vertically polarized, and the RX\ngent surface (RIS); 5G; 6G antenna was systematically switched between vertical (V) and\nhorizontal(H)polarizations,providingco-andcross-polarized\nI. INTRODUCTION channel characterization. Directional and omnidirectional path\nTerahertz (THz) communications show great promise for loss models for co- and cross-polarization antenna config-\nsixth-generation (6G) wireless systems due to the vast avail- urations are derived in Section III with a statistical cross-\nablebandwidth[1],[2].FederalCommunicationsCommission polarization discrimination (XPD) characterization.",
      "size": 996,
      "sentences": 4
    },
    {
      "id": 7,
      "content": "s systems due to the vast avail- urations are derived in Section III with a statistical cross-\nablebandwidth[1],[2].FederalCommunicationsCommission polarization discrimination (XPD) characterization. (FCC) released the first report and order, ET Docket 18- Themeasurementsetupmimickedanindoordownlinktrans-\n21, in 2019 [3], which offered experimental licenses for the mission from an access point to user equipment with TXs\n95 GHz to 3 THz range and opened up 21.2 GHz of the at 2.5 m and RXs at 1.5 m heights above the floor in the\nspectrum between 116 GHz and 246 GHz for unlicensed four factories, labeled A, B, C, and D. At Factory C and\nuse.Extensivepropagationmeasurementsandaccuratechannel D, additional channel measurements were conducted with the\nmodeling are paramount to building a high-performance THz RX height of 0.5 m to investigate the channel properties of\nwireless system with communication and sensing functions.",
      "size": 931,
      "sentences": 2
    },
    {
      "id": 8,
      "content": "were conducted with the\nmodeling are paramount to building a high-performance THz RX height of 0.5 m to investigate the channel properties of\nwireless system with communication and sensing functions. near-the-groundmobilereceivers(e.g.,AGVs)commonlyused\nSignificant efforts on channel measurements and modeling in factories. The measurement results in Section IV show\nabove 100 GHz have been made over the past few years [1], that the low-height RXs experience larger path loss than the\n[4]–[6], but there is virtually no understanding of real-world high-height RXs due to increasing blockage probability and\nfactorychannels[7].Mostmeasurementcampaignsfocusedon complexscatteringenvironmentcausedbysurroundingclutter. The larger path loss at the low RX height motivates us\nThis research is supported by the NYU WIRELESS Industrial Affiliates\nto propose a channel enhancement scheme using passive\nProgram and National Science Foundation (NSF) Research Grants: 1909206\nand2037845.",
      "size": 978,
      "sentences": 4
    },
    {
      "id": 9,
      "content": "esearch is supported by the NYU WIRELESS Industrial Affiliates\nto propose a channel enhancement scheme using passive\nProgram and National Science Foundation (NSF) Research Grants: 1909206\nand2037845. reflecting surfaces (PRS). There have been some early works\n3202\nbeF\n32\n]TI.sc[\n1v24121.2032:viXra\n=== 페이지 2 ===\nemploying metal surfaces to enhance mmWave and sub-THz the entire open area in Factory A. Fig. 1 shows the 27 TX-\npropagationchannelbyfixingametalplateatthecornerofan RX location pairs consisting of 10 LOS locations, 15 NLOS\nL-shapedcorridor[10]orattachingaluminumfoiltowalls[11] locations, and two outage locations. RX12 and RX16 were in\nand pillars [12]. Section V demonstrates a new measurement outage. The TX was set to 3 m above the ground, except that\nsetup using flat metal plates to improve propagation channels. TX4 was set at 3 m high on the mezzanine floor, having a\nA 1 m x 1 m flat smooth aluminum plate was placed near height of 6.7 m above the ground.",
      "size": 979,
      "sentences": 9
    },
    {
      "id": 10,
      "content": "ng flat metal plates to improve propagation channels. TX4 was set at 3 m high on the mezzanine floor, having a\nA 1 m x 1 m flat smooth aluminum plate was placed near height of 6.7 m above the ground. The RX was set to 1.5 m\nthe walls of factories to increase the received power for a above the ground. The T-R separation distance ranged from\nspecified RX location by either boosting an existing weak 6.5 m to 86.5 m.\nmultipath component (MPC) or creating an additional MPC. ThePRSwassetnexttowallsandpillarsandmanuallyrotated\ninthehorizontalplanetothebestreflectingorientation,which\nmimicked the flexible beamforming operation of future re-\nconfigurable intelligent surfaces (RIS) at sub-THz frequencies\n[13].ThePRS-aidedchannelmeasurementswereconductedat\nall twelve locations at Factory D with both RX heights of 1.5\nm and 0.5 m for comparative analysis. II. 142GHZPROPAGATIONMEASUREMENTSINFOUR\nFig. 1: TX and RX locations in Factory A.",
      "size": 937,
      "sentences": 8
    },
    {
      "id": 11,
      "content": "tswereconductedat\nall twelve locations at Factory D with both RX heights of 1.5\nm and 0.5 m for comparative analysis. II. 142GHZPROPAGATIONMEASUREMENTSINFOUR\nFig. 1: TX and RX locations in Factory A. Six TX locations\nFACTORIES\nare denoted as stars, and 17 RX locations are denoted as\nA. Measurement Equipment circles, resulting in 27 TX-RX location pairs for channel\nmeasurements. The 142 GHz wideband channel sounder adopts a sliding-\nb) Site B: Electronics Manufacturing Facility: The\ncorrelation-based transceiver architecture [14]. A pseudoran-\nsingle-story structure covered various production phases, such\ndom noise (PN) sequence of length 2047 at 500 MHz was\nas manufacturing, testing, and assembly.",
      "size": 706,
      "sentences": 8
    },
    {
      "id": 12,
      "content": "ansceiver architecture [14]. A pseudoran-\nsingle-story structure covered various production phases, such\ndom noise (PN) sequence of length 2047 at 500 MHz was\nas manufacturing, testing, and assembly. We selected three\ngenerated at baseband, then upconverted to a center frequency\nproduction areas including automated manufacturing, testing\nof 142 GHz, and transmitted through a directional and steer-\nandassemblyforchannelmeasurements.FactoryBhadheavy\nable horn antenna with 8° half power beamwidth (HPBW)\nclutter containing massive metal objects such as robotics,\nand 27 dBi gain from the TX. The signal was captured by\npartitions, machineries, and workstations as shown in Fig. 2.\nthe RX via an identical steerable horn antenna and downcon-\nWe selected four TX locations and 20 RX locations, covering\nverted to baseband signals. The baseband signal was sliding\nthe three areas of interest.",
      "size": 891,
      "sentences": 6
    },
    {
      "id": 13,
      "content": "a an identical steerable horn antenna and downcon-\nWe selected four TX locations and 20 RX locations, covering\nverted to baseband signals. The baseband signal was sliding\nthe three areas of interest. The 20 TX-RX location pairs\ncorrelated with a local copy of the transmitted PN sequence\nconsisted of three LOS locations and 17 NLOS locations. The\nat a slower rate [15], resulting power delay profile (PDP),\nTX height was set to 2.5 m above the ground near the ceiling,\nwhich was sampled by a high-speed oscilloscope. TX and RX\nand the RX height was set to 1.5 m above the ground. The\nhorn antennas were mechanically steered by two gimbals in\nT-R separation distance ranged from 5.6 m to 31.0 m.\nthe azimuth and elevation planes. The RX horn antenna was\nswitchedbetweenverticalandhorizontalpolarizationwhilethe\nTXantennaremainedverticallypolarized.Bothco-andcross-\npolarizationmeasurementsfollowedtheidenticalmeasurement\nprocedure as described below.",
      "size": 950,
      "sentences": 7
    },
    {
      "id": 14,
      "content": "as\nswitchedbetweenverticalandhorizontalpolarizationwhilethe\nTXantennaremainedverticallypolarized.Bothco-andcross-\npolarizationmeasurementsfollowedtheidenticalmeasurement\nprocedure as described below. The 142 GHz channel sounder\nhad a null-to-null RF bandwidth of 1 GHz and can measure\nthe directional propagation path loss up to 152 dB [14]. B. Measurement Environments and Locations\nThe142GHzpropagationmeasurementswereconductedin Fig. 2: Photos taken from Factory B. The TX was set at 2.5\nfour factory buildings in Brooklyn, NY. The selected factory m, and the RX was set at 1.5 m.\nbuildings constitute a wide range of factory size, layout, and c) Site C: Warehouse Facility (∼72 m L× 30 m W ×\nmanufacturing facility. TX locations were picked to be typical 4 m H): Site C was a mid-size warehouse. As shown in\nof where WiFi access points are deployed to cover entire Fig.",
      "size": 873,
      "sentences": 9
    },
    {
      "id": 15,
      "content": "ty (∼72 m L× 30 m W ×\nmanufacturing facility. TX locations were picked to be typical 4 m H): Site C was a mid-size warehouse. As shown in\nof where WiFi access points are deployed to cover entire Fig. 3, large metal multi-layer shelves with a height of 3 m\nfactory floors, and RX locations were selected along common and a spacing distance of 1.5 m were placed at two sides\ntrajectories of human mobile workers and AGVs in factories. of the building, creating a 2 m wide walkway in the center. a) Site A: Factory Building: The building (∼104 m L× These large metal shelves were filled with cardboard boxes\n39 m W × 25 m H) was partitioned into manufacturing labs containing commodities. We selected three TX locations and\nand conference rooms covered by large glass windows with 11RXlocationsinFactoryC,coveringthestockandshipping\nmetal frames. A mezzanine floor was built above the rooms areas of the warehouse facility.",
      "size": 920,
      "sentences": 8
    },
    {
      "id": 16,
      "content": "and conference rooms covered by large glass windows with 11RXlocationsinFactoryC,coveringthestockandshipping\nmetal frames. A mezzanine floor was built above the rooms areas of the warehouse facility. The 11 TX-RX location pairs\nalongexternalfacadeswithaheightof3.7mabovetheground, consistedofthreeLOSlocations,sixNLOSlocations,andtwo\nleavinga7mwideopencorridoratthecenterofthebuilding. outage locations. RX1 and RX8 were in outage. The TX was\nSix TX locations and 17 RX locations were selected to cover 2.5 m above the ground, and the RX was 1.5 m above the\n=== 페이지 3 ===\nground. The T-R separation distance ranged from 7.7 m to C. Measurement Procedure\n37.6 m. In addition, the low RX height at 0.5 m above the\nThe TX and RX were placed at the designated locations\nground was adopted at three LOS locations to study the effect\nwith vertical-to-vertical (V-V) antenna polarization. The TX\nof antenna height and ground reflection.",
      "size": 929,
      "sentences": 8
    },
    {
      "id": 17,
      "content": "placed at the designated locations\nground was adopted at three LOS locations to study the effect\nwith vertical-to-vertical (V-V) antenna polarization. The TX\nof antenna height and ground reflection. and RX antenna pointing angles in the azimuth and elevation\nplanes receiving the strongest power (P ) were identified as\nmax\n“best”,whichwastheboresightdirectionforLOSlocationsor\nantennas pointing to a strong reflection for NLOS locations. The TX antenna was rotated from the best pointing angle in\nstepincrementsoftheantennahalfpowerbeamwidth(HPBW)\n(8°) in the azimuth plane, resulting in 45(= 360°/8°) TX\npointingangles.WiththeTXpointedattheith pointingangle,\nthe RX antenna performed a 360° continuous sweep in the\nazimuthplane,takingaboutsixseconds,andrecordedthepeak\nreceived power (Pi ). We selected the TX angles based on a\npeak\npower threshold, which was set to the smaller value between\nFig.",
      "size": 899,
      "sentences": 5
    },
    {
      "id": 18,
      "content": "ous sweep in the\nazimuthplane,takingaboutsixseconds,andrecordedthepeak\nreceived power (Pi ). We selected the TX angles based on a\npeak\npower threshold, which was set to the smaller value between\nFig. 3: Photos taken from Factory C. The TX was set at 2.5\n30 dB below the highest peak power from 45 TX angles, and\nm, and the RX was set at 1.5 m and 0.5 m.\n10dBabovetheaveragenoisefloor.ThoseTXanglesinwhich\nd) Site D: Manufacturing Space (∼35 m L× 25 m W ×\nthepeakreceivedpowerexceededthespecifiedthresholdwere\n5 m H): This space was a single large room for lightweight\nconsidered “good” angles, where detectable multipath existed. manufacturing and production, with various machineries such\nForeachofthe“good”TXpointingangles,theRXwasrotated\nas laser cutters, CNC machines, and 3D printers. Large glass\nat step increments of 8° in the complete azimuth plane. One\nwindow panels coated with metallic frames covered the exte-\ndirectional PDP was recorded at each RX pointing step.",
      "size": 976,
      "sentences": 6
    },
    {
      "id": 19,
      "content": "3D printers. Large glass\nat step increments of 8° in the complete azimuth plane. One\nwindow panels coated with metallic frames covered the exte-\ndirectional PDP was recorded at each RX pointing step. The\nrior walls on the north, south, and east of this room, whereas\nRXwasthenup-anddown-tiltedby8°,andtheexactstepped\nthickdrywallconstitutedthewallonthewest,asshowninFig. azimuthal sweep to acquire signal energy was repeated [16]. 4.Plastictablesandwoodenchairswereplacedinafewoffice\nForexample,ifaTXhasten“good”pointingangles,thereare\nregions.Black-filledcirclesinFig.4representconcretepillars\natmost10×45×3=1350possibledirectionalPDPsmeasured\nwhichcreatedstrongreflectionsduringchannelmeasurements. at this location. In practice, we measured 1000 PDPs on\naverage at each particular TX-RX location. This measurement\nprocedure is exhaustive, taking typically two hours for each\nTX-RX location, but provides complete angular statistics for\nboth angle of departure (AOD) and angle of arrival (AOA).",
      "size": 996,
      "sentences": 9
    },
    {
      "id": 20,
      "content": "n. This measurement\nprocedure is exhaustive, taking typically two hours for each\nTX-RX location, but provides complete angular statistics for\nboth angle of departure (AOD) and angle of arrival (AOA). Identical measurements were performed for both V-V and V-\nH antenna polarization configurations at each TX-RX location\npair. III. 142GHZPATHLOSSMODELSFORCO-AND\nCROSS-POLARIZATIONANTENNAS\nWe adopt the well-known close-in free space reference\ndistance (CI) path model for omnidirectional and directional\npathlossmeasurementdatabecausetheCIpathlossmodelhas\nbeen proven to be superior for modeling path loss over many\nFig. 4: TX and RX locations in Factory Site D. Three TX\nenvironments and frequencies [17].",
      "size": 704,
      "sentences": 5
    },
    {
      "id": 21,
      "content": "hlossmeasurementdatabecausetheCIpathlossmodelhas\nbeen proven to be superior for modeling path loss over many\nFig. 4: TX and RX locations in Factory Site D. Three TX\nenvironments and frequencies [17]. The CI path loss model is\nlocations are denoted as stars, and nine RX locations are\nparameterized solely by the path loss exponent (PLE) denoted\ndenoted as circles, resulting in 12 TX-RX location pairs for as n. PLCI represents the path loss in dB scale, which is a\nchannelmeasurements.Theshortblueandredbarsdenotethe\nfunction of distance and frequency [4], [5], [18]:\nPRS positions for high and low RXs, respectively. (cid:18) (cid:19)\nd\nWe selected three TX locations and nine RX locations in PL(f,d)[dB]=FSPL(f,d )+10nlog +χCI, (1)\n0 10 d σ\nFactory D, covering the entire manufacturing space. The TX 0\nwassetto2.5mabovetheground,andtheRXwassetto1.5m for d ≥ d , where d = 1m.",
      "size": 878,
      "sentences": 5
    },
    {
      "id": 22,
      "content": "RX locations in PL(f,d)[dB]=FSPL(f,d )+10nlog +χCI, (1)\n0 10 d σ\nFactory D, covering the entire manufacturing space. The TX 0\nwassetto2.5mabovetheground,andtheRXwassetto1.5m for d ≥ d , where d = 1m. d is the 3-D T-R separation\n0 0\nand 0.5 m above the ground at each RX location for studying distance and d is the reference distance. The free space path\n0\nthe impact of antenna heights. The 12 TX-RX location pairs lossatareferencedistanceofd =1matthecarrierfrequency\n0\nconsistedofthreeLOSlocationsandnineNLOSlocationsfor f isgivenbyFSPL(f,1m)[dB]=20log (cid:0) 4πf ×109/c (cid:1) =\n10\nhigh RX. In contrast, only TX1 and RX3 were in LOS for 32.4[dB] + 20log (f). χCI denotes shadow fading (SF),\n10 σ\nlow RX. The T-R separation distance ranged from 7.0 m to commonly modeled as a normal random variable with zero\n35.1m.Inaddition,thePRSmeasurementswereconductedat mean and σ standard deviation in dB. The CI path loss model\ntwelve locations at both RX heights.",
      "size": 959,
      "sentences": 9
    },
    {
      "id": 23,
      "content": "monly modeled as a normal random variable with zero\n35.1m.Inaddition,thePRSmeasurementswereconductedat mean and σ standard deviation in dB. The CI path loss model\ntwelve locations at both RX heights. uses the FSPL at the reference distance as a fixed intercept\n=== 페이지 4 ===\nand finds a straight line fit to the measured path loss data that LOS direction, indicating that reflection and scattering have a\nachieves the minimum mean square error [4], [5], [18]. prominent de-polarization effect. Fig. 6: Omnidirectional CI and CIX path loss model parame-\nFig. 5: Directional path loss data and best fit CI path loss terswithd =1mfor142GHzindoorfactorychannelsforV-\n0\nmodels (d =1 m) for V-V polarizations for 142 GHz indoor\n0 V and V-H antenna polarization orientations in four factories. factory channels from four factories. Fig. 6 displays the omnidirectional path loss scatter plot\nFig.",
      "size": 888,
      "sentences": 10
    },
    {
      "id": 24,
      "content": "polarizations for 142 GHz indoor\n0 V and V-H antenna polarization orientations in four factories. factory channels from four factories. Fig. 6 displays the omnidirectional path loss scatter plot\nFig. 5 shows the directional path loss scatter plots and best and best fit CI and CIX models at 142 GHz in LOS and\nfit CI (1) models for the 142 GHz LOS and NLOS scenarios NLOS environments for co-polarization (V-V) and cross-\nfor the co-polarized (V-V) and cross-polarized (V-H) antenna polarization(V-H)antennaconfigurationsfromallfourfactory\nconfigurations from all four factory sites. Each scatter point sites. Factory sites are denoted as different markers. For V-\ndenotes a unique pointing direction pair of TX and RX horn V polarization, the LOS PLE is 1.80, which is similar to\nantennaswith8°HPBW.TheLOSdirectiondenotestheunique the value in office environments (1.75) [4], [20] and better\nTX-RX angles when the TX and RX point to each other. than the outdoor environments (1.91) [21].",
      "size": 988,
      "sentences": 9
    },
    {
      "id": 25,
      "content": "with8°HPBW.TheLOSdirectiondenotestheunique the value in office environments (1.75) [4], [20] and better\nTX-RX angles when the TX and RX point to each other. than the outdoor environments (1.91) [21]. The NLOS PLE\nThe NLOS direction denotes all the remaining TX-RX angles is 3.07, which is worse than 2.7 in office environment [4],\nin which the receive power exceeds the threshold. The Best [20] and 2.9 in outdoor environment [5], [22], indicating that\nNLOS direction is picked from the NLOS directions for each the factories may be harsh for signal propagation in NLOS\nTX-RXlocationpair,whichcontainsthemostreceivedpower. scenarios due to 1) dense clutter such as workstations and\nNote that the directions adjacent to the LOS direction are shelves, 2) large space leading to long propagation distances\nexcluded from the selection of NLOS Best directions to avoid and a high chance of blockage, 3) smooth surfaces of metallic\nthe effect of antenna pattern.",
      "size": 956,
      "sentences": 5
    },
    {
      "id": 26,
      "content": "e space leading to long propagation distances\nexcluded from the selection of NLOS Best directions to avoid and a high chance of blockage, 3) smooth surfaces of metallic\nthe effect of antenna pattern. objects producing only specular reflections with limited scat-\nForV-Vantennapolarization,theLOSPLEis2.06,closeto tering. Previous works on channel measurements in factories\nthefreespacePLEof2.TheNLOSPLEisreducedfrom5.01 at mmWave frequencies showed similar PLEs [23]–[25]. to 3.27 by pointing antennas to the strongest NLOS direction\ninsteadofanarbitrarydirection,suggestingthatbeamsteering\nIV. HIGHANDLOWRXHEIGHTS\nis critical for THz communication systems. However, Site A According to the terminologies from 3GPP TR 38.901\nand Site D produce smaller NLOS and NLOS-Best PLEs than [26], a device is clutter-elevated if the antenna is higher than\nSiteBandSiteC,possiblybecauseSiteAandSiteDaremore the average environmental clutter height.",
      "size": 937,
      "sentences": 6
    },
    {
      "id": 27,
      "content": "oduce smaller NLOS and NLOS-Best PLEs than [26], a device is clutter-elevated if the antenna is higher than\nSiteBandSiteC,possiblybecauseSiteAandSiteDaremore the average environmental clutter height. A device is clutter-\nopen-plannedwithfewerpartitionsandlessclutterdensity.For embeddedifthedeviceantennaislowerthantheaverageenvi-\nthe V-H polarized measurements, the LOS, NLOS-Best, and ronmental clutter height. We conducted comparative propaga-\nNLOS PLEs are 4.27, 5.16, and 6.17, respectively, which are tion measurements at 1.5 m and 0.5 m RX heights emulating\nmuch greater than the PLEs for V-V antenna polarization due high(clutter-elevated)UEsandlow(clutter-embedded)UEsat\nto the polarization mismatch between antennas and channels.",
      "size": 739,
      "sentences": 3
    },
    {
      "id": 28,
      "content": "5 m RX heights emulating\nmuch greater than the PLEs for V-V antenna polarization due high(clutter-elevated)UEsandlow(clutter-embedded)UEsat\nto the polarization mismatch between antennas and channels. factorysiteD,wheretheaverageclutterheightis1m.TheTX\nUsing the PLEs of co-polarized path loss data, the CIX wasfixedat2.5masindooraccesspoints.AsshowninFig.4,\nmodel [7] provides a much better fit than the CI model by threeTXlocationsandnineRXlocationswereselectedinSite\nreducing the standard deviation from 7.1 dB to 2.9 dB for D, resulting in 12 TX-RX location pairs. Both high and low\nLOS directions and from 9.4 dB to 6.4 dB for NLOS-Best UEs were measured at 12 identical locations. For the high UE\ndirections. The XPD for LOS directions is 27.1 dB, close to measurements, there were five LOS location pairs and seven\nthe antenna XPD measured in free space of 27.5 dB [19]. The NLOS location pairs.",
      "size": 901,
      "sentences": 6
    },
    {
      "id": 29,
      "content": "directions. The XPD for LOS directions is 27.1 dB, close to measurements, there were five LOS location pairs and seven\nthe antenna XPD measured in free space of 27.5 dB [19]. The NLOS location pairs. There were one LOS location pair and\nNLOS-Best directions produce an XPD of 22.2 dB, and the eleven NLOS location pairs for the low UE measurements. NLOSdirectionsproduceanXPDof13.3dB.TheNLOS-Best Fig. 7 compares omnidirectional path loss between the high\ndirections show an XPD reduction of 5 dB compared to the and low RX heights at each measurement location at Factory\n=== 페이지 5 ===\n(a) Directional path loss reduction with PRS aid at high (H)\nFig.7:Location-wisecomparisonofomnidirectionalpathloss\nand low (L) RX heights in factory site D.\nfor high and low RXs in factory site D.\nSite D. The omnidirectional path loss increases at every LOS\nand NLOS location because the minimum path loss variation\nis -1.7 dB (i.e., the high-UE path loss is smaller than the low-\nUE path loss).",
      "size": 982,
      "sentences": 6
    },
    {
      "id": 30,
      "content": "Site D. The omnidirectional path loss increases at every LOS\nand NLOS location because the minimum path loss variation\nis -1.7 dB (i.e., the high-UE path loss is smaller than the low-\nUE path loss). The maximum path loss increases are 20.8 dB\nand 13.8 dB in the LOS and NLOS scenarios. The mean path\nloss increases are 10.7 dB and 6.0 dB in the LOS and NLOS\nscenarios.The largerpathlossincrease intheLOSscenario is\nexpected due to the potential blockage of the LOS path. For\nexample, the largest path loss increase was recorded at TX2\nandRX6,wherea1mtallmachineblockedtheboresightpath\nbetweenTX2andRX6.Thelargerstandarddeviationof6.3dB\nin the LOS scenario also suggests the risk of the diminishing\nLOS path. The derived NLOS PLEs are 2.50 and 2.88 for the (b) Omnidirectional path loss reduction with PRS aid at high\n(H) and low (L) RX heights in factory site D.\nhigh and low RXs, respectively, indicating that the low RX\noften experiences additional path loss due to the blockage and Fig.",
      "size": 989,
      "sentences": 5
    },
    {
      "id": 31,
      "content": "ction with PRS aid at high\n(H) and low (L) RX heights in factory site D.\nhigh and low RXs, respectively, indicating that the low RX\noften experiences additional path loss due to the blockage and Fig. 8: Directional and omnidirectional path loss comparison\nshadowing effect of clutter in the proximity. between the natural and the PRS-aided channels measured at\nhigh (H) and low (L) RX heights in factory site D.\nV. CHANNELENHANCEMENTUSINGPASSIVE\nthe boresight. The adjacent azimuth TX pointing directions\nREFLECTINGSURFACES\nwith 8° spacing that showed sufficient reflecting power were\nWe conducted regular channel measurements at each loca- measured at several locations. tion without the PRS by rotating the TX and RX antennas Thedirectionalpathlossreductioninthereflectingdirection\nin the azimuth and elevation planes to record omnidirectional enhancedbythePRSisshowninFig.8alocationbylocation,\nchannel responses.",
      "size": 915,
      "sentences": 5
    },
    {
      "id": 32,
      "content": "RX antennas Thedirectionalpathlossreductioninthereflectingdirection\nin the azimuth and elevation planes to record omnidirectional enhancedbythePRSisshowninFig.8alocationbylocation,\nchannel responses. The PRS position was selected based on where, for each TX-RX location pair, the TX-RX antenna\nthe regular measurement results to improve a single-bounce pointing combination that presents the maximum directional\nreflection path. Next, a visual ray tracing was performed power gain is plotted. Note that the directional path loss\nto identify the reflecting object. Only the reflecting objects power is calculated by summing all the samples recorded in a\nsuch as walls, pillars, corners, and large fixed furniture were directional PDP, which may contain multiple MPCs. The PRS\nconsidered candidate PRS locations because hard or flexible provides a mean power increase of 25 dB with a maximum\nRISswouldbeinstalledonfixedlargesurfacesinfutureindoor of 37.8 dB and a minimum of 6.6 dB.",
      "size": 980,
      "sentences": 6
    },
    {
      "id": 33,
      "content": "ered candidate PRS locations because hard or flexible provides a mean power increase of 25 dB with a maximum\nRISswouldbeinstalledonfixedlargesurfacesinfutureindoor of 37.8 dB and a minimum of 6.6 dB. The TX2 and low\nscenarios. The metal plate was placed next to the reflecting RX6showthemaximumgainof37.8dBbecausethedistance\nobject at a height between the TX and RX, depending on betweentheTX2,PRS2-6L,andRX6istheshortestamongall\nthe relative positions. We manually and carefully rotated the themeasurementlocations.Inaddition,thereflectionfromthe\nmetal plate in the horizontal plane to find the best orientation partition wall where PRS2-6L is located is partially blocked\nthat provided the largest channel gain, which emulated the by the machinery near the RX6 without the aid of a PRS. configurability of RISs steering the beam to the best direction However, the PRS emulates the anomalous reflector that does\nbased on channel estimation.",
      "size": 941,
      "sentences": 5
    },
    {
      "id": 34,
      "content": "chinery near the RX6 without the aid of a PRS. configurability of RISs steering the beam to the best direction However, the PRS emulates the anomalous reflector that does\nbased on channel estimation. With the TX antenna fixed, the not obey the specular reflection from the original furniture\nRX antenna was swept over 360° in the azimuth plane in surfaceandcreatesastrongsingle-bouncereflectionpath.The\nstepincrementsoftheantennahalf-powerbeamwidth(HPBW) TX2andlowRX8presenttheminimumdirectionalpathpower\nof 8°.",
      "size": 511,
      "sentences": 3
    },
    {
      "id": 35,
      "content": "over 360° in the azimuth plane in surfaceandcreatesastrongsingle-bouncereflectionpath.The\nstepincrementsoftheantennahalf-powerbeamwidth(HPBW) TX2andlowRX8presenttheminimumdirectionalpathpower\nof 8°. Identical azimuth sweeps were performed at three gainof6.6dBbecausethesignalistransmittedoverthelargest\nelevation planes, which were boresight, 8° above and below T-R separation distance of 38 m measured in site D, where\n=== 페이지 6 ===\nmany machines and tables are located between the TX and [6] Y.Chen,Y.Li,C.Han,Z.Yu,andG.Wang,“Channelmeasurementand\nRXcausingpartialblockage.Thus,thelinkcreatedbythePRS ray-tracing-statistical hybrid modeling for low-Terahertz indoor com-\nmunications,”IEEETransactionsonWirelessCommunications,vol.20,\ndoesnothaveaclearfirst-orderreflectionpath,indicatingthat\nno.12,pp.8163–8176,2021. the choice of location of PRS2-8L might not be optimal. Fig.",
      "size": 878,
      "sentences": 4
    },
    {
      "id": 36,
      "content": "tions,”IEEETransactionsonWirelessCommunications,vol.20,\ndoesnothaveaclearfirst-orderreflectionpath,indicatingthat\nno.12,pp.8163–8176,2021. the choice of location of PRS2-8L might not be optimal. Fig. [7] S.Ju,Y.Xing,O.Kanhere,andT.S.Rappaport,“Sub-Terahertzchannel\n8b shows the influence of the PRS on omnidirectional path measurementsandcharacterizationinafactorybuilding,”in2022IEEE\nInternationalConferenceonCommunications(ICC),May2022,pp.1–6. loss. The PRS increases the omnidirectional received power\n[8] S.Ju,S.H.A.Shah,M.A.Javed,J.Li,G.Palteru,J.Robin,Y.Xing,\nby a maximum of 22 dB and a minimum of 0.5 dB with a O.Kanhere,andT.S.Rappaport,“Scatteringmechanismsandmodeling\nmean of 6.5 dB. This increase depends on the PRS and other for Terahertz wireless communications,” in ICC 2019 - 2019 IEEE\nInternationalConferenceonCommunications(ICC),2019,pp.1–7. existing MPCs.",
      "size": 874,
      "sentences": 8
    },
    {
      "id": 37,
      "content": "ing\nmean of 6.5 dB. This increase depends on the PRS and other for Terahertz wireless communications,” in ICC 2019 - 2019 IEEE\nInternationalConferenceonCommunications(ICC),2019,pp.1–7. existing MPCs. A slight increase indicates that other MPCs\n[9] B.Chen,J.Wan,L.Shu,P.Li,M.Mukherjee,andB.Yin,“Smartfactory\ndominate the total received power, which is typical for the of Industry 4.0: Key technologies, application case, and challenges,”\nLOS scenario. However, a significant increase often occurs IEEEAccess,vol.6,pp.6505–6519,2018. [10] W.Khawaja,O.Ozdemir,Y.Yapici,F.Erden,andI.Guvenc,“Coverage\nat NLOS and near-outage locations, where the PRS-enhanced\nenhancement for nlos mmWave links using passive reflectors,” IEEE\npath becomes the strongest path and dominates the channel. OpenJournaloftheCommunicationsSociety,vol.1,pp.263–281,2020. [11] Y.Li,Y.Wang,Y.Chen,Z.Yu,andC.Han,“Channelmeasurementand\ncharacterizationwithmodifiedSAGEalgorithminanindoorcorridorat\nVI. CONCLUSIONS 300GHz,”arXiv,2022.",
      "size": 998,
      "sentences": 9
    },
    {
      "id": 38,
      "content": "unicationsSociety,vol.1,pp.263–281,2020. [11] Y.Li,Y.Wang,Y.Chen,Z.Yu,andC.Han,“Channelmeasurementand\ncharacterizationwithmodifiedSAGEalgorithminanindoorcorridorat\nVI. CONCLUSIONS 300GHz,”arXiv,2022. [12] N. A. Abbasi et al., “Ultra-wideband double directional channel mea-\nThis paper presents the first extensive sub-THz channel surementsforTHzcommunicationsinurbanenvironments,”inICC2021\nmeasurement campaign at 142 GHz for the indoor factory -IEEEInternationalConferenceonCommunications,2021,pp.1–6. [13] S.W.Ellingson,“Pathlossinreconfigurableintelligentsurface-enabled\nscenarios. The directional and omnidirectional path loss are\nchannels,” in 2021 IEEE 32nd Annual International Symposium on\nmodeled based on 82 TX-RX locations, including 30 LOS Personal, Indoor and Mobile Radio Communications (PIMRC), 2021,\nlocations, 48 NLOS locations, and four outage locations. The pp.829–835.",
      "size": 888,
      "sentences": 7
    },
    {
      "id": 39,
      "content": "osium on\nmodeled based on 82 TX-RX locations, including 30 LOS Personal, Indoor and Mobile Radio Communications (PIMRC), 2021,\nlocations, 48 NLOS locations, and four outage locations. The pp.829–835. [14] Y. Xing and T. S. Rappaport, “Propagation measurement system and\nomnidirectional PLE for NLOS locations is 3.1, which is\napproachat140GHz-movingto6Gandabove100GHz,”in2018IEEE\nhigher than the values obtained from indoor office (2.7) and GlobalCommunicationsConference(GLOBECOM),2018,pp.1–6. outdoor urban environments (2.9), suggesting that factories [15] T. S. Rappaport, R. Heath Jr, R. Daniels, and J. Murdock, Millimeter\nwavewirelesscommunications,1sted. PearsonEducation,2015. may induce additional attenuation due to heavy clutter for\n[16] S. Sun et al., “Synthesizing omnidirectional antenna patterns, received\nNLOS environments.",
      "size": 840,
      "sentences": 6
    },
    {
      "id": 40,
      "content": "communications,1sted. PearsonEducation,2015. may induce additional attenuation due to heavy clutter for\n[16] S. Sun et al., “Synthesizing omnidirectional antenna patterns, received\nNLOS environments. Furthermore, the channel measurements power and path loss from directional antennas for 5G millimeter-wave\nconducted at a low RX height indicate that near-the-ground communications,” in 2015 IEEE Global Communications Conference\n(GLOBECOM),2015,pp.1–7. UEs such as AGVs may experience larger path loss (i.e.,\n[17] ——, “Investigation of prediction accuracy, sensitivity, and parameter\n10.7 dB and 6.0 dB increase for LOS and NLOS locations) stability of large-scale propagation path loss models for 5G wireless\ncompared to a high RX height due to a higher probability communications,”IEEETransactionsonVehicularTechnology,vol.65,\nno.5,pp.2843–2860,2016. of blockage and scattering loss caused by surrounding ob-\n[18] T.S.Rappaport,G.R.MacCartney,M.K.Samimi,andS.Sun,“Wide-\nstructions.",
      "size": 983,
      "sentences": 6
    },
    {
      "id": 41,
      "content": "EEETransactionsonVehicularTechnology,vol.65,\nno.5,pp.2843–2860,2016. of blockage and scattering loss caused by surrounding ob-\n[18] T.S.Rappaport,G.R.MacCartney,M.K.Samimi,andS.Sun,“Wide-\nstructions. Moreover, the channel enhancement measurements band millimeter-wave propagation measurements and channel models\ndemonstrate that a single large metal plate can provide an for future wireless communication system design,” IEEE Transactions\nonCommunications,vol.63,no.9,pp.3029–3056,2015. average gain of 25 dB in the desired pointing directions by\n[19] D. Shakya, T. Wu, M. E. Knox, and T. S. Rappaport, “A wideband\naccurately orientating the plate. In general, the PRS increases slidingcorrelationchannelsounderin65nmCMOS:Evaluationboard\nthe omnidirectional received power by a maximum of 22 dB performance,” IEEE Transactions on Circuits and Systems II: Express\nBriefs,vol.68,no.9,pp.3043–3047,2021.",
      "size": 900,
      "sentences": 5
    },
    {
      "id": 42,
      "content": "nelsounderin65nmCMOS:Evaluationboard\nthe omnidirectional received power by a maximum of 22 dB performance,” IEEE Transactions on Circuits and Systems II: Express\nBriefs,vol.68,no.9,pp.3043–3047,2021. and a minimum of 0.5 dB with a mean of 6.5 dB, suggesting\n[20] Y. Xing, T. S. Rappaport, and A. Ghosh, “Millimeter wave and sub-\nthatfutureimplementationsanddeploymentsofRISscanplay THz indoor radio propagation channel measurements, models, and\nan essential part in sub-THz wireless systems. This work comparisons in an office environment,” IEEE Communications Letters,\nvol.25,no.10,pp.3151–3155,2021. maymotivatemoreeffortonsub-THzapplicationsinfactories\n[21] Y. Xing and T. S. Rappaport, “Propagation measurements and path\nand provide insights on factory channel model standardization loss models for sub-THz in urban microcells,” in ICC 2021 - IEEE\nabove 100 GHz. InternationalConferenceonCommunications,2021,pp.1–6.",
      "size": 919,
      "sentences": 5
    },
    {
      "id": 43,
      "content": "path\nand provide insights on factory channel model standardization loss models for sub-THz in urban microcells,” in ICC 2021 - IEEE\nabove 100 GHz. InternationalConferenceonCommunications,2021,pp.1–6. [22] S. Ju and T. S. Rappaport, “Sub-Terahertz spatial statistical MIMO\nchannelmodelforurbanmicrocellsat142GHz,”in2021IEEEGlobal\nREFERENCES CommunicationsConference(GLOBECOM),2021,pp.1–6. [23] M. Schmieder, F. Undi, M. Peter, E. Koenig, and W. Keusgen, “Di-\nrectional wideband channel measurements at 28 GHz in an indus-\n[1] T.S.Rappaport,Y.Xing,O.Kanhere,S.Ju,A.Madanayake,S.Mandal,\ntrial environment,” in 2019 IEEE Global Communications Conference\nA. Alkhateeb, and G. C. Trichopoulos, “Wireless communications and\n(GLOBECOM),2019,pp.1–6. applications above 100 GHz: Opportunities and challenges for 6G and\n[24] A.Al-Saman,M.Mohamed,M.Cheffena,andA.Moldsvor,“Wideband\nbeyond,”IEEEAccess,vol.7,pp.78729–78757,2019.",
      "size": 915,
      "sentences": 5
    },
    {
      "id": 44,
      "content": "(GLOBECOM),2019,pp.1–6. applications above 100 GHz: Opportunities and challenges for 6G and\n[24] A.Al-Saman,M.Mohamed,M.Cheffena,andA.Moldsvor,“Wideband\nbeyond,”IEEEAccess,vol.7,pp.78729–78757,2019. channel characterization for 6G networks in industrial environments,”\n[2] T.S.Rappaportetal.,“Millimeterwavemobilecommunicationsfor5G\nSensors,vol.21,no.6,2021. cellular:Itwillwork!”IEEEAccess,vol.1,pp.335–349,May2013. [25] D. Chizhik et al., “Path loss and directional gain measurements at 28\n[3] FCC,“Spectrumhorizons,”FirstReportandOrder–ETDocket18-21,\nGHz for factory automation,” in 2019 IEEE International Symposium\nWashingtonD.C.,2019. onAntennasandPropagationandUSNC-URSIRadioScienceMeeting,\n[4] S. Ju, Y. Xing, O. Kanhere, and T. S. Rappaport, “Millimeter wave 2019,pp.2143–2144.",
      "size": 786,
      "sentences": 6
    },
    {
      "id": 45,
      "content": "019 IEEE International Symposium\nWashingtonD.C.,2019. onAntennasandPropagationandUSNC-URSIRadioScienceMeeting,\n[4] S. Ju, Y. Xing, O. Kanhere, and T. S. Rappaport, “Millimeter wave 2019,pp.2143–2144. and sub-Terahertz spatial statistical channel model for an indoor office [26] 3GPP, “Technical specification group radio access network; study on\nbuilding,”IEEEJournalonSelectedAreasinCommunications,vol.39, channelmodelforfrequenciesfrom0.5to100GHz(Release16),”TR\nno.6,pp.1561–1575,2021. 38.901V16.0.0,October2019. [5] Y.XingandT.S.Rappaport,“MillimeterwaveandTerahertzurbanmi-\ncrocellpropagationmeasurementsandmodels,”IEEECommunications\nLetters,vol.25,no.12,pp.3755–3759,2021.",
      "size": 677,
      "sentences": 5
    }
  ]
}