{
  "collection_info": {
    "created_date": "2025-09-17",
    "total_papers": 50,
    "source": "ArXiv",
    "search_keywords": [
      "automated guided vehicle",
      "AGV path planning",
      "AGV fleet management",
      "AGV navigation system",
      "AGV collision avoidance",
      "AGV scheduling optimization",
      "multi-AGV coordination",
      "AGV SLAM navigation",
      "rail-based picking robot",
      "overhead rail robot system",
      "EMS picking automation",
      "rail-guided robot warehouse",
      "ceiling-mounted picking robot",
      "rail robot material handling",
      "automated picking rail system",
      "overhead crane robot picking",
      "rail-based storage retrieval",
      "gantry robot warehouse",
      "robotic transfer vehicle",
      "RTV material handling",
      "automated material transport",
      "robotic logistics system",
      "autonomous transfer robot",
      "RTV warehouse automation",
      "intelligent conveyor system",
      "smart conveyor belt",
      "automated conveyor control",
      "conveyor sorting system",
      "adaptive conveyor network",
      "conveyor AGV integration",
      "A* algorithm warehouse",
      "path optimization warehouse",
      "warehouse route planning",
      "dynamic path planning factory",
      "multi-robot path planning",
      "warehouse navigation algorithm",
      "shortest path warehouse logistics",
      "Dijkstra algorithm warehouse",
      "RRT path planning warehouse",
      "genetic algorithm warehouse optimization",
      "warehouse layout optimization",
      "optimal warehouse design",
      "warehouse traffic flow optimization",
      "storage location optimization",
      "warehouse space utilization",
      "picking route optimization",
      "warehouse congestion management",
      "material flow optimization",
      "smart factory automation",
      "Industry 4.0 robotics",
      "intelligent manufacturing system",
      "cyber-physical system factory",
      "IoT smart factory",
      "digital twin warehouse",
      "smart factory logistics",
      "autonomous manufacturing system",
      "multi-robot coordination",
      "robot fleet management",
      "collaborative robot system",
      "swarm robotics warehouse",
      "distributed robot control",
      "robot task allocation",
      "real-time warehouse monitoring",
      "predictive maintenance AGV",
      "warehouse digital twin",
      "smart sensor warehouse",
      "RFID warehouse tracking",
      "computer vision warehouse",
      "machine learning warehouse optimization",
      "AI-driven logistics",
      "reinforcement learning AGV",
      "neural network path planning",
      "deep learning warehouse management",
      "predictive analytics warehouse"
    ]
  },
  "papers": [
    {
      "id": "http://arxiv.org/abs/2509.10617v1",
      "title": "gNB-based Local Breakout for URLLC in industrial 5G",
      "authors": [
        "Rajendra Paudyal",
        "Rajendra Upadhyay",
        "Al Nahian Bin Emran",
        "Duminda Wijesekera"
      ],
      "abstract": "Industrial URLLC workloads-coordinated robotics, automated guided vehicles,\nmachine-vision collaboration require sub-5 ms latency and five-nines\nreliability. In standardized 5G Multicast/Broadcast Services, intra-cell group\ntraffic remains anchored in the core using MB-SMF/MB-UPF, and the Application\nFunction. This incurs a core network path and packet delay that is avoidable\nwhen data transmitters and receivers share a cell. We propose a gNB-local\nmulticast breakout that pivots eligible uplink flows to a downlink\npoint-to-multipoint bearer within the gNB, while maintaining authorization,\nmembership, and policy in the 5G core. The design specifies an eligibility\npolicy, configured-grant uplink. 3GPP security and compliance are preserved via\nunchanged control-plane anchors. A latency budget and simulation indicate that\nremoving the backhaul/UPF/AF segment reduces end-to-end latency from\napproximate 6.5-11.5 ms (anchored to the core) to 1.5-4.0 ms (local breakout),\nproducing sub-2 ms averages and a stable gap approximate 10 ms between group\nsizes. The approach offers a practical, standards-aligned path to deterministic\nintra-cell group dissemination in private 5G. We outline multi-cell and\nprototype validation as future work.",
      "published": "2025-09-12",
      "categories": [
        "cs.NI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2509.10617v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2509.06451v1",
      "title": "Network-Aware Control of AGVs in an Industrial Scenario: A Simulation Study Based on ROS 2 and Gazebo",
      "authors": [
        "Filippo Bragato",
        "Tullia Fontana",
        "Marco Giordani",
        "Malte Schellmann",
        "Josef Eichinger",
        "Michele Zorzi"
      ],
      "abstract": "Networked Control System (NCS) is a paradigm where sensors, controllers, and\nactuators communicate over a shared network. One promising application of NCS\nis the control of Automated Guided Vehicles (AGVs) in the industrial\nenvironment, for example to transport goods efficiently and to autonomously\nfollow predefined paths or routes. In this context, communication and control\nare tightly correlated, a paradigm referred to as Joint Communication and\nControl (JCC), since network issues such as delays or errors can lead to\nsignificant deviations of the AGVs from the planned trajectory. In this paper,\nwe present a simulation framework based on Gazebo and Robot Operating System 2\n(ROS 2) to simulate and visualize, respectively, the complex interaction\nbetween the control of AGVs and the underlying communication network. This\nframework explicitly incorporates communication metrics, such as delay and\npacket loss, and control metrics, especially the Mean Squared Error (MSE)\nbetween the optimal/desired and actual path of the AGV in response to driving\ncommands. Our results shed light into the correlation between the network\nperformance, particularly Packet Reception Ratio (PRR), and accuracy of\ncontrol.",
      "published": "2025-09-08",
      "categories": [
        "cs.NI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2509.06451v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2508.07814v1",
      "title": "SwarmVLM: VLM-Guided Impedance Control for Autonomous Navigation of Heterogeneous Robots in Dynamic Warehousing",
      "authors": [
        "Malaika Zafar",
        "Roohan Ahmed Khan",
        "Faryal Batool",
        "Yasheerah Yaqoot",
        "Ziang Guo",
        "Mikhail Litvinov",
        "Aleksey Fedoseev",
        "Dzmitry Tsetserukou"
      ],
      "abstract": "With the growing demand for efficient logistics, unmanned aerial vehicles\n(UAVs) are increasingly being paired with automated guided vehicles (AGVs).\nWhile UAVs offer the ability to navigate through dense environments and varying\naltitudes, they are limited by battery life, payload capacity, and flight\nduration, necessitating coordinated ground support.\n  Focusing on heterogeneous navigation, SwarmVLM addresses these limitations by\nenabling semantic collaboration between UAVs and ground robots through\nimpedance control. The system leverages the Vision Language Model (VLM) and the\nRetrieval-Augmented Generation (RAG) to adjust impedance control parameters in\nresponse to environmental changes. In this framework, the UAV acts as a leader\nusing Artificial Potential Field (APF) planning for real-time navigation, while\nthe ground robot follows via virtual impedance links with adaptive link\ntopology to avoid collisions with short obstacles.\n  The system demonstrated a 92% success rate across 12 real-world trials. Under\noptimal lighting conditions, the VLM-RAG framework achieved 8% accuracy in\nobject detection and selection of impedance parameters. The mobile robot\nprioritized short obstacle avoidance, occasionally resulting in a lateral\ndeviation of up to 50 cm from the UAV path, which showcases safe navigation in\na cluttered setting.",
      "published": "2025-08-11",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2508.07814v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2508.00724v1",
      "title": "Petri Net Modeling and Deadlock-Free Scheduling of Attachable Heterogeneous AGV Systems",
      "authors": [
        "Boyu Li",
        "Zhengchen Li",
        "Weimin Wu",
        "Mengchu Zhou"
      ],
      "abstract": "The increasing demand for automation and flexibility drives the widespread\nadoption of heterogeneous automated guided vehicles (AGVs). This work intends\nto investigate a new scheduling problem in a material transportation system\nconsisting of attachable heterogeneous AGVs, namely carriers and shuttles. They\ncan flexibly attach to and detach from each other to cooperatively execute\ncomplex transportation tasks. While such collaboration enhances operational\nefficiency, the attachment-induced synchronization and interdependence render\nthe scheduling coupled and susceptible to deadlock. To tackle this challenge,\nPetri nets are introduced to model AGV schedules, well describing the\nconcurrent and sequential task execution and carrier-shuttle synchronization.\nBased on Petri net theory, a firing-driven decoding method is proposed, along\nwith deadlock detection and prevention strategies to ensure deadlock-free\nschedules. Furthermore, a Petri net-based metaheuristic is developed in an\nadaptive large neighborhood search framework and incorporates an effective\nacceleration method to enhance computational efficiency. Finally, numerical\nexperiments using real-world industrial data validate the effectiveness of the\nproposed algorithm against the scheduling policy applied in engineering\npractice, an exact solver, and four state-of-the-art metaheuristics. A\nsensitivity analysis is also conducted to provide managerial insights.",
      "published": "2025-08-01",
      "categories": [
        "eess.SY",
        "cs.RO",
        "cs.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2508.00724v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2507.12235v1",
      "title": "Frequency-responsive RCS characteristics and scaling implications for ISAC development",
      "authors": [
        "Saúl Fenollosa",
        "Monika Drozdowska",
        "Wenfei Yang",
        "Sergio Micó-Rosa",
        "Alejandro Castilla",
        "Alejandro Lopez-Escudero",
        "Jian Li",
        "Narcis Cardona"
      ],
      "abstract": "This paper presents an investigation on the Radar Cross-Section (RCS) of\nvarious targets, with the objective of analysing how RCS properties vary with\nfrequency. Targets such as an Automated Guided Vehicle (AGV), a pedestrian, and\na full-scale car were measured in the frequency bands referred to in industry\nstandards as FR2 and FR3. Measurements were taken in diverse environments,\nindoors and outdoors, to ensure comprehensive scenario coverage. The\nmethodology employed in RCS extraction performs background subtraction,\nfollowed by time-domain gating to isolate the influence of the target. This\nanalysis compares the RCS values and how the points of greatest contribution\nare distributed across different bands based on the range response of the RCS.\nAnalysis of the results demonstrated how RCS values change with frequency and\ntarget shape, providing insights into the electromagnetic behaviour of these\ntargets. Key findings highlight how much scaling RCS values based on frequency\nand geometry is complex and varies among different types of materials and\nshapes. These insights are instrumental for advancing sensing systems and\nenhancing 3GPP channel models, particularly for Integrated Sensing and\nCommunications (ISAC) techniques proposed for 6G standards.",
      "published": "2025-07-16",
      "categories": [
        "eess.SP"
      ],
      "pdf_url": "http://arxiv.org/pdf/2507.12235v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2507.02374v1",
      "title": "Predictive Control over LAWN: Joint Trajectory Design and Resource Allocation",
      "authors": [
        "Haijia Jin",
        "Jun Wu",
        "Weijie Yuan",
        "Ruizhi Ruan",
        "Jiacheng Wang",
        "Dusit Niyato",
        "Dong In Kim",
        "Abbas Jamalipour"
      ],
      "abstract": "Low-altitude wireless networks (LAWNs) have been envisioned as flexible and\ntransformative platforms for enabling delay-sensitive control applications in\nInternet of Things (IoT) systems. In this work, we investigate the real-time\nwireless control over a LAWN system, where an aerial drone is employed to serve\nmultiple mobile automated guided vehicles (AGVs) via finite blocklength (FBL)\ntransmission. Toward this end, we adopt the model predictive control (MPC) to\nensure accurate trajectory tracking, while we analyze the communication\nreliability using the outage probability. Subsequently, we formulate an\noptimization problem to jointly determine control policy, transmit power\nallocation, and drone trajectory by accounting for the maximum travel distance\nand control input constraints. To address the resultant non-convex optimization\nproblem, we first derive the closed-form expression of the outage probability\nunder FBL transmission. Based on this, we reformulate the original problem as a\nquadratic programming (QP) problem, followed by developing an alternating\noptimization (AO) framework. Specifically, we employ the projected gradient\ndescent (PGD) method and the successive convex approximation (SCA) technique to\nachieve computationally efficient sub-optimal solutions. Furthermore, we\nthoroughly analyze the convergence and computational complexity of the proposed\nalgorithm. Extensive simulations and AirSim-based experiments are conducted to\nvalidate the superiority of our proposed approach compared to the baseline\nschemes in terms of control performance.",
      "published": "2025-07-03",
      "categories": [
        "eess.SP"
      ],
      "pdf_url": "http://arxiv.org/pdf/2507.02374v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2505.08754v1",
      "title": "3GPP-Compliant Radar Cross Section Characterization of Indoor Factory Targets",
      "authors": [
        "Ali Waqar Azim",
        "Ahmad Bazzi",
        "Roberto Bomfin",
        "Marwa Chafii"
      ],
      "abstract": "The following paper presents a systematic 3rd Generation Partnership Project\n(3GPP)-compliant characterization of radar cross section (RCS) for indoor\nfactory (InF) objects, including small and mid-sized unmanned aerial vehicles\n(UAVs), robotic arms, and automated guided vehicles (AGVs). Through\nmeasurements in the 25-28 GHz range, we validate the 3GPP standardized\nlog-normal distribution model for RCS for above-mentioned target objects. The\n3GPP-complaint RCS parameters obtained for the small-sized UAV are in close\nagreement (<1 dB deviation) with 3GPP agreed values. The mid-sized UAVs exhibit\nhigher reflectivity compared to the small-sized UAV due to enhanced specular\ncomponents attributed to material and lithium-ion battery packs. The robotic\narm exhibits dynamic RCS behavior due to mechanical articulation, whereas UAVs\nshow clear size-dependent reflectivity patterns in AGVs. Our findings provide\nempirical validation for RCS characterization for integrated sensing and\ncommunication channel modeling in InF environments.",
      "published": "2025-05-13",
      "categories": [
        "eess.SP"
      ],
      "pdf_url": "http://arxiv.org/pdf/2505.08754v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2503.24253v1",
      "title": "Deep Learning-Based Data Fusion of 6G Sensing and Inertial Information for Target Positioning: Experimental Validation",
      "authors": [
        "Karthik Muthineni",
        "Alexander Artemenko",
        "Artjom Grudnitsky",
        "Josep Vidal",
        "Montse Najar"
      ],
      "abstract": "The sixth-generation (6G) cellular technology will be deployed with a key\nfeature of Integrated Sensing and Communication (ISAC), allowing the cellular\nnetwork to map the environment through radar sensing on top of providing\ncommunication services. In this regard, the entire network can be considered as\na sensor with a broader Field of View (FoV) of the environment, assisting in\nboth the positioning of active and detection of passive targets. On the other\nhand, the non-3GPP sensors available on the target can provide additional\ninformation specific to the target that can be beneficially combined with ISAC\nsensing information to enhance the overall achievable positioning accuracy. In\nthis paper, we first study the performance of the ISAC system in terms of its\nachievable accuracy in positioning the mobile target in an indoor scenario.\nSecond, we study the performance gain achieved in the ISAC positioning accuracy\nafter fusing the information from the target's non-3GPP sensors. To this end,\nwe propose a novel data fusion solution based on the deep learning framework to\nfuse the information from ISAC and non-3GPP sensors.\n  We validate our proposed data fusion and positioning solution with a\nreal-world ISAC Proof-of-Concept (PoC) as the wireless infrastructure, an\nAutomated Guided Vehicle (AGV) as the target, and the Inertial Measurement Unit\n(IMU) sensor on the target as the non-3GPP sensor. The experimental results\nshow that our proposed solution achieves an average positioning error of\n$3~\\textrm{cm}$, outperforming the considered baselines.",
      "published": "2025-03-31",
      "categories": [
        "eess.SP"
      ],
      "pdf_url": "http://arxiv.org/pdf/2503.24253v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2504.01985v1",
      "title": "Multi-Dimensional AGV Path Planning in 3D Warehouses Using Ant Colony Optimization and Advanced Neural Networks",
      "authors": [
        "Bo Zhang",
        "Xiubo Liang",
        "Wei Song",
        "Yulu Chen"
      ],
      "abstract": "Within modern warehouse scenarios, the rapid expansion of e-commerce and\nincreasingly complex, multi-level storage environments have exposed the\nlimitations of traditional AGV (Automated Guided Vehicle) path planning\nmethods--often reliant on static 2D models and expert-tuned heuristics that\nstruggle to handle dynamic traffic and congestion. Addressing these\nlimitations, this paper introduces a novel AGV path planning approach for 3D\nwarehouse environments that leverages a hybrid framework combining ACO (Ant\nColony Optimization) with deep learning models, called NAHACO (Neural Adaptive\nHeuristic Ant Colony Optimization). NAHACO integrates three key innovations:\nfirst, an innovative heuristic algorithm for 3D warehouse cargo modeling using\nmultidimensional tensors, which addresses the challenge of achieving superior\nheuristic accuracy; second, integration of a congestion-aware loss function\nwithin the ACO framework to adjust path costs based on traffic and capacity\nconstraints, called CARL (Congestion-Aware Reinforce Loss), enabling dynamic\nheuristic calibration for optimizing ACO-based path planning; and third, an\nadaptive attention mechanism that captures multi-scale spatial features,\nthereby addressing dynamic heuristic calibration for further optimization of\nACO-based path planning and AGV navigation. NAHACO significantly boosts path\nplanning efficiency, yielding faster computation times and superior performance\nover both vanilla and state-of-the-art methods, while automatically adapting to\nwarehouse constraints for real-time optimization. NAHACO outperforms\nstate-of-the-art methods, lowering the total cost by up to 24.7% on TSP\nbenchmarks. In warehouse tests, NAHACO cuts cost by up to 41.5% and congestion\nby up to 56.1% compared to previous methods.",
      "published": "2025-03-30",
      "categories": [
        "cs.RO",
        "cs.AI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2504.01985v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2502.08969v1",
      "title": "SkyRover: A Modular Simulator for Cross-Domain Pathfinding",
      "authors": [
        "Wenhui Ma",
        "Wenhao Li",
        "Bo Jin",
        "Changhong Lu",
        "Xiangfeng Wang"
      ],
      "abstract": "Unmanned Aerial Vehicles (UAVs) and Automated Guided Vehicles (AGVs)\nincreasingly collaborate in logistics, surveillance, inspection tasks and etc.\nHowever, existing simulators often focus on a single domain, limiting\ncross-domain study. This paper presents the SkyRover, a modular simulator for\nUAV-AGV multi-agent pathfinding (MAPF). SkyRover supports realistic agent\ndynamics, configurable 3D environments, and convenient APIs for external\nsolvers and learning methods. By unifying ground and aerial operations, it\nfacilitates cross-domain algorithm design, testing, and benchmarking.\nExperiments highlight SkyRover's capacity for efficient pathfinding and\nhigh-fidelity simulations in UAV-AGV coordination. Project is available at\nhttps://sites.google.com/view/mapf3d/home.",
      "published": "2025-02-13",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.LG",
        "cs.MA"
      ],
      "pdf_url": "http://arxiv.org/pdf/2502.08969v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2502.06722v1",
      "title": "HetSwarm: Cooperative Navigation of Heterogeneous Swarm in Dynamic and Dense Environments through Impedance-based Guidance",
      "authors": [
        "Malaika Zafar",
        "Roohan Ahmed Khan",
        "Aleksey Fedoseev",
        "Kumar Katyayan Jaiswal",
        "Dzmitry Tsetserukou"
      ],
      "abstract": "With the growing demand for efficient logistics and warehouse management,\nunmanned aerial vehicles (UAVs) are emerging as a valuable complement to\nautomated guided vehicles (AGVs). UAVs enhance efficiency by navigating dense\nenvironments and operating at varying altitudes. However, their limited flight\ntime, battery life, and payload capacity necessitate a supporting ground\nstation. To address these challenges, we propose HetSwarm, a heterogeneous\nmulti-robot system that combines a UAV and a mobile ground robot for\ncollaborative navigation in cluttered and dynamic conditions. Our approach\nemploys an artificial potential field (APF)-based path planner for the UAV,\nallowing it to dynamically adjust its trajectory in real time. The ground robot\nfollows this path while maintaining connectivity through impedance links,\nensuring stable coordination. Additionally, the ground robot establishes\ntemporal impedance links with low-height ground obstacles to avoid local\ncollisions, as these obstacles do not interfere with the UAV's flight.\nExperimental validation of HetSwarm in diverse environmental conditions\ndemonstrated a 90% success rate across 30 test cases. The ground robot\nexhibited an average deviation of 45 cm near obstacles, confirming effective\ncollision avoidance. Extensive simulations in the Gym PyBullet environment\nfurther validated the robustness of our system for real-world applications,\ndemonstrating its potential for dynamic, real-time task execution in cluttered\nenvironments.",
      "published": "2025-02-10",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2502.06722v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2501.03577v1",
      "title": "Wireless Channel Measurements and Characterization in Industrial IoT Scenarios",
      "authors": [
        "Li Zhang",
        "Cheng-Xiang Wang",
        "Zihao Zhou",
        "Yuxiao Li",
        "Jie Huang",
        "Lijian Xin",
        "Chun Pan",
        "Dabo Zheng",
        "Xiping Wu"
      ],
      "abstract": "Wireless Fidelity (Wi-Fi) communication technologies hold significant\npotential for realizing the Industrial Internet of Things (IIoT). In this\npaper, both Single-Input Single-Output (SISO) and polarized Multiple-Input\nMultiple-Output (MIMO) channel measurements are conducted in an IIoT scenario\nat the less congested Wi-Fi band, i.e., 5.5~GHz. The purpose is to investigate\nwireless characteristics of communications between access points and terminals\nmounted on automated guided vehicles as well as those surrounding manufacturing\nareas. For SISO channel measurements, statistical properties including the\ndelay Power Spectral Density (PSD), path loss, shadowing fading, delay spread,\nexcess delay, K-factor, and amplitude distribution of small-scale fading are\nanalyzed and compared with those observed in an office scenario. For MIMO\nchannel measurements, results show that there are multiple Dense Multipath\nComponent (DMC) processes in the delay PSD. An estimation algorithm based on\nthe algorithm for a single DMC process is proposed to effectively process the\nmulti-processes data. Moreover, delay, angular, power, and polarization\nproperties of DMCs are investigated and compared with those of specular\nmultipath components. Furthermore, effects of DMCs on Singular Values (SVs) and\nchannel capacities are explored. Ignoring DMCs can overestimate SVs and\nunderestimate channel capacities.",
      "published": "2025-01-07",
      "categories": [
        "eess.SY",
        "cs.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2501.03577v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2409.18742v1",
      "title": "A History-Guided Regional Partitioning Evolutionary Optimization for Solving the Flexible Job Shop Problem with Limited Multi-load Automated Guided Vehicles",
      "authors": [
        "Feige Liu",
        "Chao Lu",
        "Xin Li"
      ],
      "abstract": "In a flexible job shop environment, using Automated Guided Vehicles (AGVs) to\ntransport jobs and process materials is an important way to promote the\nintelligence of the workshop. Compared with single-load AGVs, multi-load AGVs\ncan improve AGV utilization, reduce path conflicts, etc. Therefore, this study\nproposes a history-guided regional partitioning algorithm (HRPEO) for the\nflexible job shop scheduling problem with limited multi-load AGVs (FJSPMA).\nFirst, the encoding and decoding rules are designed according to the\ncharacteristics of multi-load AGVs, and then the initialization rule based on\nthe branch and bound method is used to generate the initial population. Second,\nto prevent the algorithm from falling into a local optimum, the algorithm\nadopts a regional partitioning strategy. This strategy divides the solution\nspace into multiple regions and measures the potential of the regions. After\nthat, cluster the regions into multiple clusters in each iteration, and selects\nindividuals for evolutionary search based on the set of clusters. Third, a\nlocal search strategy is designed to improve the exploitation ability of the\nalgorithm, which uses a greedy approach to optimize machines selection and\ntransportation sequence according to the characteristics of FJSPMA. Finally, a\nlarge number of experiments are carried out on the benchmarks to test the\nperformance of the algorithm. Compared with multiple advanced algorithms, the\nresults show that the HRPEO has a better advantage in solving FJSPMA.",
      "published": "2024-09-27",
      "categories": [
        "eess.SY",
        "cs.NE",
        "cs.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2409.18742v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2409.13308v1",
      "title": "A Survey of 5G-Based Positioning for Industry 4.0: State of the Art and Enhanced Techniques",
      "authors": [
        "Karthik Muthineni",
        "Alexander Artemenko",
        "Josep Vidal",
        "Montse Nájar"
      ],
      "abstract": "The fifth generation (5G) mobile communication technology integrates\ncommunication, positioning, and mapping functionalities as an in-built feature.\nThis has drawn significant attention from industries owing to the capability of\nreplacing the traditional wireless technologies used in industries with 5G\ninfrastructure that can be used for both connectivity and positioning. To this\nend, we identify the Automated Guided Vehicle (AGV) as a primary use case to\nbenefit from the 5G functionalities. Given that there have been various works\nfocusing on 5G positioning, it is necessary to analyze the existing works about\ntheir applicability with AGVs in industrial environments and provide insights\nto future research. In this paper, we present state of the art in 5G-based\npositioning, with a focus on key features, such as Millimeter Wave (mmWave)\nsystem, Massive Multiple Input Multiple Output (MIMO), Ultra-Dense Network\n(UDN), Device-to-Device (D2D) communication, and Reconfigurable Intelligent\nSurface (RIS). Moreover, we present the shortcomings in the current state of\nthe art. Additionally, we propose enhanced techniques that can complement the\naccuracy of 5G-based positioning in controlled industrial environments.",
      "published": "2024-09-20",
      "categories": [
        "eess.SP"
      ],
      "pdf_url": "http://arxiv.org/pdf/2409.13308v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2407.15177v1",
      "title": "Measurements of the Safety Function Response Time on a Private 5G and IO-Link Wireless Testbed",
      "authors": [
        "Henry Beuster",
        "Kevin Tebbe",
        "Thomas Doebbert",
        "Gerd Scholl"
      ],
      "abstract": "In the past few years, there has been a growing significance of interactions\nbetween human workers and automated systems throughout the factory floor.\nWherever static or mobile robots, such as automated guided vehicles, operate\nautonomously, a protected environment for personnel and machines must be\nprovided by, e.g., safe, deterministic and low-latency technologies. Another\ntrend in this area is the increased use of wireless communication, offering a\nhigh flexibility, modularity, and reduced installation and maintenance efforts.\nThis work presents a testbed implementation that integrates a wireless\nframework, employing IO-Link Wireless (IOLW) and a private 5G cellular network,\nto orchestrate a complete example process from sensors and actuators up into\nthe edge, represented by a programmable logic controller (PLC). Latency\nassessments identify the systems cycle time as well as opportunities for\nimprovement. A worst-case estimation shows the attainable safety function\nresponse time for practical applications in the context of functional safety.",
      "published": "2024-07-21",
      "categories": [
        "eess.SY",
        "cs.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2407.15177v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2407.06629v1",
      "title": "Collision and Obstacle Avoidance for Industrial Autonomous Vehicles -- Simulation and Experimentation Based on a Cooperative Approach",
      "authors": [
        "Juliette Grosset",
        "Alain-Jérôme Fougères",
        "M Djoko-Kouam",
        "C Couturier",
        "Jean-Marie Bonnin"
      ],
      "abstract": "One of the challenges of Industry 4.0, is to determine and optimize the flow\nof data, products and materials in manufacturing companies. To realize these\nchallenges, many solutions have been defined such as the utilization of\nautomated guided vehicles (AGVs). However, being guided is a handicap for these\nvehicles to fully meet the requirements of Industry 4.0 in terms of\nadaptability and flexibility: the autonomy of vehicles cannot be reduced to\npredetermined trajectories. Therefore, it is necessary to develop their\nautonomy. This will be possible by designing new generations of industrial\nautonomous vehicles (IAVs), in the form of intelligent and cooperative\nautonomous mobile robots.In the field of road transport, research is very\nactive to make the car autonomous. Many algorithms, solving problematic traffic\nsituations similar to those that can occur in an industrial environment, can be\ntransposed in the industrial field and therefore for IAVs. The technologies\nstandardized in dedicated bodies (e.g., ETSI TC ITS), such as those concerning\nthe exchange of messages between vehicles to increase their awareness or their\nability to cooperate, can also be transposed to the industrial context. The\ndeployment of intelligent autonomous vehicle fleets raises several challenges:\nacceptability by employees, vehicle location, traffic fluidity, vehicle\nperception of changing environments (dynamic), vehicle-infrastructure\ncooperation, or vehicles heterogeneity. In this context, developing the\nautonomy of IAVs requires a relevant working method. The identification of\nreusable or adaptable algorithms to the various problems raised by the increase\nin the autonomy of IAVs is not sufficient, it is also necessary to be able to\nmodel, to simulate, to test and to experiment with the proposed solutions.\nSimulation is essential since it allows both to adapt and to validate the\nalgorithms, but also to design and to prepare the experiments.To improve the\nautonomy of a fleet, we consider the approach relying on a collective\nintelligence to make the behaviours of vehicles adaptive. In this chapter, we\nwill focus on a class of problems faced by IAVs related to collision and\nobstacle avoidance. Among these problems, we are particularly interested when\ntwo vehicles need to cross an intersection at the same time, known as a\ndeadlock situation. But also, when obstacles are present in the aisles and need\nto be avoided by the vehicles safely.",
      "published": "2024-07-09",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2407.06629v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2406.08333v1",
      "title": "Review of Autonomous Mobile Robots for the Warehouse Environment",
      "authors": [
        "Russell Keith",
        "Hung Manh La"
      ],
      "abstract": "Autonomous mobile robots (AMRs) have been a rapidly expanding research topic\nfor the past decade. Unlike their counterpart, the automated guided vehicle\n(AGV), AMRs can make decisions and do not need any previously installed\ninfrastructure to navigate. Recent technological developments in hardware and\nsoftware have made them more feasible, especially in warehouse environments.\nTraditionally, most wasted warehouse expenses come from the logistics of moving\nmaterial from one point to another, and is exhaustive for humans to\ncontinuously walk those distances while carrying a load. Here, AMRs can help by\nworking with humans to cut down the time and effort of these repetitive tasks,\nimproving performance and reducing the fatigue of their human collaborators.\nThis literature review covers the recent developments in AMR technology\nincluding hardware, robotic control, and system control. This paper also\ndiscusses examples of current AMR producers, their robots, and the software\nthat is used to control them. We conclude with future research topics and where\nwe see AMRs developing in the warehouse environment.",
      "published": "2024-06-12",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2406.08333v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2404.12594v1",
      "title": "Random Network Distillation Based Deep Reinforcement Learning for AGV Path Planning",
      "authors": [
        "Huilin Yin",
        "Shengkai Su",
        "Yinjia Lin",
        "Pengju Zhen",
        "Karin Festl",
        "Daniel Watzenig"
      ],
      "abstract": "With the flourishing development of intelligent warehousing systems, the\ntechnology of Automated Guided Vehicle (AGV) has experienced rapid growth.\nWithin intelligent warehousing environments, AGV is required to safely and\nrapidly plan an optimal path in complex and dynamic environments. Most research\nhas studied deep reinforcement learning to address this challenge. However, in\nthe environments with sparse extrinsic rewards, these algorithms often converge\nslowly, learn inefficiently or fail to reach the target. Random Network\nDistillation (RND), as an exploration enhancement, can effectively improve the\nperformance of proximal policy optimization, especially enhancing the\nadditional intrinsic rewards of the AGV agent which is in sparse reward\nenvironments. Moreover, most of the current research continues to use 2D grid\nmazes as experimental environments. These environments have insufficient\ncomplexity and limited action sets. To solve this limitation, we present\nsimulation environments of AGV path planning with continuous actions and\npositions for AGVs, so that it can be close to realistic physical scenarios.\nBased on our experiments and comprehensive analysis of the proposed method, the\nresults demonstrate that our proposed method enables AGV to more rapidly\ncomplete path planning tasks with continuous actions in our environments. A\nvideo of part of our experiments can be found at https://youtu.be/lwrY9YesGmw.",
      "published": "2024-04-19",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.LG"
      ],
      "pdf_url": "http://arxiv.org/pdf/2404.12594v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2403.18236v4",
      "title": "Multi-AGV Path Planning Method via Reinforcement Learning and Particle Filters",
      "authors": [
        "Shao Shuo"
      ],
      "abstract": "Thanks to its robust learning and search stabilities,the reinforcement\nlearning (RL) algorithm has garnered increasingly significant attention and\nbeen exten-sively applied in Automated Guided Vehicle (AGV) path planning.\nHowever, RL-based planning algorithms have been discovered to suffer from the\nsubstantial variance of neural networks caused by environmental instability and\nsignificant fluctua-tions in system structure. These challenges manifest in\nslow convergence speed and low learning efficiency. To tackle this issue, this\npaper presents a novel multi-AGV path planning method named Particle Filters -\nDouble Deep Q-Network (PF-DDQN)via leveraging Particle Filters (PF) and RL\nalgorithm. Firstly, the proposed method leverages the imprecise weight values\nof the network as state values to formulate thestate space\nequation.Subsequently, the DDQN model is optimized to acquire the optimal true\nweight values through the iterative fusion process of neural networksand PF in\norder to enhance the optimization efficiency of the proposedmethod. Lastly, the\nperformance of the proposed method is validated by different numerical\nsimulations. The simulation results demonstrate that the proposed\nmethoddominates the traditional DDQN algorithm in terms of path planning\nsuperiority andtraining time indicator by 92.62% and 76.88%, respectively.\nTherefore, the proposedmethod could be considered as a vital alternative in the\nfield of multi-AGV path planning.",
      "published": "2024-03-27",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2403.18236v4",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2403.12376v3",
      "title": "MARPF: Multi-Agent and Multi-Rack Path Finding",
      "authors": [
        "Hiroya Makino",
        "Yoshihiro Ohama",
        "Seigo Ito"
      ],
      "abstract": "In environments where many automated guided vehicles (AGVs) operate, planning\nefficient, collision-free paths is essential. Related research has mainly\nfocused on environments with pre-defined passages, resulting in space\ninefficiency. We attempt to relax this assumption. In this study, we define\nmulti-agent and multi-rack path finding (MARPF) as the problem of planning\npaths for AGVs to convey target racks to their designated locations in\nenvironments without passages. In such environments, an AGV without a rack can\npass under racks, whereas one with a rack cannot pass under racks to avoid\ncollisions. MARPF entails conveying the target racks without collisions, while\nthe obstacle racks are relocated to prevent any interference with the target\nracks. We formulated MARPF as an integer linear programming problem in a\nnetwork flow. To distinguish situations in which an AGV is or is not loading a\nrack, the proposed method introduces two virtual layers into the network. We\noptimized the AGVs' movements to move obstacle racks and convey the target\nracks. The formulation and applicability of the algorithm were validated\nthrough numerical experiments. The results indicated that the proposed\nalgorithm addressed issues in environments with dense racks.",
      "published": "2024-03-19",
      "categories": [
        "cs.MA"
      ],
      "pdf_url": "http://arxiv.org/pdf/2403.12376v3",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2402.08979v1",
      "title": "Learning-enabled Flexible Job-shop Scheduling for Scalable Smart Manufacturing",
      "authors": [
        "Sihoon Moon",
        "Sanghoon Lee",
        "Kyung-Joon Park"
      ],
      "abstract": "In smart manufacturing systems (SMSs), flexible job-shop scheduling with\ntransportation constraints (FJSPT) is essential to optimize solutions for\nmaximizing productivity, considering production flexibility based on automated\nguided vehicles (AGVs). Recent developments in deep reinforcement learning\n(DRL)-based methods for FJSPT have encountered a scale generalization\nchallenge. These methods underperform when applied to environment at scales\ndifferent from their training set, resulting in low-quality solutions. To\naddress this, we introduce a novel graph-based DRL method, named the\nHeterogeneous Graph Scheduler (HGS). Our method leverages locally extracted\nrelational knowledge among operations, machines, and vehicle nodes for\nscheduling, with a graph-structured decision-making framework that reduces\nencoding complexity and enhances scale generalization. Our performance\nevaluation, conducted with benchmark datasets, reveals that the proposed method\noutperforms traditional dispatching rules, meta-heuristics, and existing\nDRL-based approaches in terms of makespan performance, even on large-scale\ninstances that have not been experienced during training.",
      "published": "2024-02-14",
      "categories": [
        "eess.SY",
        "cs.AI",
        "cs.LG",
        "cs.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2402.08979v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2312.16026v1",
      "title": "Dynamic AGV Task Allocation in Intelligent Warehouses",
      "authors": [
        "Arash Dehghan",
        "Mucahit Cevik",
        "Merve Bodur"
      ],
      "abstract": "This paper explores the integration of Automated Guided Vehicles (AGVs) in\nwarehouse order picking, a crucial and cost-intensive aspect of warehouse\noperations. The booming AGV industry, accelerated by the COVID-19 pandemic, is\nwitnessing widespread adoption due to its efficiency, reliability, and\ncost-effectiveness in automating warehouse tasks. This paper focuses on\nenhancing the picker-to-parts system, prevalent in small to medium-sized\nwarehouses, through the strategic use of AGVs. We discuss the benefits and\napplications of AGVs in various warehouse tasks, highlighting their\ntransformative potential in improving operational efficiency. We examine the\ndeployment of AGVs by leading companies in the industry, showcasing their\nvaried functionalities in warehouse management. Addressing the gap in research\non optimizing operational performance in hybrid environments where humans and\nAGVs coexist, our study delves into a dynamic picker-to-parts warehouse\nscenario. We propose a novel approach Neural Approximate Dynamic Programming\napproach for coordinating a mixed team of human and AGV workers, aiming to\nmaximize order throughput and operational efficiency. This involves innovative\nsolutions for non-myopic decision making, order batching, and battery\nmanagement. We also discuss the integration of advanced robotics technology in\nautomating the complete order-picking process. Through a comprehensive\nnumerical study, our work offers valuable insights for managing a heterogeneous\nworkforce in a hybrid warehouse setting, contributing significantly to the\nfield of warehouse automation and logistics.",
      "published": "2023-12-26",
      "categories": [
        "math.OC",
        "cs.AI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2312.16026v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2312.04190v1",
      "title": "Receding Horizon Re-ordering of Multi-Agent Execution Schedules",
      "authors": [
        "Alexander Berndt",
        "Niels van Duijkeren",
        "Luigi Palmieri",
        "Alexander Kleiner",
        "Tamás Keviczky"
      ],
      "abstract": "The trajectory planning for a fleet of Automated Guided Vehicles (AGVs) on a\nroadmap is commonly referred to as the Multi-Agent Path Finding (MAPF) problem,\nthe solution to which dictates each AGV's spatial and temporal location until\nit reaches it's goal without collision. When executing MAPF plans in dynamic\nworkspaces, AGVs can be frequently delayed, e.g., due to encounters with humans\nor third-party vehicles. If the remainder of the AGVs keeps following their\nindividual plans, synchrony of the fleet is lost and some AGVs may pass through\nroadmap intersections in a different order than originally planned. Although\nthis could reduce the cumulative route completion time of the AGVs, generally,\na change in the original ordering can cause conflicts such as deadlocks. In\npractice, synchrony is therefore often enforced by using a MAPF execution\npolicy employing, e.g., an Action Dependency Graph (ADG) to maintain ordering.\nTo safely re-order without introducing deadlocks, we present the concept of the\nSwitchable Action Dependency Graph (SADG). Using the SADG, we formulate a\ncomparatively low-dimensional Mixed-Integer Linear Program (MILP) that\nrepeatedly re-orders AGVs in a recursively feasible manner, thus maintaining\ndeadlock-free guarantees, while dynamically minimizing the cumulative route\ncompletion time of all AGVs. Various simulations validate the efficiency of our\napproach when compared to the original ADG method as well as robust MAPF\nsolution approaches.",
      "published": "2023-12-07",
      "categories": [
        "cs.RO",
        "cs.SY",
        "eess.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2312.04190v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2311.14615v1",
      "title": "An Industrial Perspective on Multi-Agent Decision Making for Interoperable Robot Navigation following the VDA5050 Standard",
      "authors": [
        "Niels van Duijkeren",
        "Luigi Palmieri",
        "Ralph Lange",
        "Alexander Kleiner"
      ],
      "abstract": "This paper provides a perspective on the literature and current challenges in\nMulti-Agent Systems for interoperable robot navigation in industry. The focus\nis on the multi-agent decision stack for Autonomous Mobile Robots operating in\nmixed environments with humans, manually driven vehicles, and legacy Automated\nGuided Vehicles. We provide typical characteristics of such Multi-Agent Systems\nobserved today and how these are expected to change on the short term due to\nthe new standard VDA5050 and the interoperability framework OpenRMF. We present\nrecent changes in fleet management standards and the role of open middleware\nframeworks like ROS2 reaching industrial-grade quality. Approaches to increase\nthe robustness and performance of multi-robot navigation systems for\ntransportation are discussed, and research opportunities are derived.",
      "published": "2023-11-24",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2311.14615v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2311.04011v1",
      "title": "Coverage Hole Elimination System in Industrial Environment",
      "authors": [
        "Mervat Zarour",
        "Shreya Tayade",
        "Sergiy Melnyk",
        "Hans D. Schotten"
      ],
      "abstract": "The paper proposes a framework to identify and avoid the coverage hole in an\nindoor industry environment. We assume an edge cloud co-located controller that\nfollowers the Automated Guided Vehicle (AGV) movement on a factory floor over a\nwireless channel. The coverage holes are caused due to blockage, path-loss, and\nfading effects. An AGV in the coverage hole may lose connectivity to the\nedge-cloud and become unstable. To avoid connectivity loss, we proposed a\nframework that identifies the position of coverage hole using a Support- Vector\nMachine (SVM) classifier model and constructs a binary coverage hole map\nincorporating the AGV trajectory re-planning to avoid the identified coverage\nhole. The AGV's re-planned trajectory is optimized and selected to avoid\ncoverage hole the shortest coverage-hole-free trajectory. We further\ninvestigated the look-ahead time's impact on the AGV's re-planned trajectory\nperformance. The results reveal that an AGV's re-planned trajectory can be\nshorter and further optimized if the coverage hole position is known ahead of\ntime",
      "published": "2023-11-07",
      "categories": [
        "cs.NI",
        "eess.SP"
      ],
      "pdf_url": "http://arxiv.org/pdf/2311.04011v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2310.15560v1",
      "title": "Modeling and Design of the Communication Sensing and Control Coupled Closed-Loop Industrial System",
      "authors": [
        "Zeyang Meng",
        "Dingyou Ma",
        "Shengfeng Wang",
        "Zhiqing Wei",
        "Zhiyong Feng"
      ],
      "abstract": "With the advent of 5G era, factories are transitioning towards wireless\nnetworks to break free from the limitations of wired networks. In 5G-enabled\nfactories, unmanned automatic devices such as automated guided vehicles and\nrobotic arms complete production tasks cooperatively through the periodic\ncontrol loops. In such loops, the sensing data is generated by sensors, and\ntransmitted to the control center through uplink wireless communications. The\ncorresponding control commands are generated and sent back to the devices\nthrough downlink wireless communications. Since wireless communications,\nsensing and control are tightly coupled, there are big challenges on the\nmodeling and design of such closed-loop systems. In particular, existing\ntheoretical tools of these functionalities have different modelings and\nunderlying assumptions, which make it difficult for them to collaborate with\neach other. Therefore, in this paper, an analytical closed-loop model is\nproposed, where the performances and resources of communication, sensing and\ncontrol are deeply related. To achieve the optimal control performance, a\nco-design of communication resource allocation and control method is proposed,\ninspired by the model predictive control algorithm. Numerical results are\nprovided to demonstrate the relationships between the resources and control\nperformances.",
      "published": "2023-10-24",
      "categories": [
        "cs.PF",
        "93C55, 94A99",
        "C.4"
      ],
      "pdf_url": "http://arxiv.org/pdf/2310.15560v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2310.03470v1",
      "title": "Cyber Physical System Information Collection: Robot Location and Navigation Method Based on QR Code",
      "authors": [
        "Hongwei Li",
        "Tao Xiong"
      ],
      "abstract": "In this paper, we propose a method to estimate the exact location of a camera\nin a cyber-physical system using the exact geographic coordinates of four\nfeature points stored in QR codes(Quick response codes) and the pixel\ncoordinates of four feature points analyzed from the QR code images taken by\nthe camera. Firstly, the P4P(Perspective 4 Points) algorithm is designed to\nuniquely determine the initial pose estimation value of the QR coordinate\nsystem relative to the camera coordinate system by using the four feature\npoints of the selected QR code. In the second step, the manifold gradient\noptimization algorithm is designed. The rotation matrix and displacement vector\nare taken as the initial values of iteration, and the iterative optimization is\ncarried out to improve the positioning accuracy and obtain the rotation matrix\nand displacement vector with higher accuracy. The third step is to convert the\npose of the QR coordinate system with respect to the camera coordinate system\nto the pose of the AGV(Automated Guided Vehicle) with respect to the world\ncoordinate system. Finally, the performance of manifold gradient optimization\nalgorithm and P4P analytical algorithm are simulated and compared under the\nsame conditions.One can see that the performance of the manifold gradient\noptimization algorithm proposed in this paper is much better than that of the\nP4P analytic algorithm when the signal-to-noise ratio is small.With the\nincrease of the signal-to-noise ratio,the performance of the P4P analytic\nalgorithm approaches that of the manifold gradient optimization algorithm.when\nthe noise is same,the performance of manifold gradient optimization algorithm\nis better when there are more feature points.",
      "published": "2023-10-05",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2310.03470v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2310.02195v3",
      "title": "Efficient Online Scheduling and Routing for Automated Guided Vehicles In Loop-Based Graphs",
      "authors": [
        "Louis Stubbe",
        "Jens Goemaere",
        "Jan Goedgebeur"
      ],
      "abstract": "Automated guided vehicles (AGVs) are widely used in various industries, and\nscheduling and routing them in a conflict-free manner is crucial to their\nefficient operation. We propose a loop-based algorithm that solves the online,\nconflict-free scheduling and routing problem for AGVs with any capacity and\nordered jobs in loop-based graphs. The proposed algorithm is compared against\nan exact method, a greedy heuristic and a metaheuristic. We experimentally\nshow, using theoretical and real instances on a model representing a real\nmanufacturing plant, that this algorithm either outperforms the other\nalgorithms or gets an equally good solution in less computing time.",
      "published": "2023-10-03",
      "categories": [
        "cs.CE",
        "cs.AI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2310.02195v3",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2310.01594v2",
      "title": "Data Transmissions in Blockchain enabled AGVs",
      "authors": [
        "Junhan Liu",
        "Shile Liu",
        "Chenming Xu",
        "Yuchen Yan"
      ],
      "abstract": "Automated Guided Vehicles (AGVs) operate in synergy to execute specific\ntasks. These vehicles exchange information to ensure seamless collaboration,\nprevent collisions, and eliminate task redundancy. The advent of blockchain\ntechnology offers a promising avenue for establishing a secure and dependable\ncommunication infrastructure for AGVs. Nonetheless, it becomes imperative for\nAGVs to adopt efficient data transmission methodologies, especially when\ninteracting with the dynamic nature of blockchain infrastructure where data\nundergoes frequent modifications.\n  In the present study, we introduce a novel data transmission methodology\ntailored for blockchain-integrated AGVs utilizing the principles of Named Data\nNetworking (NDN). A simulated environment was crafted and executed in NetSim,\nwherein multiple AGVs collaboratively endeavored to locate concealed objectives\nwithin a defined region. Upon discovery of novel elements, such as obstructions\nor concealed objectives, each AGV would update a collective blockchain\nrepository. This blockchain infrastructure leverages NDN to fetch specific data\nblocks in response to data queries from individual AGVs. This system ensures\nthat AGVs can navigate and scrutinize their environment with heightened\nefficiency, drawing upon the collective intelligence and shared experiences of\nthe fleet.",
      "published": "2023-10-02",
      "categories": [
        "cs.DC"
      ],
      "pdf_url": "http://arxiv.org/pdf/2310.01594v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2309.07979v2",
      "title": "Fast Safe Rectangular Corridor-based Online AGV Trajectory Optimization with Obstacle Avoidance",
      "authors": [
        "Shaoqiang Liang",
        "Songyuan Fa",
        "Yiqun Li"
      ],
      "abstract": "Automated Guided Vehicles (AGVs) are essential in various industries for\ntheir efficiency and adaptability. However, planning trajectories for AGVs in\nobstacle-dense, unstructured environments presents significant challenges due\nto the nonholonomic kinematics, abundant obstacles, and the scenario's\nnonconvex and constrained nature. To address this, we propose an efficient\ntrajectory planning framework for AGVs by formulating the problem as an optimal\ncontrol problem. Our framework utilizes the fast safe rectangular corridor\n(FSRC) algorithm to construct rectangular convex corridors, representing\navoidance constraints as box constraints. This eliminates redundant obstacle\ninfluences and accelerates the solution speed. Additionally, we employ the\nModified Visibility Graph algorithm to speed up path planning and a boundary\ndiscretization strategy to expedite FSRC construction. Experimental results\ndemonstrate the effectiveness and superiority of our framework, particularly in\ncomputational efficiency. Compared to advanced frameworks, our framework\nachieves computational efficiency gains of 1 to 2 orders of magnitude. Notably,\nFSRC significantly outperforms other safe convex corridor-based methods\nregarding computational efficiency.",
      "published": "2023-09-14",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2309.07979v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2309.02949v1",
      "title": "Evaluation of NR-Sidelink for Cooperative Industrial AGVs",
      "authors": [
        "Shubhangi Bhadauria",
        "Klea Plaku",
        "Yash Deshpande",
        "Wolfgang Kellerer"
      ],
      "abstract": "Industry 4.0 has brought to attention the need for a connected, flexible, and\nautonomous production environment. The New Radio (NR)-sidelink, which was\nintroduced by the third-generation partnership project (3GPP) in Release 16,\ncan be particularly helpful for factories that need to facilitate cooperative\nand close-range communication. Automated Guided Vehicles (AGVs) are important\nfor material handling and carriage within these environments, and using\nNR-sidelink communication can further enhance their performance. An efficient\nresource allocation mechanism is required to ensure reliable communication and\navoid interference between AGVs and other wireless systems in the factory using\nNR-sidelink. This work evaluates the 3GPP standardized resource allocation\nalgorithm for NR-sidelink for a use case of cooperative carrying AGVs. We\nsuggest further improvements that are tailored to the quality of service (QoS)\nrequirements of an indoor factory communication scenario with cooperative\nAGVs.The use of NR-sidelink communication has the potential to help meet the\nQoS requirements for different Industry 4.0 use cases. This work can be a\nfoundation for further improvements in NR-sidelink in 3GPP Release 18 and\nbeyond.",
      "published": "2023-09-06",
      "categories": [
        "cs.NI",
        "cs.ET"
      ],
      "pdf_url": "http://arxiv.org/pdf/2309.02949v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2307.04632v2",
      "title": "An End-To-End Analysis of Deep Learning-Based Remaining Useful Life Algorithms for Satefy-Critical 5G-Enabled IIoT Networks",
      "authors": [
        "Lorenzo Mario Amorosa",
        "Nicolò Longhi",
        "Giampaolo Cuozzo",
        "Weronika Maria Bachan",
        "Valerio Lieti",
        "Enrico Buracchini",
        "Roberto Verdone"
      ],
      "abstract": "Remaining Useful Life (RUL) prediction is a critical task that aims to\nestimate the amount of time until a system fails, where the latter is formed by\nthree main components, that is, the application, communication network, and RUL\nlogic. In this paper, we provide an end-to-end analysis of an entire RUL-based\nchain. Specifically, we consider a factory floor where Automated Guided\nVehicles (AGVs) transport dangerous liquids whose fall may cause injuries to\nworkers. Regarding the communication infrastructure, the AGVs are equipped with\n5G User Equipments (UEs) that collect real-time data of their movements and\nsend them to an application server. The RUL logic consists of a Deep Learning\n(DL)-based pipeline that assesses if there will be liquid falls by analyzing\nthe collected data, and, eventually, sending commands to the AGVs to avoid such\na danger. According to this scenario, we performed End-to-End 5G NR-compliant\nnetwork simulations to study the Round-Trip Time (RTT) as a function of the\noverall system bandwidth, subcarrier spacing, and modulation order. Then, via\nreal-world experiments, we collect data to train, test and compare 7 DL models\nand 1 baseline threshold-based algorithm in terms of cost and average advance.\nFinally, we assess whether or not the RTT provided by four different 5G NR\nnetwork architectures is compatible with the average advance provided by the\nbest-performing one-Dimensional Convolutional Neural Network (1D-CNN).\nNumerical results show under which conditions the DL-based approach for RUL\nestimation matches with the RTT performance provided by different 5G NR network\narchitectures.",
      "published": "2023-07-10",
      "categories": [
        "cs.NI",
        "eess.SP"
      ],
      "pdf_url": "http://arxiv.org/pdf/2307.04632v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2305.13824v1",
      "title": "Constrained Reinforcement Learning for Dynamic Material Handling",
      "authors": [
        "Chengpeng Hu",
        "Ziming Wang",
        "Jialin Liu",
        "Junyi Wen",
        "Bifei Mao",
        "Xin Yao"
      ],
      "abstract": "As one of the core parts of flexible manufacturing systems, material handling\ninvolves storage and transportation of materials between workstations with\nautomated vehicles. The improvement in material handling can impulse the\noverall efficiency of the manufacturing system. However, the occurrence of\ndynamic events during the optimisation of task arrangements poses a challenge\nthat requires adaptability and effectiveness. In this paper, we aim at the\nscheduling of automated guided vehicles for dynamic material handling.\nMotivated by some real-world scenarios, unknown new tasks and unexpected\nvehicle breakdowns are regarded as dynamic events in our problem. We formulate\nthe problem as a constrained Markov decision process which takes into account\ntardiness and available vehicles as cumulative and instantaneous constraints,\nrespectively. An adaptive constrained reinforcement learning algorithm that\ncombines Lagrangian relaxation and invalid action masking, named RCPOM, is\nproposed to address the problem with two hybrid constraints. Moreover, a\ngym-like dynamic material handling simulator, named DMH-GYM, is developed and\nequipped with diverse problem instances, which can be used as benchmarks for\ndynamic material handling. Experimental results on the problem instances\ndemonstrate the outstanding performance of our proposed approach compared with\neight state-of-the-art constrained and non-constrained reinforcement learning\nalgorithms, and widely used dispatching rules for material handling.",
      "published": "2023-05-23",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2305.13824v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2305.09788v1",
      "title": "Codesign of Edge Intelligence and Automated Guided Vehicle Control",
      "authors": [
        "Malith Gallage",
        "Rafaela Scaciota",
        "Sumudu Samarakoon",
        "Mehdi Bennis"
      ],
      "abstract": "This work presents a harmonic design of autonomous guided vehicle (AGV)\ncontrol, edge intelligence, and human input to enable autonomous transportation\nin industrial environments. The AGV has the capability to navigate between a\nsource and destinations and pick/place objects. The human input implicitly\nprovides preferences of the destination and exact drop point, which are derived\nfrom an artificial intelligence (AI) module at the network edge and shared with\nthe AGV over a wireless network. The demonstration indicates that the proposed\nintegrated design of hardware, software, and AI design achieve a technology\nreadiness level (TRL) of range 4-5",
      "published": "2023-05-03",
      "categories": [
        "cs.CV",
        "cs.AI",
        "cs.LG",
        "cs.RO",
        "eess.IV"
      ],
      "pdf_url": "http://arxiv.org/pdf/2305.09788v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2303.00745v1",
      "title": "Coordination of Multiple Robots along Given Paths with Bounded Junction Complexity",
      "authors": [
        "Mikkel Abrahamsen",
        "Tzvika Geft",
        "Dan Halperin",
        "Barak Ugav"
      ],
      "abstract": "We study a fundamental NP-hard motion coordination problem for\nmulti-robot/multi-agent systems: We are given a graph $G$ and set of agents,\nwhere each agent has a given directed path in $G$. Each agent is initially\nlocated on the first vertex of its path. At each time step an agent can move to\nthe next vertex on its path, provided that the vertex is not occupied by\nanother agent. The goal is to find a sequence of such moves along the given\npaths so that each reaches its target, or to report that no such sequence\nexists. The problem models guidepath-based transport systems, which is a\npertinent abstraction for traffic in a variety of contemporary applications,\nranging from train networks or Automated Guided Vehicles (AGVs) in factories,\nthrough computer game animations, to qubit transport in quantum computing. It\nalso arises as a sub-problem in the more general multi-robot motion-planning\nproblem.\n  We provide a fine-grained tractability analysis of the problem by considering\nnew assumptions and identifying minimal values of key parameters for which the\nproblem remains NP-hard. Our analysis identifies a critical parameter called\nvertex multiplicity (VM), defined as the maximum number of paths passing\nthrough the same vertex. We show that a prevalent variant of the problem, which\nis equivalent to Sequential Resource Allocation (concerning deadlock prevention\nfor concurrent processes), is NP-hard even when VM is 3. On the positive side,\nfor VM $\\le$ 2 we give an efficient algorithm that iteratively resolves cycles\nof blocking relations among agents. We also present a variant that is NP-hard\nwhen the VM is 2 even when $G$ is a 2D grid and each path lies in a single grid\nrow or column. By studying highly distilled yet NP-hard variants, we deepen the\nunderstanding of what makes the problem intractable and thereby guide the\nsearch for efficient solutions under practical assumptions.",
      "published": "2023-03-01",
      "categories": [
        "cs.RO",
        "cs.CG",
        "cs.DS",
        "cs.MA"
      ],
      "pdf_url": "http://arxiv.org/pdf/2303.00745v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2302.12142v1",
      "title": "142 GHz Multipath Propagation Measurements and Path Loss Channel Modeling in Factory Buildings",
      "authors": [
        "Shihao Ju",
        "Theodore S. Rappaport"
      ],
      "abstract": "This paper presents sub-Terahertz (THz) radio propagation measurements at 142\nGHz conducted in four factories with various layouts and facilities to explore\nsub-THz wireless channels for smart factories in 6G and beyond. Here we study\nspatial and temporal channel responses at 82 transmitter-receiver (TX-RX)\nlocations across four factories in the New York City area and over distances\nfrom 5 m to 85 m in both line-of-sight (LOS) and non-LOS (NLOS) environments.\nThe measurements were performed with a sliding-correlation-based channel\nsounder with 1 GHz RF bandwidth with steerable directional horn antennas with\n27 dBi gain and 8\\degree~half-power beamwidth at both TX and RX, using both\nvertical and horizontal antenna polarizations, yielding over 75,000 directional\npower delay profiles. Channel measurements of two RX heights at 1.5 m (high)\nemulating handheld devices and at 0.5 m (low) emulating automated guided\nvehicles (AGVs) were conducted for automated industrial scenarios with various\nclutter densities. Results yield the first path loss models for indoor factory\n(InF) environments at 142 GHz and show the low RX height experiences a mean\npath loss increase of 10.7 dB and 6.0 dB when compared with the high RX height\nat LOS and NLOS locations, respectively. Furthermore, flat and rotatable metal\nplates were leveraged as passive reflecting surfaces (PRSs) in channel\nenhancement measurements to explore the potential power gain on sub-THz\npropagation channels, demonstrating a range from 0.5 to 22 dB improvement with\na mean of 6.5 dB in omnidirectional channel gain as compared to when no PRSs\nare present.",
      "published": "2023-02-23",
      "categories": [
        "cs.IT",
        "eess.SP",
        "math.IT"
      ],
      "pdf_url": "http://arxiv.org/pdf/2302.12142v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2301.09388v1",
      "title": "Resource Allocation with Stability Constraints of an Edge-cloud controlled AGV",
      "authors": [
        "Shreya Tayade",
        "Peter Rost",
        "Andreas Maeder",
        "Hans Schotten"
      ],
      "abstract": "The paper proposes Resource Allocation (RA) schemes for a closed loop\nfeedback control system by analysing the control-communication dependencies. We\nconsider an Automated Guided Vehicle (AGV) that communicates with a controller\nlocated in an edge-cloud over a wireless fading channel. The control commands\nare transmitted to an AGV and the position state is feedback to the controller\nat every time-instant. A control stability based scheduling metric 'Probability\nof Instability' is evaluated for the resource allocation. The performance of\nstability based RA scheme is compared with the maximum SNR based RA scheme and\ncontrol error first approach in an overloaded and non-overloaded scenario. The\nRA scheme with the stability constraints significantly reduces the resource\nutilization and is able to schedule more number of AGVs while maintaining its\nstability. Moreover, the proposed RA scheme is independent of control state and\ndepends upon consecutive packet errors, the control parameters like sampling\ntime and AGV velocity. Furthermore, we also analyse the impact of RA schemes on\nthe AGV's stability and error performance, and evaluated the number of unstable\nAGVs.",
      "published": "2023-01-23",
      "categories": [
        "eess.SY",
        "cs.RO",
        "cs.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2301.09388v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2301.03364v5",
      "title": "Toward an AI-enabled Connected Industry: AGV Communication and Sensor Measurement Datasets",
      "authors": [
        "Rodrigo Hernangómez",
        "Alexandros Palaios",
        "Cara Watermann",
        "Daniel Schäufele",
        "Philipp Geuer",
        "Rafail Ismayilov",
        "Mohammad Parvini",
        "Anton Krause",
        "Martin Kasparick",
        "Thomas Neugebauer",
        "Oscar D. Ramos-Cantor",
        "Hugues Tchouankem",
        "Jose Leon Calvo",
        "Bo Chen",
        "Gerhard Fettweis",
        "Sławomir Stańczak"
      ],
      "abstract": "This paper presents two wireless measurement campaigns in industrial\ntestbeds: industrial Vehicle-to-vehicle (iV2V) and industrial\nVehicle-to-infrastructure plus Sensor (iV2I+), together with detailed\ninformation about the two captured datasets. iV2V covers sidelink communication\nscenarios between Automated Guided Vehicles (AGVs), while iV2I+ is conducted at\nan industrial setting where an autonomous cleaning robot is connected to a\nprivate cellular network. The combination of different communication\ntechnologies within a common measurement methodology provides insights that can\nbe exploited by Machine Learning (ML) for tasks such as fingerprinting,\nline-of-sight detection, prediction of quality of service or link selection.\nMoreover, the datasets are publicly available, labelled and prefiltered for\nfast on-boarding and applicability.",
      "published": "2022-12-20",
      "categories": [
        "cs.NI",
        "cs.AI",
        "cs.LG"
      ],
      "pdf_url": "http://arxiv.org/pdf/2301.03364v5",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2211.05297v1",
      "title": "Coordinating CAV Swarms at Intersections with a Deep Learning Model",
      "authors": [
        "Jiawei Zhang",
        "Shen Li",
        "Li Li"
      ],
      "abstract": "Connected and automated vehicles (CAVs) are viewed as a special kind of\nrobots that have the potential to significantly improve the safety and\nefficiency of traffic. In contrast to many swarm robotics studies that are\ndemonstrated in labs by employing a small number of robots, CAV studies aims to\nachieve cooperative driving of unceasing robot swarm flows. However, how to get\nthe optimal passing order of such robot swarm flows even for a signal-free\nintersection is an NP-hard problem (specifically, enumerating based algorithm\ntakes days to find the optimal solution to a 20-CAV scenario). Here, we\nintroduce a novel cooperative driving algorithm (AlphaOrder) that combines\noffline deep learning and online tree searching to find a near-optimal passing\norder in real-time. AlphaOrder builds a pointer network model from solved\nscenarios and generates near-optimal passing orders instantaneously for new\nscenarios. Furthermore, our approach provides a general approach to managing\npreemptive resource sharing between swarm robotics (e.g., scheduling multiple\nautomated guided vehicles (AGVs) and unmanned aerial vehicles (UAVs) at\nconflicting areas",
      "published": "2022-11-10",
      "categories": [
        "cs.RO",
        "cs.AI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2211.05297v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2209.09793v1",
      "title": "Recovering feasibility in real-time conflict-free vehicle routing",
      "authors": [
        "Tommaso Adamo",
        "Gianpaolo Ghiani",
        "Emanuela Guerriero"
      ],
      "abstract": "Conflict-Free Vehicle Routing Problems (CF-VRPs) arise in manufacturing,\ntransportation and logistics facilities where Automated Guided Vehicles (AGVs)\nare utilized to move loads. Unlike \\textit{Vehicle Routing Problems} arising in\ndistribution management, CF-VRPs explicitly consider the limited capacity of\nthe arcs of the guide path network to avoid collisions among vehicles. AGV\napplications have two peculiar features. First, the uncertainty affecting both\ntravel times and machine ready times may result in vehicle delays or\nanticipations with respect to the fleet nominal plan. Second, the relatively\nhigh vehicle speed (in the order of one or two meters per second) requires\nvehicle plans to be revised in a very short amount of time (usually few\nmilliseconds) in order to avoid collisions. In this paper we present fast exact\nalgorithms to recover plan feasibility in real-time. In particular, we identify\ntwo corrective actions that can be implemented in real-time and formulate the\nproblem as a linear program with the aim to optimize four common performance\nmeasures (total vehicle delay, total weighted delay, maximum route duration and\ntotal lateness). Moreover, we develop tailored algorithms which, tested on\nrandomly generated instances of various sizes, prove to be three orders of\nmagnitude faster than using off-the-shelf solvers.",
      "published": "2022-09-20",
      "categories": [
        "math.OC"
      ],
      "pdf_url": "http://arxiv.org/pdf/2209.09793v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2205.03294v1",
      "title": "Vehicle management in a modular production context using Deep Q-Learning",
      "authors": [
        "Lucain Pouget",
        "Timo Hasenbichler",
        "Jakob Auer",
        "Klaus Lichtenegger",
        "Andreas Windisch"
      ],
      "abstract": "We investigate the feasibility of deploying Deep-Q based deep reinforcement\nlearning agents to job-shop scheduling problems in the context of modular\nproduction facilities, using discrete event simulations for the environment.\nThese environments are comprised of a source and sink for the parts to be\nprocessed, as well as (several) workstations. The agents are trained to\nschedule automated guided vehicles to transport the parts back and forth\nbetween those stations in an optimal fashion. Starting from a very simplistic\nsetup, we increase the complexity of the environment and compare the agents'\nperformances with well established heuristic approaches, such as\nfirst-in-first-out based agents, cost tables and a nearest-neighbor approach.\nWe furthermore seek particular configurations of the environments in which the\nheuristic approaches struggle, to investigate to what degree the Deep-Q agents\nare affected by these challenges. We find that Deep-Q based agents show\ncomparable performance as the heuristic baselines. Furthermore, our findings\nsuggest that the DRL agents exhibit an increased robustness to noise, as\ncompared to the conventional approaches. Overall, we find that DRL agents\nconstitute a valuable approach for this type of scheduling problems.",
      "published": "2022-05-06",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2205.03294v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2204.11789v1",
      "title": "Travel time optimization on multi-AGV routing by reverse annealing",
      "authors": [
        "Renichiro Haba",
        "Masayuki Ohzeki",
        "Kazuyuki Tanaka"
      ],
      "abstract": "Quantum annealing has been actively researched since D-Wave Systems produced\nthe first commercial machine in 2011. Controlling a large fleet of automated\nguided vehicles is one of the real-world applications utilizing quantum\nannealing. In this study, we propose a formulation to control the traveling\nroutes to minimize the travel time. We validate our formulation through\nsimulation in a virtual plant and authenticate the effectiveness for faster\ndistribution compared to a greedy algorithm that does not consider the overall\ndetour distance. Furthermore, we utilize reverse annealing to maximize the\nadvantage of the D-Wave's quantum annealer. Starting from relatively good\nsolutions obtained by a fast greedy algorithm, reverse annealing searches for\nbetter solutions around them. Our reverse annealing method improves the\nperformance compared to standard quantum annealing alone and performs up to 10\ntimes faster than the strong classical solver, Gurobi. This study extends a use\nof optimization with general problem solvers in the application of multi-AGV\nsystems and reveals the potential of reverse annealing as an optimizer.",
      "published": "2022-04-25",
      "categories": [
        "quant-ph",
        "cs.MA",
        "cs.RO",
        "cs.SY",
        "eess.SY",
        "stat.CO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2204.11789v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2202.11512v2",
      "title": "Using Deep Reinforcement Learning with Automatic Curriculum Learning for Mapless Navigation in Intralogistics",
      "authors": [
        "Honghu Xue",
        "Benedikt Hein",
        "Mohamed Bakr",
        "Georg Schildbach",
        "Bengt Abel",
        "Elmar Rueckert"
      ],
      "abstract": "We propose a deep reinforcement learning approach for solving a mapless\nnavigation problem in warehouse scenarios. In our approach, an automation\nguided vehicle is equipped with LiDAR and frontal RGB sensors and learns to\nperform a targeted navigation task. The challenges reside in the sparseness of\npositive samples for learning, multi-modal sensor perception with partial\nobservability, the demand for accurate steering maneuvers together with long\ntraining cycles. To address these points, we propose NavACL-Q as a method for\nautomatic curriculum learning in combination with a distributed version of the\nsoft actor-critic algorithm. The performance of the learning algorithm is\nevaluated exhaustively in an unseen warehouse environment to validate both\nrobustness and generalizability of the learned policy. Results in NVIDIA Isaac\nSim demonstrates that our trained agent significantly outperforms a map-based\nnavigation pipeline provided by NVIDIA Isaac Sim with an increased agent-goal\ndistance of 3m and wider initial relative agent-goal rotations of 45 degree.\nThe ablation studies also suggests that NavACL-Q greatly facilitates the\nlearning process with a performance gain of roughly 40% compared to training\nwith random starts and that the utilization of a pre-trained feature extractor\nmanifestly boosts the performance by approximately 60%.",
      "published": "2022-02-23",
      "categories": [
        "cs.RO",
        "cs.LG"
      ],
      "pdf_url": "http://arxiv.org/pdf/2202.11512v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2112.01367v1",
      "title": "Digital Twin-Assisted Controlling of AGVs in Flexible Manufacturing Environments",
      "authors": [
        "Mohammad Azangoo",
        "Amir Taherkordi",
        "Jan Olaf Blech",
        "Valeriy Vyatkin"
      ],
      "abstract": "Digital Twins are increasingly being introduced for smart manufacturing\nsystems to improve the efficiency of the main disciplines of such systems.\nFormal techniques, such as graphs, are a common way of describing Digital Twin\nmodels, allowing broad types of tools to provide Digital Twin based services\nsuch as fault detection in production lines. Obtaining correct and complete\nformal Digital Twins of physical systems can be a complicated and time\nconsuming process, particularly for manufacturing systems with plenty of\nphysical objects and the associated manufacturing processes. Automatic\ngeneration of Digital Twins is an emerging research field and can reduce time\nand costs. In this paper, we focus on the generation of Digital Twins for\nflexible manufacturing systems with Automated Guided Vehicles (AGVs) on the\nfactory floor. In particular, we propose an architectural framework and the\nassociated design choices and software development tools that facilitate\nautomatic generation of Digital Twins for AGVs. Specifically, the scope of the\ngenerated digital twins is controlling AGVs in the factory floor. To this end,\nwe focus on different control levels of AGVs and utilize graph theory to\ngenerate the graph-based Digital Twin of the factory floor.",
      "published": "2021-11-05",
      "categories": [
        "cs.RO",
        "cs.SE"
      ],
      "pdf_url": "http://arxiv.org/pdf/2112.01367v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2110.01686v2",
      "title": "Learning, Computing, and Trustworthiness in Intelligent IoT Environments: Performance-Energy Tradeoffs",
      "authors": [
        "Beatriz Soret",
        "Lam D. Nguyen",
        "Jan Seeger",
        "Arne Bröring",
        "Chaouki Ben Issaid",
        "Sumudu Samarakoon",
        "Anis El Gabli",
        "Vivek Kulkarni",
        "Mehdi Bennis",
        "Petar Popovski"
      ],
      "abstract": "An Intelligent IoT Environment (iIoTe) is comprised of heterogeneous devices\nthat can collaboratively execute semi-autonomous IoT applications, examples of\nwhich include highly automated manufacturing cells or autonomously interacting\nharvesting machines. Energy efficiency is key in such edge environments, since\nthey are often based on an infrastructure that consists of wireless and\nbattery-run devices, e.g., e-tractors, drones, Automated Guided Vehicle (AGV)s\nand robots. The total energy consumption draws contributions from multipleiIoTe\ntechnologies that enable edge computing and communication, distributed\nlearning, as well as distributed ledgers and smart contracts. This paper\nprovides a state-of-the-art overview of these technologies and illustrates\ntheir functionality and performance, with special attention to the tradeoff\namong resources, latency, privacy and energy consumption. Finally, the paper\nprovides a vision for integrating these enabling technologies in\nenergy-efficient iIoTe and a roadmap to address the open research challenges",
      "published": "2021-10-04",
      "categories": [
        "cs.DC",
        "cs.AI",
        "cs.NI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2110.01686v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2109.12386v1",
      "title": "A Multi-Agent System for Autonomous Mobile Robot Coordination",
      "authors": [
        "Norberto Sousa",
        "Nuno Oliveira",
        "Isabel Praça"
      ],
      "abstract": "The automation of internal logistics and inventory-related tasks is one of\nthe main challenges of modern-day manufacturing corporations since it allows a\nmore effective application of their human resources. Nowadays, Autonomous\nMobile Robots (AMR) are state of the art technologies for such applications due\nto their great adaptability in dynamic environments, replacing more traditional\nsolutions such as Automated Guided Vehicles (AGV), which are quite limited in\nterms of flexibility and require expensive facility updates for their\ninstallation. The application of Artificial Intelligence (AI) to increase AMRs\ncapabilities has been contributing for the development of more sophisticated\nand efficient robots. Nevertheless, multi-robot coordination and cooperation\nfor solving complex tasks is still a hot research line with increasing\ninterest. This work proposes a Multi-Agent System for coordinating multiple\nTIAGo robots in tasks related to the manufacturing ecosystem such as the\ntransportation and dispatching of raw materials, finished products and tools.\nFurthermore, the system is showcased in a realistic simulation using both\nGazebo and Robot Operating System (ROS).",
      "published": "2021-09-25",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2109.12386v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2108.06886v1",
      "title": "Decentralized Multi-AGV Task Allocation based on Multi-Agent Reinforcement Learning with Information Potential Field Rewards",
      "authors": [
        "Mengyuan Li",
        "Bin Guo",
        "Jiangshan Zhang",
        "Jiaqi Liu",
        "Sicong Liu",
        "Zhiwen Yu",
        "Zhetao Li",
        "Liyao Xiang"
      ],
      "abstract": "Automated Guided Vehicles (AGVs) have been widely used for material handling\nin flexible shop floors. Each product requires various raw materials to\ncomplete the assembly in production process. AGVs are used to realize the\nautomatic handling of raw materials in different locations. Efficient AGVs task\nallocation strategy can reduce transportation costs and improve distribution\nefficiency. However, the traditional centralized approaches make high demands\non the control center's computing power and real-time capability. In this\npaper, we present decentralized solutions to achieve flexible and\nself-organized AGVs task allocation. In particular, we propose two improved\nmulti-agent reinforcement learning algorithms, MADDPG-IPF (Information\nPotential Field) and BiCNet-IPF, to realize the coordination among AGVs\nadapting to different scenarios. To address the reward-sparsity issue, we\npropose a reward shaping strategy based on information potential field, which\nprovides stepwise rewards and implicitly guides the AGVs to different material\ntargets. We conduct experiments under different settings (3 AGVs and 6 AGVs),\nand the experiment results indicate that, compared with baseline methods, our\nwork obtains up to 47\\% task response improvement and 22\\% training iterations\nreduction.",
      "published": "2021-08-16",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2108.06886v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2107.00822v1",
      "title": "F-LOAM: Fast LiDAR Odometry And Mapping",
      "authors": [
        "Han Wang",
        "Chen Wang",
        "Chun-Lin Chen",
        "Lihua Xie"
      ],
      "abstract": "Simultaneous Localization and Mapping (SLAM) has wide robotic applications\nsuch as autonomous driving and unmanned aerial vehicles. Both computational\nefficiency and localization accuracy are of great importance towards a good\nSLAM system. Existing works on LiDAR based SLAM often formulate the problem as\ntwo modules: scan-to-scan match and scan-to-map refinement. Both modules are\nsolved by iterative calculation which are computationally expensive. In this\npaper, we propose a general solution that aims to provide a computationally\nefficient and accurate framework for LiDAR based SLAM. Specifically, we adopt a\nnon-iterative two-stage distortion compensation method to reduce the\ncomputational cost. For each scan input, the edge and planar features are\nextracted and matched to a local edge map and a local plane map separately,\nwhere the local smoothness is also considered for iterative pose optimization.\nThorough experiments are performed to evaluate its performance in challenging\nscenarios, including localization for a warehouse Automated Guided Vehicle\n(AGV) and a public dataset on autonomous driving. The proposed method achieves\na competitive localization accuracy with a processing rate of more than 10 Hz\nin the public dataset evaluation, which provides a good trade-off between\nperformance and computational cost for practical applications.",
      "published": "2021-07-02",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2107.00822v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2106.07387v2",
      "title": "An SMT Based Compositional Algorithm to Solve a Conflict-Free Electric Vehicle Routing Problem",
      "authors": [
        "Sabino Francesco Roselli",
        "Martin Fabian",
        "Knut Åkesson"
      ],
      "abstract": "The Vehicle Routing Problem (VRP) is the combinatorial optimization problem\nof designing routes for vehicles to visit customers in such a fashion that a\ncost function, typically the number of vehicles, or the total travelled\ndistance is minimized. The problem finds applications in industrial scenarios,\nfor example where Automated Guided Vehicles run through the plant to deliver\ncomponents from the warehouse. This specific problem, henceforth called the\nElectric Conflict-Free Vehicle Routing Problem (CF-EVRP), involves constraints\nsuch as limited operating range of the vehicles, time windows on the delivery\nto the customers, and limited capacity on the number of vehicles the road\nsegments can accommodate at the same time. Such a complex system results in a\nlarge model that cannot easily be solved to optimality in reasonable time. We\ntherefore developed a compositional model that breaks down the problem into\nsmaller and simpler sub-problems and provides sub-optimal, feasible solutions\nto the original problem. The algorithm exploits the strengths of SMT solvers,\nwhich proved in our previous work to be an efficient approach to deal with\nscheduling problems. Compared to a monolithic model for the CF-EVRP, written in\nthe SMT standard language and solved using a state-of-the-art SMT solver the\ncompositional model was found to be significantly faster.",
      "published": "2021-06-10",
      "categories": [
        "cs.AI",
        "cs.SY",
        "eess.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2106.07387v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2102.05385v1",
      "title": "Error Convergence Analysis and Stability of a Cloud Control AGV",
      "authors": [
        "Shreya Tayade",
        "Peter Rost",
        "Andreas Maeder"
      ],
      "abstract": "In this paper, we present a cloud based Automated Guided vehicle (AGV)\ncontrol system. A controller in an Edge cloud sends the control inputs to an\nAGV to follow a predefined reference track over a wireless channel. The AGV\nfeedback the position update via uplink channel. The objective of this paper is\nto evaluate the stability criterion of an AGV control system in presence of an\nuplink channel outages. Moreover, we also analyse the impact of feedback\ncontrol parameters on the error convergence. The results show error convergence\nat higher rate with optimal selection of feedback parameters. The optimal\nfeedback parameters that converges the error with critical damping is evaluated\nfor two scenarios; with limited AGV velocity and without the limitation on AGV\nvelocity. Furthermore, the paper describe the discretization process of a\ncontinuous control AGV system.",
      "published": "2021-02-10",
      "categories": [
        "eess.SY",
        "cs.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2102.05385v1",
      "source": "ArXiv"
    }
  ]
}