{
  "collection_info": {
    "created_date": "2025-09-16",
    "total_papers": 50,
    "source": "ArXiv",
    "search_keywords": [
      "warehouse management system",
      "WMS optimization",
      "warehouse automation",
      "inventory management system",
      "automated storage retrieval",
      "AGV warehouse",
      "warehouse robotics",
      "smart warehouse",
      "warehouse IoT",
      "supply chain automation"
    ]
  },
  "papers": [
    {
      "id": "http://arxiv.org/abs/2507.06662v1",
      "title": "MK-Pose: Category-Level Object Pose Estimation via Multimodal-Based Keypoint Learning",
      "authors": [
        "Yifan Yang",
        "Peili Song",
        "Enfan Lan",
        "Dong Liu",
        "Jingtai Liu"
      ],
      "abstract": "Category-level object pose estimation, which predicts the pose of objects\nwithin a known category without prior knowledge of individual instances, is\nessential in applications like warehouse automation and manufacturing. Existing\nmethods relying on RGB images or point cloud data often struggle with object\nocclusion and generalization across different instances and categories. This\npaper proposes a multimodal-based keypoint learning framework (MK-Pose) that\nintegrates RGB images, point clouds, and category-level textual descriptions.\nThe model uses a self-supervised keypoint detection module enhanced with\nattention-based query generation, soft heatmap matching and graph-based\nrelational modeling. Additionally, a graph-enhanced feature fusion module is\ndesigned to integrate local geometric information and global context. MK-Pose\nis evaluated on CAMERA25 and REAL275 dataset, and is further tested for\ncross-dataset capability on HouseCat6D dataset. The results demonstrate that\nMK-Pose outperforms existing state-of-the-art methods in both IoU and average\nprecision without shape priors. Codes will be released at\n\\href{https://github.com/yangyifanYYF/MK-Pose}{https://github.com/yangyifanYYF/MK-Pose}.",
      "published": "2025-07-09",
      "categories": [
        "cs.CV",
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2507.06662v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2507.00984v1",
      "title": "Box Pose and Shape Estimation and Domain Adaptation for Large-Scale Warehouse Automation",
      "authors": [
        "Xihang Yu",
        "Rajat Talak",
        "Jingnan Shi",
        "Ulrich Viereck",
        "Igor Gilitschenski",
        "Luca Carlone"
      ],
      "abstract": "Modern warehouse automation systems rely on fleets of intelligent robots that\ngenerate vast amounts of data -- most of which remains unannotated. This paper\ndevelops a self-supervised domain adaptation pipeline that leverages\nreal-world, unlabeled data to improve perception models without requiring\nmanual annotations. Our work focuses specifically on estimating the pose and\nshape of boxes and presents a correct-and-certify pipeline for self-supervised\nbox pose and shape estimation. We extensively evaluate our approach across a\nrange of simulated and real industrial settings, including adaptation to a\nlarge-scale real-world dataset of 50,000 images. The self-supervised model\nsignificantly outperforms models trained solely in simulation and shows\nsubstantial improvements over a zero-shot 3D bounding box estimation baseline.",
      "published": "2025-07-01",
      "categories": [
        "cs.RO",
        "cs.CV",
        "cs.LG"
      ],
      "pdf_url": "http://arxiv.org/pdf/2507.00984v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2506.13425v1",
      "title": "JENGA: Object selection and pose estimation for robotic grasping from a stack",
      "authors": [
        "Sai Srinivas Jeevanandam",
        "Sandeep Inuganti",
        "Shreedhar Govil",
        "Didier Stricker",
        "Jason Rambach"
      ],
      "abstract": "Vision-based robotic object grasping is typically investigated in the context\nof isolated objects or unstructured object sets in bin picking scenarios.\nHowever, there are several settings, such as construction or warehouse\nautomation, where a robot needs to interact with a structured object formation\nsuch as a stack. In this context, we define the problem of selecting suitable\nobjects for grasping along with estimating an accurate 6DoF pose of these\nobjects. To address this problem, we propose a camera-IMU based approach that\nprioritizes unobstructed objects on the higher layers of stacks and introduce a\ndataset for benchmarking and evaluation, along with a suitable evaluation\nmetric that combines object selection with pose accuracy. Experimental results\nshow that although our method can perform quite well, this is a challenging\nproblem if a completely error-free solution is needed. Finally, we show results\nfrom the deployment of our method for a brick-picking application in a\nconstruction scenario.",
      "published": "2025-06-16",
      "categories": [
        "cs.RO",
        "cs.CV"
      ],
      "pdf_url": "http://arxiv.org/pdf/2506.13425v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2506.09765v1",
      "title": "Learning to Optimize Package Picking for Large-Scale, Real-World Robot Induction",
      "authors": [
        "Shuai Li",
        "Azarakhsh Keipour",
        "Sicong Zhao",
        "Srinath Rajagopalan",
        "Charles Swan",
        "Kostas E. Bekris"
      ],
      "abstract": "Warehouse automation plays a pivotal role in enhancing operational\nefficiency, minimizing costs, and improving resilience to workforce\nvariability. While prior research has demonstrated the potential of machine\nlearning (ML) models to increase picking success rates in large-scale robotic\nfleets by prioritizing high-probability picks and packages, these efforts\nprimarily focused on predicting success probabilities for picks sampled using\nheuristic methods. Limited attention has been given, however, to leveraging\ndata-driven approaches to directly optimize sampled picks for better\nperformance at scale. In this study, we propose an ML-based framework that\npredicts transform adjustments as well as improving the selection of suction\ncups for multi-suction end effectors for sampled picks to enhance their success\nprobabilities. The framework was integrated and evaluated in test workcells\nthat resemble the operations of Amazon Robotics' Robot Induction (Robin) fleet,\nwhich is used for package manipulation. Evaluated on over 2 million picks, the\nproposed method achieves a 20\\% reduction in pick failure rates compared to a\nheuristic-based pick sampling baseline, demonstrating its effectiveness in\nlarge-scale warehouse automation scenarios.",
      "published": "2025-06-11",
      "categories": [
        "cs.RO",
        "cs.LG"
      ],
      "pdf_url": "http://arxiv.org/pdf/2506.09765v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2505.08853v1",
      "title": "Efficiently Manipulating Clutter via Learning and Search-Based Reasoning",
      "authors": [
        "Baichuan Huang"
      ],
      "abstract": "This thesis presents novel algorithms to advance robotic object\nrearrangement, a critical task for autonomous systems in applications like\nwarehouse automation and household assistance. Addressing challenges of\nhigh-dimensional planning, complex object interactions, and computational\ndemands, our work integrates deep learning for interaction prediction, tree\nsearch for action sequencing, and parallelized computation for efficiency. Key\ncontributions include the Deep Interaction Prediction Network (DIPN) for\naccurate push motion forecasting (over 90% accuracy), its synergistic\nintegration with Monte Carlo Tree Search (MCTS) for effective non-prehensile\nobject retrieval (100% completion in specific challenging scenarios), and the\nParallel MCTS with Batched Simulations (PMBS) framework, which achieves\nsubstantial planning speed-up while maintaining or improving solution quality.\nThe research further explores combining diverse manipulation primitives,\nvalidated extensively through simulated and real-world experiments.",
      "published": "2025-05-13",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2505.08853v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2506.11011v1",
      "title": "Enhancing Inventory Management with Progressive Web Applications (PWAs): A Scalable Solution for Small and Large Enterprises",
      "authors": [
        "Abhi Desai"
      ],
      "abstract": "Efficient inventory management is crucial for both small and large\nenterprises to optimize operational workflows and reduce overhead costs. This\npaper explores the development and implementation of a Progressive Web\nApplication (PWA) designed to enhance the inventory management experience. The\napplication integrates key functionalities such as barcode and QR code\nscanning, geolocation-based warehouse identification, and cross-device\naccessibility. By leveraging PWA technology, the solution ensures offline\ncapabilities, responsive user experience, and seamless adaptability across\nvarious platforms. The study discusses the challenges and benefits of\nimplementing PWA in inventory management systems, including its limitations in\nperformance compared to native applications. Insights from the development\nprocess provide a roadmap for future developers looking to integrate PWA\ntechnology into enterprise applications. This research contributes to the\ngrowing domain of web-based inventory solutions, offering a scalable and\ncost-effective alternative to traditional inventory management software.",
      "published": "2025-04-26",
      "categories": [
        "cs.SE"
      ],
      "pdf_url": "http://arxiv.org/pdf/2506.11011v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2504.16595v1",
      "title": "HERB: Human-augmented Efficient Reinforcement learning for Bin-packing",
      "authors": [
        "Gojko Perovic",
        "Nuno Ferreira Duarte",
        "Atabak Dehban",
        "Gonçalo Teixeira",
        "Egidio Falotico",
        "José Santos-Victor"
      ],
      "abstract": "Packing objects efficiently is a fundamental problem in logistics, warehouse\nautomation, and robotics. While traditional packing solutions focus on\ngeometric optimization, packing irregular, 3D objects presents significant\nchallenges due to variations in shape and stability. Reinforcement\nLearning~(RL) has gained popularity in robotic packing tasks, but training\npurely from simulation can be inefficient and computationally expensive. In\nthis work, we propose HERB, a human-augmented RL framework for packing\nirregular objects. We first leverage human demonstrations to learn the best\nsequence of objects to pack, incorporating latent factors such as space\noptimization, stability, and object relationships that are difficult to model\nexplicitly. Next, we train a placement algorithm that uses visual information\nto determine the optimal object positioning inside a packing container. Our\napproach is validated through extensive performance evaluations, analyzing both\npacking efficiency and latency. Finally, we demonstrate the real-world\nfeasibility of our method on a robotic system. Experimental results show that\nour method outperforms geometric and purely RL-based approaches by leveraging\nhuman intuition, improving both packing robustness and adaptability. This work\nhighlights the potential of combining human expertise-driven RL to tackle\ncomplex real-world packing challenges in robotic systems.",
      "published": "2025-04-23",
      "categories": [
        "cs.RO",
        "cs.LG"
      ],
      "pdf_url": "http://arxiv.org/pdf/2504.16595v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2504.15130v1",
      "title": "Neural ATTF: A Scalable Solution to Lifelong Multi-Agent Path Planning",
      "authors": [
        "Kushal Shah",
        "Jihyun Park",
        "Seung-Kyum Choi"
      ],
      "abstract": "Multi-Agent Pickup and Delivery (MAPD) is a fundamental problem in robotics,\nparticularly in applications such as warehouse automation and logistics.\nExisting solutions often face challenges in scalability, adaptability, and\nefficiency, limiting their applicability in dynamic environments with real-time\nplanning requirements. This paper presents Neural ATTF (Adaptive Task Token\nFramework), a new algorithm that combines a Priority Guided Task Matching\n(PGTM) Module with Neural STA* (Space-Time A*), a data-driven path planning\nmethod. Neural STA* enhances path planning by enabling rapid exploration of the\nsearch space through guided learned heuristics and ensures collision avoidance\nunder dynamic constraints. PGTM prioritizes delayed agents and dynamically\nassigns tasks by prioritizing agents nearest to these tasks, optimizing both\ncontinuity and system throughput. Experimental evaluations against\nstate-of-the-art MAPD algorithms, including TPTS, CENTRAL, RMCA, LNS-PBS, and\nLNS-wPBS, demonstrate the superior scalability, solution quality, and\ncomputational efficiency of Neural ATTF. These results highlight the\nframework's potential for addressing the critical demands of complex,\nreal-world multi-agent systems operating in high-demand, unpredictable\nsettings.",
      "published": "2025-04-21",
      "categories": [
        "cs.RO",
        "cs.AI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2504.15130v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2503.02992v2",
      "title": "RAILGUN: A Unified Convolutional Policy for Multi-Agent Path Finding Across Different Environments and Tasks",
      "authors": [
        "Yimin Tang",
        "Xiao Xiong",
        "Jingyi Xi",
        "Jiaoyang Li",
        "Erdem Bıyık",
        "Sven Koenig"
      ],
      "abstract": "Multi-Agent Path Finding (MAPF), which focuses on finding collision-free\npaths for multiple robots, is crucial for applications ranging from aerial\nswarms to warehouse automation. Solving MAPF is NP-hard so learning-based\napproaches for MAPF have gained attention, particularly those leveraging deep\nneural networks. Nonetheless, despite the community's continued efforts, all\nlearning-based MAPF planners still rely on decentralized planning due to\nvariability in the number of agents and map sizes. We have developed the first\ncentralized learning-based policy for MAPF problem called RAILGUN. RAILGUN is\nnot an agent-based policy but a map-based policy. By leveraging a CNN-based\narchitecture, RAILGUN can generalize across different maps and handle any\nnumber of agents. We collect trajectories from rule-based methods to train our\nmodel in a supervised way. In experiments, RAILGUN outperforms most baseline\nmethods and demonstrates great zero-shot generalization capabilities on various\ntasks, maps and agent numbers that were not seen in the training dataset.",
      "published": "2025-03-04",
      "categories": [
        "cs.RO",
        "cs.AI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2503.02992v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2502.14743v2",
      "title": "Multi-Agent Coordination across Diverse Applications: A Survey",
      "authors": [
        "Lijun Sun",
        "Yijun Yang",
        "Qiqi Duan",
        "Yuhui Shi",
        "Chao Lyu",
        "Yu-Cheng Chang",
        "Chin-Teng Lin",
        "Yang Shen"
      ],
      "abstract": "Multi-agent coordination studies the underlying mechanism enabling the\ntrending spread of diverse multi-agent systems (MAS) and has received\nincreasing attention, driven by the expansion of emerging applications and\nrapid AI advances. This survey outlines the current state of coordination\nresearch across applications through a unified understanding that answers four\nfundamental coordination questions: (1) what is coordination; (2) why\ncoordination; (3) who to coordinate with; and (4) how to coordinate. Our\npurpose is to explore existing ideas and expertise in coordination and their\nconnections across diverse applications, while identifying and highlighting\nemerging and promising research directions. First, general coordination\nproblems that are essential to varied applications are identified and analyzed.\nSecond, a number of MAS applications are surveyed, ranging from widely studied\ndomains, e.g., search and rescue, warehouse automation and logistics, and\ntransportation systems, to emerging fields including humanoid and\nanthropomorphic robots, satellite systems, and large language models (LLMs).\nFinally, open challenges about the scalability, heterogeneity, and learning\nmechanisms of MAS are analyzed and discussed. In particular, we identify the\nhybridization of hierarchical and decentralized coordination, human-MAS\ncoordination, and LLM-based MAS as promising future directions.",
      "published": "2025-02-20",
      "categories": [
        "cs.MA",
        "cs.AI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2502.14743v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2412.15369v1",
      "title": "Scalable and low-cost remote lab platforms: Teaching industrial robotics using open-source tools and understanding its social implications",
      "authors": [
        "Amit Kumar",
        "Jaison Jose",
        "Archit Jain",
        "Siddharth Kulkarni",
        "Kavi Arya"
      ],
      "abstract": "With recent advancements in industrial robots, educating students in new\ntechnologies and preparing them for the future is imperative. However, access\nto industrial robots for teaching poses challenges, such as the high cost of\nacquiring these robots, the safety of the operator and the robot, and\ncomplicated training material. This paper proposes two low-cost platforms built\nusing open-source tools like Robot Operating System (ROS) and its latest\nversion ROS 2 to help students learn and test algorithms on remotely connected\nindustrial robots. Universal Robotics (UR5) arm and a custom mobile rover were\ndeployed in different life-size testbeds, a greenhouse, and a warehouse to\ncreate an Autonomous Agricultural Harvester System (AAHS) and an Autonomous\nWarehouse Management System (AWMS). These platforms were deployed for a period\nof 7 months and were tested for their efficacy with 1,433 and 1,312 students,\nrespectively. The hardware used in AAHS and AWMS was controlled remotely for\n160 and 355 hours, respectively, by students over a period of 3 months.",
      "published": "2024-12-19",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2412.15369v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2412.13359v1",
      "title": "Multi-Agent Motion Planning For Differential Drive Robots Through Stationary State Search",
      "authors": [
        "Jingtian Yan",
        "Jiaoyang Li"
      ],
      "abstract": "Multi-Agent Motion Planning (MAMP) finds various applications in fields such\nas traffic management, airport operations, and warehouse automation. In many of\nthese environments, differential drive robots are commonly used. These robots\nhave a kinodynamic model that allows only in-place rotation and movement along\ntheir current orientation, subject to speed and acceleration limits. However,\nexisting Multi-Agent Path Finding (MAPF)-based methods often use simplified\nmodels for robot kinodynamics, which limits their practicality and realism. In\nthis paper, we introduce a three-level framework called MASS to address these\nchallenges. MASS combines MAPF-based methods with our proposed stationary state\nsearch planner to generate high-quality kinodynamically-feasible plans. We\nfurther extend MASS using an adaptive window mechanism to address the lifelong\nMAMP problem. Empirically, we tested our methods on the single-shot grid map\ndomain and the lifelong warehouse domain. Our method shows up to 400%\nimprovements in terms of throughput compared to existing methods.",
      "published": "2024-12-17",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.MA"
      ],
      "pdf_url": "http://arxiv.org/pdf/2412.13359v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2412.02650v1",
      "title": "Bridging Hard and Soft: Mechanical Metamaterials Enable Rigid Torque Transmission in Soft Robots",
      "authors": [
        "Molly Carton",
        "Jakub F. Kowalewski",
        "Jiani Guo",
        "Jacob F. Alpert",
        "Aman Garg",
        "Daniel Revier",
        "Jeffrey Ian Lipton"
      ],
      "abstract": "Torque and continuous rotation are fundamental methods of actuation and\nmanipulation in rigid robots. Soft robot arms use soft materials and structures\nto mimic the passive compliance of biological arms that bend and extend. This\nuse of compliance prevents soft arms from continuously transmitting and\nexerting torques to interact with their environment. Here, we show how relying\non patterning structures instead of inherent material properties allows soft\nrobotic arms to remain compliant while continuously transmitting torque to\ntheir environment. We demonstrate a soft robotic arm made from a pair of\nmechanical metamaterials that act as compliant constant-velocity joints. The\njoints are up to 52 times stiffer in torsion than bending and can bend up to\n45{\\deg}. This robot arm can continuously transmit torque while deforming in\nall other directions. The arm's mechanical design achieves high motion\nrepeatability (0.4 mm and 0.1{\\deg}) when tracking trajectories. We then\ntrained a neural network to learn the inverse kinematics, enabling us to\nprogram the arm to complete tasks that are challenging for existing soft robots\nsuch as installing light bulbs, fastening bolts, and turning valves. The arm's\npassive compliance makes it safe around humans and provides a source of\nmechanical intelligence, enabling it to adapt to misalignment when manipulating\nobjects. This work will bridge the gap between hard and soft robotics with\napplications in human assistance, warehouse automation, and extreme\nenvironments.",
      "published": "2024-12-03",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2412.02650v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2410.11024v1",
      "title": "GSRM: Building Roadmaps for Query-Efficient and Near-Optimal Path Planning Using a Reaction Diffusion System",
      "authors": [
        "Christian Henkel",
        "Marc Toussaint",
        "Wolfgang Hönig"
      ],
      "abstract": "Mobile robots frequently navigate on roadmaps, i.e., graphs where edges\nrepresent safe motions, in applications such as healthcare, hospitality, and\nwarehouse automation. Often the environment is quasi-static, i.e., it is\nsufficient to construct a roadmap once and then use it for any future planning\nqueries. Roadmaps are typically used with graph search algorithm to find\nfeasible paths for the robots. Therefore, the roadmap should be well-connected,\nand graph searches should produce near-optimal solutions with short solution\npaths while simultaneously be computationally efficient to execute queries\nquickly.\n  We propose a new method to construct roadmaps based on the Gray-Scott\nreaction diffusion system and Delaunay triangulation. Our approach, GSRM,\nproduces roadmaps with evenly distributed vertices and edges that are\nwell-connected even in environments with challenging narrow passages.\nEmpirically, we compare to classical roadmaps generated by 8-connected grids,\nprobabilistic roadmaps (PRM, SPARS2), and optimized roadmap graphs (ORM). Our\nresults show that GSRM consistently produces superior roadmaps that are\nwell-connected, have high query efficiency, and result in short solution paths.",
      "published": "2024-10-14",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2410.11024v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2408.03063v1",
      "title": "Social Behavior as a Key to Learning-based Multi-Agent Pathfinding Dilemmas",
      "authors": [
        "Chengyang He",
        "Tanishq Duhan",
        "Parth Tulsyan",
        "Patrick Kim",
        "Guillaume Sartoretti"
      ],
      "abstract": "The Multi-agent Path Finding (MAPF) problem involves finding collision-free\npaths for a team of agents in a known, static environment, with important\napplications in warehouse automation, logistics, or last-mile delivery. To meet\nthe needs of these large-scale applications, current learning-based methods\noften deploy the same fully trained, decentralized network to all agents to\nimprove scalability. However, such parameter sharing typically results in\nhomogeneous behaviors among agents, which may prevent agents from breaking ties\naround symmetric conflict (e.g., bottlenecks) and might lead to\nlive-/deadlocks. In this paper, we propose SYLPH, a novel learning-based MAPF\nframework aimed to mitigate the adverse effects of homogeneity by allowing\nagents to learn and dynamically select different social behaviors (akin to\nindividual, dynamic roles), without affecting the scalability offered by\nparameter sharing. Specifically, SYLPH agents learn to select their Social\nValue Orientation (SVO) given the situation at hand, quantifying their own\nlevel of selfishness/altruism, as well as an SVO-conditioned MAPF policy\ndictating their movement actions. To these ends, each agent first determines\nthe most influential other agent in the system by predicting future\nconflicts/interactions with other agents. Each agent selects its own SVO\ntowards that agent, and trains its decentralized MAPF policy to enact this SVO\nuntil another agent becomes more influential. To further allow agents to\nconsider each others' social preferences, each agent gets access to the SVO\nvalue of their neighbors. As a result of this hierarchical decision-making and\nexchange of social preferences, SYLPH endows agents with the ability to reason\nabout the MAPF task through more latent spaces and nuanced contexts, leading to\nvaried responses that can help break ties around symmetric conflicts. [...]",
      "published": "2024-08-06",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2408.03063v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2403.12798v1",
      "title": "Introducing Combi-Stations in Robotic Mobile Fulfilment Systems: A Queueing-Theory-Based Efficiency Analysis",
      "authors": [
        "Lin Xie",
        "Sonja Otten"
      ],
      "abstract": "In the era of digital commerce, the surge in online shopping and the\nexpectation for rapid delivery have placed unprecedented demands on warehouse\noperations. The traditional method of order fulfilment, where human order\npickers traverse large storage areas to pick items, has become a bottleneck,\nconsuming valuable time and resources. Robotic Mobile Fulfilment Systems (RMFS)\noffer a solution by using robots to transport storage racks directly to\nhuman-operated picking stations, eliminating the need for pickers to travel.\nThis paper introduces combi-stations, a novel type of station that enables both\nitem picking and replenishment, as opposed to traditional separate stations. We\nanalyse the efficiency of combi-stations using queueing theory and demonstrate\ntheir potential to streamline warehouse operations. Our results suggest that\ncombi-stations can reduce the number of robots required for stability and\nsignificantly reduce order turnover time, indicating a promising direction for\nfuture warehouse automation.",
      "published": "2024-03-19",
      "categories": [
        "cs.RO",
        "math.OC"
      ],
      "pdf_url": "http://arxiv.org/pdf/2403.12798v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2402.06018v1",
      "title": "A versatile robotic hand with 3D perception, force sensing for autonomous manipulation",
      "authors": [
        "Nikolaus Correll",
        "Dylan Kriegman",
        "Stephen Otto",
        "James Watson"
      ],
      "abstract": "We describe a force-controlled robotic gripper with built-in tactile and 3D\nperception. We also describe a complete autonomous manipulation pipeline\nconsisting of object detection, segmentation, point cloud processing,\nforce-controlled manipulation, and symbolic (re)-planning. The design\nemphasizes versatility in terms of applications, manufacturability, use of\ncommercial off-the-shelf parts, and open-source software. We validate the\ndesign by characterizing force control (achieving up to 32N, controllable in\nsteps of 0.08N), force measurement, and two manipulation demonstrations:\nassembly of the Siemens gear assembly problem, and a sensor-based stacking task\nrequiring replanning. These demonstrate robust execution of long sequences of\nsensor-based manipulation tasks, which makes the resulting platform a solid\nfoundation for researchers in task-and-motion planning, educators, and quick\nprototyping of household, industrial and warehouse automation tasks.",
      "published": "2024-02-08",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2402.06018v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2312.16026v1",
      "title": "Dynamic AGV Task Allocation in Intelligent Warehouses",
      "authors": [
        "Arash Dehghan",
        "Mucahit Cevik",
        "Merve Bodur"
      ],
      "abstract": "This paper explores the integration of Automated Guided Vehicles (AGVs) in\nwarehouse order picking, a crucial and cost-intensive aspect of warehouse\noperations. The booming AGV industry, accelerated by the COVID-19 pandemic, is\nwitnessing widespread adoption due to its efficiency, reliability, and\ncost-effectiveness in automating warehouse tasks. This paper focuses on\nenhancing the picker-to-parts system, prevalent in small to medium-sized\nwarehouses, through the strategic use of AGVs. We discuss the benefits and\napplications of AGVs in various warehouse tasks, highlighting their\ntransformative potential in improving operational efficiency. We examine the\ndeployment of AGVs by leading companies in the industry, showcasing their\nvaried functionalities in warehouse management. Addressing the gap in research\non optimizing operational performance in hybrid environments where humans and\nAGVs coexist, our study delves into a dynamic picker-to-parts warehouse\nscenario. We propose a novel approach Neural Approximate Dynamic Programming\napproach for coordinating a mixed team of human and AGV workers, aiming to\nmaximize order throughput and operational efficiency. This involves innovative\nsolutions for non-myopic decision making, order batching, and battery\nmanagement. We also discuss the integration of advanced robotics technology in\nautomating the complete order-picking process. Through a comprehensive\nnumerical study, our work offers valuable insights for managing a heterogeneous\nworkforce in a hybrid warehouse setting, contributing significantly to the\nfield of warehouse automation and logistics.",
      "published": "2023-12-26",
      "categories": [
        "math.OC",
        "cs.AI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2312.16026v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2312.10887v1",
      "title": "On Computing Makespan-Optimal Solutions for Generalized Sliding-Tile Puzzles",
      "authors": [
        "Marcus Gozon",
        "Jingjin Yu"
      ],
      "abstract": "In the $15$-puzzle game, $15$ labeled square tiles are reconfigured on a\n$4\\times 4$ board through an escort, wherein each (time) step, a single tile\nneighboring it may slide into it, leaving the space previously occupied by the\ntile as the new escort. We study a generalized sliding-tile puzzle (GSTP) in\nwhich (1) there are $1+$ escorts and (2) multiple tiles can move synchronously\nin a single time step. Compared with popular discrete multi-agent/robot motion\nmodels, GSTP provides a more accurate model for a broad array of high-utility\napplications, including warehouse automation and autonomous garage parking, but\nis less studied due to the more involved tile interactions. In this work, we\nanalyze optimal GSTP solution structures, establishing that computing\nmakespan-optimal solutions for GSTP is NP-complete and developing polynomial\ntime algorithms yielding makespans approximating the minimum with expected/high\nprobability constant factors, assuming randomized start and goal\nconfigurations.",
      "published": "2023-12-18",
      "categories": [
        "cs.RO",
        "cs.AI",
        "cs.MA"
      ],
      "pdf_url": "http://arxiv.org/pdf/2312.10887v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2311.01728v1",
      "title": "RDE: A Hybrid Policy Framework for Multi-Agent Path Finding Problem",
      "authors": [
        "Jianqi Gao",
        "Yanjie Li",
        "Xiaoqing Yang",
        "Mingshan Tan"
      ],
      "abstract": "Multi-agent path finding (MAPF) is an abstract model for the navigation of\nmultiple robots in warehouse automation, where multiple robots plan\ncollision-free paths from the start to goal positions. Reinforcement learning\n(RL) has been employed to develop partially observable distributed MAPF\npolicies that can be scaled to any number of agents. However, RL-based MAPF\npolicies often get agents stuck in deadlock due to warehouse automation's dense\nand structured obstacles. This paper proposes a novel hybrid MAPF policy, RDE,\nbased on switching among the RL-based MAPF policy, the Distance heat map\n(DHM)-based policy and the Escape policy. The RL-based policy is used for\ncoordination among agents. In contrast, when no other agents are in the agent's\nfield of view, it can get the next action by querying the DHM. The escape\npolicy that randomly selects valid actions can help agents escape the deadlock.\nWe conduct simulations on warehouse-like structured grid maps using\nstate-of-the-art RL-based MAPF policies (DHC and DCC), which show that RDE can\nsignificantly improve their performance.",
      "published": "2023-11-03",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2311.01728v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2310.17168v2",
      "title": "Learning an Inventory Control Policy with General Inventory Arrival Dynamics",
      "authors": [
        "Sohrab Andaz",
        "Carson Eisenach",
        "Dhruv Madeka",
        "Kari Torkkola",
        "Randy Jia",
        "Dean Foster",
        "Sham Kakade"
      ],
      "abstract": "In this paper we address the problem of learning and backtesting inventory\ncontrol policies in the presence of general arrival dynamics -- which we term\nas a quantity-over-time arrivals model (QOT). We also allow for order\nquantities to be modified as a post-processing step to meet vendor constraints\nsuch as order minimum and batch size constraints -- a common practice in real\nsupply chains. To the best of our knowledge this is the first work to handle\neither arbitrary arrival dynamics or an arbitrary downstream post-processing of\norder quantities. Building upon recent work (Madeka et al., 2022) we similarly\nformulate the periodic review inventory control problem as an exogenous\ndecision process, where most of the state is outside the control of the agent.\nMadeka et al., 2022 show how to construct a simulator that replays historic\ndata to solve this class of problem. In our case, we incorporate a deep\ngenerative model for the arrivals process as part of the history replay. By\nformulating the problem as an exogenous decision process, we can apply results\nfrom Madeka et al., 2022 to obtain a reduction to supervised learning. Via\nsimulation studies we show that this approach yields statistically significant\nimprovements in profitability over production baselines. Using data from a\nreal-world A/B test, we show that Gen-QOT generalizes well to off-policy data\nand that the resulting buying policy outperforms traditional inventory\nmanagement systems in real world settings.",
      "published": "2023-10-26",
      "categories": [
        "cs.LG",
        "stat.ML"
      ],
      "pdf_url": "http://arxiv.org/pdf/2310.17168v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2309.12365v3",
      "title": "An Efficient Intelligent Semi-Automated Warehouse Inventory Stocktaking System",
      "authors": [
        "Chunan Tong"
      ],
      "abstract": "In the context of evolving supply chain management, the significance of\nefficient inventory management has grown substantially for businesses. However,\nconventional manual and experience-based approaches often struggle to meet the\ncomplexities of modern market demands. This research introduces an intelligent\ninventory management system to address challenges related to inaccurate data,\ndelayed monitoring, and overreliance on subjective experience in forecasting.\nThe proposed system integrates bar code and distributed flutter application\ntechnologies for intelligent perception, alongside comprehensive big data\nanalytics to enable data-driven decision-making. Through meticulous analysis,\nsystem design, critical technology exploration, and simulation validation, the\neffectiveness of the proposed system is successfully demonstrated. The\nintelligent system facilitates second-level monitoring, high-frequency checks,\nand artificial intelligence-driven forecasting, consequently enhancing the\nautomation, precision, and intelligence of inventory management. This system\ncontributes to cost reduction and optimized inventory sizes through accurate\npredictions and informed decisions, ultimately achieving a mutually beneficial\nscenario. The outcomes of this research offer",
      "published": "2023-09-13",
      "categories": [
        "cs.HC",
        "cs.AI",
        "cs.SY",
        "eess.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2309.12365v3",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2308.06036v1",
      "title": "The Impact of Overall Optimization on Warehouse Automation",
      "authors": [
        "Hiroshi Yoshitake",
        "Pieter Abbeel"
      ],
      "abstract": "In this study, we propose a novel approach for investigating optimization\nperformance by flexible robot coordination in automated warehouses with\nmulti-agent reinforcement learning (MARL)-based control. Automated systems\nusing robots are expected to achieve efficient operations compared with manual\nsystems in terms of overall optimization performance. However, the impact of\noverall optimization on performance remains unclear in most automated systems\ndue to a lack of suitable control methods. Thus, we proposed a centralized\ntraining-and-decentralized execution MARL framework as a practical overall\noptimization control method. In the proposed framework, we also proposed a\nsingle shared critic, trained with global states and rewards, applicable to a\ncase in which heterogeneous agents make decisions asynchronously. Our proposed\nMARL framework was applied to the task selection of material handling equipment\nthrough automated order picking simulation, and its performance was evaluated\nto determine how far overall optimization outperforms partial optimization by\ncomparing it with other MARL frameworks and rule-based control methods.",
      "published": "2023-08-11",
      "categories": [
        "cs.RO",
        "cs.SY",
        "eess.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2308.06036v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2306.16783v1",
      "title": "TacMMs: Tactile Mobile Manipulators for Warehouse Automation",
      "authors": [
        "Zhuochao He",
        "Xuyang Zhang",
        "Simon Jones",
        "Sabine Hauert",
        "Dandan Zhang",
        "Nathan F. Lepora"
      ],
      "abstract": "Multi-robot platforms are playing an increasingly important role in warehouse\nautomation for efficient goods transport. This paper proposes a novel\ncustomization of a multi-robot system, called Tactile Mobile Manipulators\n(TacMMs). Each TacMM integrates a soft optical tactile sensor and a mobile\nrobot with a load-lifting mechanism, enabling cooperative transportation in\ntasks requiring coordinated physical interaction. More specifically, we mount\nthe TacTip (biomimetic optical tactile sensor) on the Distributed Organisation\nand Transport System (DOTS) mobile robot. The tactile information then helps\nthe mobile robots adjust the relative robot-object pose, thereby increasing the\nefficiency of load-lifting tasks. This study compares the performance of using\ntwo TacMMs with tactile perception with traditional vision-based pose\nadjustment for load-lifting. The results show that the average success rate of\nthe TacMMs (66%) is improved over a purely visual-based method (34%), with a\nlarger improvement when the mass of the load was non-uniformly distributed.\nAlthough this initial study considers two TacMMs, we expect the benefits of\ntactile perception to extend to multiple mobile robots. Website:\nhttps://sites.google.com/view/tacmms",
      "published": "2023-06-29",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2306.16783v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2306.14409v1",
      "title": "Efficient Heuristics for Multi-Robot Path Planning in Crowded Environments",
      "authors": [
        "Teng Guo",
        "Jingjin Yu"
      ],
      "abstract": "Optimal Multi-Robot Path Planning (MRPP) has garnered significant attention\ndue to its many applications in domains including warehouse automation,\ntransportation, and swarm robotics. Current MRPP solvers can be divided into\nreduction-based, search-based, and rule-based categories, each with their\nstrengths and limitations. Regardless of the methodology, however, the issue of\nhandling dense MRPP instances remains a significant challenge, where existing\napproaches generally demonstrate a dichotomy regarding solution optimality and\nefficiency. This study seeks to bridge the gap in optimal MRPP resolution for\ndense, highly-entangled scenarios, with potential applications to high-density\nstorage systems and traffic congestion control. Toward that goal, we analyze\nthe behaviors of SOTA MRPP algorithms in dense settings and develop two hybrid\nalgorithms leveraging the strengths of existing SOTA algorithms: DCBS\n(database-accelerated enhanced conflict-based search) and SCBS (sparsified\nenhanced conflict-based search). Experimental validations demonstrate that DCBS\nand SCBS deliver a significant reduction in computational time compared to\nexisting bounded-suboptimal methods and improve solution quality compared to\nexisting rule-based methods, achieving a desirable balance between\ncomputational efficiency and solution optimality. As a result, DCBS and SCBS\nare particularly suitable for quickly computing good-quality solutions for\nmulti-robot routing in dense settings",
      "published": "2023-06-26",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2306.14409v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2304.02833v2",
      "title": "DoUnseen: Tuning-Free Class-Adaptive Object Detection of Unseen Objects for Robotic Grasping",
      "authors": [
        "Anas Gouda",
        "Moritz Roidl"
      ],
      "abstract": "How can we segment varying numbers of objects where each specific object\nrepresents its own separate class? To make the problem even more realistic, how\ncan we add and delete classes on the fly without retraining or fine-tuning?\nThis is the case of robotic applications where no datasets of the objects exist\nor application that includes thousands of objects (E.g., in logistics) where it\nis impossible to train a single model to learn all of the objects. Most current\nresearch on object segmentation for robotic grasping focuses on class-level\nobject segmentation (E.g., box, cup, bottle), closed sets (specific objects of\na dataset; for example, YCB dataset), or deep learning-based template matching.\nIn this work, we are interested in open sets where the number of classes is\nunknown, varying, and without pre-knowledge about the objects' types. We\nconsider each specific object as its own separate class. Our goal is to develop\nan object detector that requires no fine-tuning and can add any object as a\nclass just by capturing a few images of the object. Our main idea is to break\nthe segmentation pipelines into two steps by combining unseen object\nsegmentation networks cascaded by class-adaptive classifiers. We evaluate our\nclass-adaptive object detector on unseen datasets and compare it to a trained\nMask R-CNN on those datasets. The results show that the performance varies from\npractical to unsuitable depending on the environment setup and the objects\nbeing handled. The code is available in our DoUnseen library repository.",
      "published": "2023-04-06",
      "categories": [
        "cs.CV",
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2304.02833v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2303.16382v1",
      "title": "ARMBench: An Object-centric Benchmark Dataset for Robotic Manipulation",
      "authors": [
        "Chaitanya Mitash",
        "Fan Wang",
        "Shiyang Lu",
        "Vikedo Terhuja",
        "Tyler Garaas",
        "Felipe Polido",
        "Manikantan Nambi"
      ],
      "abstract": "This paper introduces Amazon Robotic Manipulation Benchmark (ARMBench), a\nlarge-scale, object-centric benchmark dataset for robotic manipulation in the\ncontext of a warehouse. Automation of operations in modern warehouses requires\na robotic manipulator to deal with a wide variety of objects, unstructured\nstorage, and dynamically changing inventory. Such settings pose challenges in\nperceiving the identity, physical characteristics, and state of objects during\nmanipulation. Existing datasets for robotic manipulation consider a limited set\nof objects or utilize 3D models to generate synthetic scenes with limitation in\ncapturing the variety of object properties, clutter, and interactions. We\npresent a large-scale dataset collected in an Amazon warehouse using a robotic\nmanipulator performing object singulation from containers with heterogeneous\ncontents. ARMBench contains images, videos, and metadata that corresponds to\n235K+ pick-and-place activities on 190K+ unique objects. The data is captured\nat different stages of manipulation, i.e., pre-pick, during transfer, and after\nplacement. Benchmark tasks are proposed by virtue of high-quality annotations\nand baseline performance evaluation are presented on three visual perception\nchallenges, namely 1) object segmentation in clutter, 2) object identification,\nand 3) defect detection. ARMBench can be accessed at http://armbench.com",
      "published": "2023-03-29",
      "categories": [
        "cs.RO",
        "cs.CV"
      ],
      "pdf_url": "http://arxiv.org/pdf/2303.16382v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2207.03851v2",
      "title": "Storehouse: a Reinforcement Learning Environment for Optimizing Warehouse Management",
      "authors": [
        "Julen Cestero",
        "Marco Quartulli",
        "Alberto Maria Metelli",
        "Marcello Restelli"
      ],
      "abstract": "Warehouse Management Systems have been evolving and improving thanks to new\nData Intelligence techniques. However, many current optimizations have been\napplied to specific cases or are in great need of manual interaction. Here is\nwhere Reinforcement Learning techniques come into play, providing\nautomatization and adaptability to current optimization policies. In this\npaper, we present Storehouse, a customizable environment that generalizes the\ndefinition of warehouse simulations for Reinforcement Learning. We also\nvalidate this environment against state-of-the-art reinforcement learning\nalgorithms and compare these results to human and random policies.",
      "published": "2022-07-08",
      "categories": [
        "cs.LG",
        "cs.AI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2207.03851v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2207.00227v1",
      "title": "Introducing flexible perovskites to the IoT world using photovoltaic-powered wireless tags",
      "authors": [
        "Sai Nithin Reddy Kantareddy",
        "Rahul Bhattacharya",
        "Sanjay E. Sarma",
        "Ian Mathews",
        "Janak Thapa",
        "Liu Zhe",
        "Shijing Sun",
        "Ian Marius Peters",
        "Tonio Buonassisi"
      ],
      "abstract": "Billions of everyday objects could become part of the Internet of Things\n(IoT) by augmentation with low-cost, long-range, maintenance-free wireless\nsensors. Radio Frequency Identification (RFID) is a low-cost wireless\ntechnology that could enable this vision, but it is constrained by short\ncommunication range and lack of sufficient energy available to power auxiliary\nelectronics and sensors. Here, we explore the use of flexible perovskite\nphotovoltaic cells to provide external power to semi-passive RFID tags to\nincrease range and energy availability for external electronics such as\nmicrocontrollers and digital sensors. Perovskites are intriguing materials that\nhold the possibility to develop high-performance, low-cost, optically tunable\n(to absorb different light spectra), and flexible light energy harvesters. Our\nprototype perovskite photovoltaic cells on plastic substrates have an\nefficiency of 13% and a voltage of 0.88 V at maximum power under standard\ntesting conditions. We built prototypes of RFID sensors powered with these\nflexible photovoltaic cells to demonstrate real-world applications. Our\nevaluation of the prototypes suggests that: i) flexible PV cells are durable up\nto a bending radius of 5 mm with only a 20 % drop in relative efficiency; ii)\nRFID communication range increased by 5x, and meets the energy needs (10-350\nmicrowatt) to enable self-powered wireless sensors; iii) perovskite powered\nwireless sensors enable many battery-less sensing applications (e.g.,\nperishable good monitoring, warehouse automation)",
      "published": "2022-07-01",
      "categories": [
        "eess.SP",
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2207.00227v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2203.07092v1",
      "title": "The Multi-Agent Pickup and Delivery Problem: MAPF, MARL and Its Warehouse Applications",
      "authors": [
        "Tim Tsz-Kit Lau",
        "Biswa Sengupta"
      ],
      "abstract": "We study two state-of-the-art solutions to the multi-agent pickup and\ndelivery (MAPD) problem based on different principles -- multi-agent\npath-finding (MAPF) and multi-agent reinforcement learning (MARL).\nSpecifically, a recent MAPF algorithm called conflict-based search (CBS) and a\ncurrent MARL algorithm called shared experience actor-critic (SEAC) are\nstudied. While the performance of these algorithms is measured using quite\ndifferent metrics in their separate lines of work, we aim to benchmark these\ntwo methods comprehensively in a simulated warehouse automation environment.",
      "published": "2022-03-14",
      "categories": [
        "cs.LG",
        "cs.MA",
        "stat.ML"
      ],
      "pdf_url": "http://arxiv.org/pdf/2203.07092v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2203.00885v2",
      "title": "A Learning Based Framework for Handling Uncertain Lead Times in Multi-Product Inventory Management",
      "authors": [
        "Hardik Meisheri",
        "Somjit Nath",
        "Mayank Baranwal",
        "Harshad Khadilkar"
      ],
      "abstract": "Most existing literature on supply chain and inventory management consider\nstochastic demand processes with zero or constant lead times. While it is true\nthat in certain niche scenarios, uncertainty in lead times can be ignored, most\nreal-world scenarios exhibit stochasticity in lead times. These random\nfluctuations can be caused due to uncertainty in arrival of raw materials at\nthe manufacturer's end, delay in transportation, an unforeseen surge in\ndemands, and switching to a different vendor, to name a few. Stochasticity in\nlead times is known to severely degrade the performance in an inventory\nmanagement system, and it is only fair to abridge this gap in supply chain\nsystem through a principled approach. Motivated by the recently introduced\ndelay-resolved deep Q-learning (DRDQN) algorithm, this paper develops a\nreinforcement learning based paradigm for handling uncertainty in lead times\n(\\emph{action delay}). Through empirical evaluations, it is further shown that\nthe inventory management with uncertain lead times is not only equivalent to\nthat of delay in information sharing across multiple echelons\n(\\emph{observation delay}), a model trained to handle one kind of delay is\ncapable to handle delays of another kind without requiring to be retrained.\nFinally, we apply the delay-resolved framework to scenarios comprising of\nmultiple products subjected to stochasticity in lead times, and elucidate how\nthe delay-resolved framework negates the effect of any delay to achieve\nnear-optimal performance.",
      "published": "2022-03-02",
      "categories": [
        "cs.LG",
        "cs.AI",
        "math.OC"
      ],
      "pdf_url": "http://arxiv.org/pdf/2203.00885v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2202.12786v1",
      "title": "Behaviorally Grounded Model-Based and Model Free Cost Reduction in a Simulated Multi-Echelon Supply Chain",
      "authors": [
        "James Paine"
      ],
      "abstract": "Amplification and phase shift in ordering signals, commonly referred to as\nbullwhip, are responsible for both excessive strain on real world inventory\nmanagement systems, stock outs, and unnecessary capital reservation though\nsafety stock building. Bullwhip is a classic, yet persisting, problem with\nreverberating consequences in inventory management. Research on bullwhip has\nconsistently emphasized behavioral influences for this phenomenon and leveraged\nbehavioral ordering models to suggest interventions. However more recent\nmodel-free approaches have also seen success. In this work, the author develops\nalgorithmic approaches towards mitigating bullwhip using both behaviorally\ngrounded model-based approaches alongside a model-free dual deep Q-network\nreinforcement learning approach. In addition to exploring the utility of this\nspecific model-free architecture to multi-echelon supply chains with imperfect\ninformation sharing and information delays, the author directly compares the\nperformance of these model-based and model-free approaches. In doing so, this\nwork highlights both the insights gained from exploring model-based approaches\nin the context of prior behavioral operations management literature and\nemphasizes the complementary nature of model-based and model-free approaches in\napproaching behaviorally grounded supply chain management problems.",
      "published": "2022-02-25",
      "categories": [
        "cs.LG",
        "cs.HC",
        "cs.SY",
        "eess.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2202.12786v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2111.03111v1",
      "title": "Modeling and Control of an Omnidirectional Micro Aerial Vehicle Equipped with a Soft Robotic Arm",
      "authors": [
        "Róbert Szász",
        "Mike Allenspach",
        "Minghao Han",
        "Marco Tognon",
        "Robert. K. Katzschmann"
      ],
      "abstract": "Flying manipulators are aerial drones with attached rigid-bodied robotic arms\nand belong to the latest and most actively developed research areas in\nrobotics. The rigid nature of these arms often lack compliance, flexibility,\nand smoothness in movement. This work proposes to use a soft-bodied robotic arm\nattached to an omnidirectional micro aerial vehicle (OMAV) to leverage the\ncompliant and flexible behavior of the arm, while remaining maneuverable and\ndynamic thanks to the omnidirectional drone as the floating base. The\nunification of the arm with the drone poses challenges in the modeling and\ncontrol of such a combined platform; these challenges are addressed with this\nwork. We propose a unified model for the flying manipulator based on three\nmodeling principles: the Piecewise Constant Curvature (PCC) and Augmented Rigid\nBody Model (ARBM) hypotheses for modeling soft continuum robots and a\nfloating-base approach borrowed from the traditional rigid-body robotics\nliterature. To demonstrate the validity and usefulness of this parametrisation,\na hierarchical model-based feedback controller is implemented. The controller\nis verified and evaluated in simulation on various dynamical tasks, where the\nnullspace motions, disturbance recovery, and trajectory tracking capabilities\nof the platform are examined and validated. The soft flying manipulator\nplatform could open new application fields in aerial construction, goods\ndelivery, human assistance, maintenance, and warehouse automation.",
      "published": "2021-11-04",
      "categories": [
        "cs.RO",
        "cs.SY",
        "eess.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/2111.03111v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2107.00822v1",
      "title": "F-LOAM: Fast LiDAR Odometry And Mapping",
      "authors": [
        "Han Wang",
        "Chen Wang",
        "Chun-Lin Chen",
        "Lihua Xie"
      ],
      "abstract": "Simultaneous Localization and Mapping (SLAM) has wide robotic applications\nsuch as autonomous driving and unmanned aerial vehicles. Both computational\nefficiency and localization accuracy are of great importance towards a good\nSLAM system. Existing works on LiDAR based SLAM often formulate the problem as\ntwo modules: scan-to-scan match and scan-to-map refinement. Both modules are\nsolved by iterative calculation which are computationally expensive. In this\npaper, we propose a general solution that aims to provide a computationally\nefficient and accurate framework for LiDAR based SLAM. Specifically, we adopt a\nnon-iterative two-stage distortion compensation method to reduce the\ncomputational cost. For each scan input, the edge and planar features are\nextracted and matched to a local edge map and a local plane map separately,\nwhere the local smoothness is also considered for iterative pose optimization.\nThorough experiments are performed to evaluate its performance in challenging\nscenarios, including localization for a warehouse Automated Guided Vehicle\n(AGV) and a public dataset on autonomous driving. The proposed method achieves\na competitive localization accuracy with a processing rate of more than 10 Hz\nin the public dataset evaluation, which provides a good trade-off between\nperformance and computational cost for practical applications.",
      "published": "2021-07-02",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2107.00822v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2101.06409v1",
      "title": "Shape Back-Projection In 3D Scenes",
      "authors": [
        "Ashish Kumar",
        "L. Behera"
      ],
      "abstract": "In this work, we propose a novel framework shape back-projection for\ncomputationally efficient point cloud processing in a probabilistic manner. The\nprimary component of the technique is shape histogram and a back-projection\nprocedure. The technique measures similarity between 3D surfaces, by analyzing\ntheir geometrical properties. It is analogous to color back-projection which\nmeasures similarity between images, simply by looking at their color\ndistributions. In the overall process, first, shape histogram of a sample\nsurface (e.g. planar) is computed, which captures the profile of surface\nnormals around a point in form of a probability distribution. Later, the\nhistogram is back-projected onto a test surface and a likelihood score is\nobtained. The score depicts that how likely a point in the test surface behaves\nsimilar to the sample surface, geometrically. Shape back-projection finds its\napplication in binary surface classification, high curvature edge detection in\nunorganized point cloud, automated point cloud labeling for 3D-CNNs\n(convolutional neural network) etc. The algorithm can also be used for\nreal-time robotic operations such as autonomous object picking in warehouse\nautomation, ground plane extraction for autonomous vehicles and can be deployed\neasily on computationally limited platforms (UAVs).",
      "published": "2021-01-16",
      "categories": [
        "cs.CV",
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2101.06409v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2010.08184v3",
      "title": "PRIMAL2: Pathfinding via Reinforcement and Imitation Multi-Agent Learning -- Lifelong",
      "authors": [
        "Mehul Damani",
        "Zhiyao Luo",
        "Emerson Wenzel",
        "Guillaume Sartoretti"
      ],
      "abstract": "Multi-agent path finding (MAPF) is an indispensable component of large-scale\nrobot deployments in numerous domains ranging from airport management to\nwarehouse automation. In particular, this work addresses lifelong MAPF (LMAPF)\n- an online variant of the problem where agents are immediately assigned a new\ngoal upon reaching their current one - in dense and highly structured\nenvironments, typical of real-world warehouse operations. Effectively solving\nLMAPF in such environments requires expensive coordination between agents as\nwell as frequent replanning abilities, a daunting task for existing coupled and\ndecoupled approaches alike. With the purpose of achieving considerable agent\ncoordination without any compromise on reactivity and scalability, we introduce\nPRIMAL2, a distributed reinforcement learning framework for LMAPF where agents\nlearn fully decentralized policies to reactively plan paths online in a\npartially observable world. We extend our previous work, which was effective in\nlow-density sparsely occupied worlds, to highly structured and constrained\nworlds by identifying behaviors and conventions which improve implicit agent\ncoordination, and enable their learning through the construction of a novel\nlocal agent observation and various training aids. We present extensive results\nof PRIMAL2 in both MAPF and LMAPF environments and compare its performance to\nstate-of-the-art planners in terms of makespan and throughput. We show that\nPRIMAL2 significantly surpasses our previous work and performs comparably to\nthese baselines, while allowing real-time re-planning and scaling up to 2048\nagents.",
      "published": "2020-10-16",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/2010.08184v3",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2008.07486v1",
      "title": "A decision integration strategy for short-term demand forecasting and ordering for red blood cell components",
      "authors": [
        "Na Li",
        "Fei Chiang",
        "Douglas G. Down",
        "Nancy M. Heddle"
      ],
      "abstract": "Blood transfusion is one of the most crucial and commonly administered\ntherapeutics worldwide. The need for more accurate and efficient ways to manage\nblood demand and supply is an increasing concern. Building a technology-based,\nrobust blood demand and supply chain that can achieve the goals of reducing\nordering frequency, inventory level, wastage and shortage, while maintaining\nthe safety of blood usage, is essential in modern healthcare systems. In this\nstudy, we summarize the key challenges in current demand and supply management\nfor red blood cells (RBCs). We combine ideas from statistical time series\nmodeling, machine learning, and operations research in developing an ordering\ndecision strategy for RBCs, through integrating a hybrid demand forecasting\nmodel using clinical predictors and a data-driven multi-period inventory\nproblem considering inventory and reorder constraints. We have applied the\nintegrated ordering strategy to the blood inventory management system in\nHamilton, Ontario using a large clinical database from 2008 to 2018. The\nproposed hybrid demand forecasting model provides robust and accurate\npredictions, and identifies important clinical predictors for short-term RBC\ndemand forecasting. Compared with the actual historical data, our integrated\nordering strategy reduces the inventory level by 40% and decreases the ordering\nfrequency by 60%, with low incidence of shortages and wastage due to\nexpiration. If implemented successfully, our proposed strategy can achieve\nsignificant cost savings for healthcare systems and blood suppliers. The\nproposed ordering strategy is generalizable to other blood products or even\nother perishable products.",
      "published": "2020-08-17",
      "categories": [
        "stat.AP",
        "math.OC"
      ],
      "pdf_url": "http://arxiv.org/pdf/2008.07486v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/2006.02040v1",
      "title": "SD-FFR: Software Defined Fast Failure Recovery Mechanism in the Automatic Warehouse",
      "authors": [
        "Ting-Cian Bai",
        "Chin-Ya Huang"
      ],
      "abstract": "Due to the rapid development of IoT technology, automatic guided vehicles\n(AGVs) interact with an industrial control system (ICS) through the wireless\nnetwork to support the freight distribution in the automated warehouse.\nHowever, the message exchange among AGVs and the ICS would experience large\npacket loss or long transmission delay, in the presence of wireless network\nlink failure and link congestion. Therefore, the performance of warehouse\nautomation would be degraded. In this paper, we propose the Software Defined\nFast Failure Recovery(SD-FFR) mechanism, aiming to improve network reliability\nand avoid link congestion caused by load unbalance. With SD-FFR, when link\nfailure occurs, the SDN controller actively detects the link failure within\nmilliseconds, and then reroutes the affected traffic flows accordingly. The\nproposed SD-FFR mechanism also takes load balance into consideration in\nselecting routing paths when a new traffic flow joins or link failure occurs in\nthe network. The evaluation results show that network performance can be time\nefficiently improved.",
      "published": "2020-06-03",
      "categories": [
        "cs.NI"
      ],
      "pdf_url": "http://arxiv.org/pdf/2006.02040v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1912.04034v2",
      "title": "Novel Approach for Solving a Variant of Equal Flow Problem",
      "authors": [
        "Sasikanth Goteti",
        "Swapnil Kumar"
      ],
      "abstract": "In this article we consider a certain sub class of Integer Equal Flow\nproblem, which are known NP hard [8]. Currently there exist no direct solutions\nfor the same. It is a common problem in various inventory management systems.\nHere we discuss a local minima solution which uses projection of the convex\nspaces to resolve the equal flows and turn the problem into a known linear\ninteger programming or constraint satisfaction problem which have reasonable\nknown solutions and can be effectively solved using simplex or other standard\noptimization strategies.",
      "published": "2019-12-09",
      "categories": [
        "cs.AI",
        "cs.NE"
      ],
      "pdf_url": "http://arxiv.org/pdf/1912.04034v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1911.02510v1",
      "title": "Smart Inventory Management System for Photovoltaic-Powered Freezer Using Wireless Sensor Network",
      "authors": [
        "Janus Jade A. Basa",
        "Patrick Lourenz G. Cu",
        "Nathaniel N. Malabag",
        "Luigi Angelo V. Naag",
        "Dan Frederico P. Abacco",
        "Mar Jun M. Siquihod",
        "Gilfred Allen Madrigal",
        "Lean Karlo S. Tolentino"
      ],
      "abstract": "An inventory management system for the freezer powered by photovoltaic panels\nwas developed in this study. It aims to promote energy efficiency and the\nresponsible use of food. Its sensor network is an Arduino-based wireless\nnetwork of sensors on a solar-powered freezer that is used to develop a smart\ninventory management system that is accessible and is easy to use. By having\nnetwork of sensors implemented inside the freezer, the inventory of perishable\nand non-perishable items can easily be monitored without having to physically\ncheck the inside of the freezer. In connection with this, a complemental\nAndroid application was developed that would receive and display the data sent\nfrom the sensor network through GSM Shield SIM800L.",
      "published": "2019-11-04",
      "categories": [
        "eess.SP"
      ],
      "pdf_url": "http://arxiv.org/pdf/1911.02510v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1910.01240v1",
      "title": "Deep Reinforcement Learning for Single-Shot Diagnosis and Adaptation in Damaged Robots",
      "authors": [
        "Shresth Verma",
        "Haritha S. Nair",
        "Gaurav Agarwal",
        "Joydip Dhar",
        "Anupam Shukla"
      ],
      "abstract": "Robotics has proved to be an indispensable tool in many industrial as well as\nsocial applications, such as warehouse automation, manufacturing, disaster\nrobotics, etc. In most of these scenarios, damage to the agent while\naccomplishing mission-critical tasks can result in failure. To enable robotic\nadaptation in such situations, the agent needs to adopt policies which are\nrobust to a diverse set of damages and must do so with minimum computational\ncomplexity. We thus propose a damage aware control architecture which diagnoses\nthe damage prior to gait selection while also incorporating domain\nrandomization in the damage space for learning a robust policy. To implement\ndamage awareness, we have used a Long Short Term Memory based supervised\nlearning network which diagnoses the damage and predicts the type of damage.\nThe main novelty of this approach is that only a single policy is trained to\nadapt against a wide variety of damages and the diagnosis is done in a single\ntrial at the time of damage.",
      "published": "2019-10-02",
      "categories": [
        "cs.LG",
        "cs.AI",
        "cs.RO",
        "stat.ML"
      ],
      "pdf_url": "http://arxiv.org/pdf/1910.01240v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1909.05426v1",
      "title": "Tactile-Based Insertion for Dense Box-Packing",
      "authors": [
        "Siyuan Dong",
        "Alberto Rodriguez"
      ],
      "abstract": "We study the problem of using high-resolution tactile sensors to control the\ninsertion of objects in a box-packing scenario. We propose a new system based\non a tactile sensor GelSlim for the dense packing task. In this paper, we\npropose an insertion strategy that leverages tactile sensing to: 1) safely\nprobe the box with the grasped object while monitoring incipient slip to\nmaintain a stable grasp on the object. 2) estimate and correct for residual\nposition uncertainties to insert the object into a designated gap without\ndisturbing the environment.\n  Our proposed methodology is based on two neural networks that estimate the\nerror direction and error magnitude, from a stream of tactile imprints,\nacquired by two GelSlim fingers, during the insertion process. The system is\ntrained on four objects with basic geometric shapes, which we show generalizes\nto four other common objects. Based on the estimated positional errors, a\nheuristic controller iteratively adjusts the position of the object and\neventually inserts it successfully without requiring prior knowledge of the\ngeometry of the object. The key insight is that dense tactile feedback contains\nuseful information with respect to the contact interaction between the grasped\nobject and its environment. We achieve high success rate and show that unknown\nobjects can be inserted with an average of 6 attempts of the probe-correct\nloop. The method's ability to generalize to novel objects makes it a good fit\nfor box packing in warehouse automation.",
      "published": "2019-09-12",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/1909.05426v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1905.08041v1",
      "title": "Inventory Management - A Case Study with NetLogo",
      "authors": [
        "Rui Portocarrero Sarmento"
      ],
      "abstract": "Multi-Agent Systems (MAS) have been applied to several areas or tasks ranging\nfrom energy networks controlling to robot soccer teams. MAS are the ideal\nsolution when they provide decision support in situations where human decision\nand actions are not feasible to operate the system in control and in real-time.\nThus, we present a case study that is related to dynamic simulation of an\nautomatic inventory management system. We provide two types of agents, the\nclients, and the seller agents. Through a system of communication, the agents\nexchange messages to fulfill their inventory needs. The client agents trade\nproducts in quantities according to their needs and rely on seller agents if\nother clients in the retailer chain cannot provide the needed items.\nAdditionally, it is expected that the trading between a client and the sellers\nis done through a reverted type of auction. This case study MAS uses BDI and\nFIPA-ACL in its implementation resulting in a clear simulation of the system.\nWe expect to provide a comparison between two distinct situations. One with\nonly external transactions with providers, and a situation where both internal\nand external transactions are allowed.",
      "published": "2019-04-10",
      "categories": [
        "cs.MA"
      ],
      "pdf_url": "http://arxiv.org/pdf/1905.08041v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1904.08494v2",
      "title": "Learning 2D to 3D Lifting for Object Detection in 3D for Autonomous Vehicles",
      "authors": [
        "Siddharth Srivastava",
        "Frederic Jurie",
        "Gaurav Sharma"
      ],
      "abstract": "We address the problem of 3D object detection from 2D monocular images in\nautonomous driving scenarios. We propose to lift the 2D images to 3D\nrepresentations using learned neural networks and leverage existing networks\nworking directly on 3D data to perform 3D object detection and localization. We\nshow that, with carefully designed training mechanism and automatically\nselected minimally noisy data, such a method is not only feasible, but gives\nhigher results than many methods working on actual 3D inputs acquired from\nphysical sensors. On the challenging KITTI benchmark, we show that our 2D to 3D\nlifted method outperforms many recent competitive 3D networks while\nsignificantly outperforming previous state-of-the-art for 3D detection from\nmonocular images. We also show that a late fusion of the output of the network\ntrained on generated 3D images, with that trained on real 3D images, improves\nperformance. We find the results very interesting and argue that such a method\ncould serve as a highly reliable backup in case of malfunction of expensive 3D\nsensors, if not potentially making them redundant, at least in the case of low\nhuman injury risk autonomous navigation scenarios like warehouse automation.",
      "published": "2019-03-27",
      "categories": [
        "cs.CV"
      ],
      "pdf_url": "http://arxiv.org/pdf/1904.08494v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1903.02489v2",
      "title": "GQ-STN: Optimizing One-Shot Grasp Detection based on Robustness Classifier",
      "authors": [
        "Alexandre Gariépy",
        "Jean-Christophe Ruel",
        "Brahim Chaib-draa",
        "Philippe Giguère"
      ],
      "abstract": "Grasping is a fundamental robotic task needed for the deployment of household\nrobots or furthering warehouse automation. However, few approaches are able to\nperform grasp detection in real time (frame rate). To this effect, we present\nGrasp Quality Spatial Transformer Network (GQ-STN), a one-shot grasp detection\nnetwork. Being based on the Spatial Transformer Network (STN), it produces not\nonly a grasp configuration, but also directly outputs a depth image centered at\nthis configuration. By connecting our architecture to an externally-trained\ngrasp robustness evaluation network, we can train efficiently to satisfy a\nrobustness metric via the backpropagation of the gradient emanating from the\nevaluation network. This removes the difficulty of training detection networks\non sparsely annotated databases, a common issue in grasping. We further propose\nto use this robustness classifier to compare approaches, being more reliable\nthan the traditional rectangle metric. Our GQ-STN is able to detect robust\ngrasps on the depth images of the Dex-Net 2.0 dataset with 92.4 % accuracy in a\nsingle pass of the network. We finally demonstrate in a physical benchmark that\nour method can propose robust grasps more often than previous sampling-based\nmethods, while being more than 60 times faster.",
      "published": "2019-03-06",
      "categories": [
        "cs.RO",
        "cs.CV",
        "cs.LG"
      ],
      "pdf_url": "http://arxiv.org/pdf/1903.02489v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1812.00569v1",
      "title": "Conceptual Modeling of Inventory Management Processes as a Thinging Machine",
      "authors": [
        "Sabah Al-Fedaghi",
        "Nourah Al-Huwais"
      ],
      "abstract": "A control model is typically classified into three forms: conceptual,\nmathematical and simulation (computer). This paper analyzes a conceptual\nmodeling application with respect to an inventory management system. Today,\nmost organizations utilize computer systems for inventory control that provide\nprotection when interruptions or breakdowns occur within work processes.\nModeling the inventory processes is an active area of research that utilizes\nmany diagrammatic techniques, including data flow diagrams, Universal Modeling\nLanguage (UML) diagrams and Integration DEFinition (IDEF). We claim that\ncurrent conceptual modeling frameworks lack uniform notions and have inability\nto appeal to designers and analysts. We propose modeling an inventory system as\nan abstract machine, called a Thinging Machine (TM), with five operations:\ncreation, processing, receiving, releasing and transferring. The paper provides\nside-by-side contrasts of some existing examples of conceptual modeling\nmethodologies that apply to TM. Additionally, TM is applied in a case study of\nan actual inventory system that uses IBM Maximo. The resulting conceptual\ndepictions point to the viability of FM as a valuable tool for developing a\nhigh-level representation of inventory processes.",
      "published": "2018-12-03",
      "categories": [
        "cs.SE"
      ],
      "pdf_url": "http://arxiv.org/pdf/1812.00569v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1809.06628v1",
      "title": "Fast Autonomous Flight in Warehouses for Inventory Applications",
      "authors": [
        "Marius Beul",
        "David Droeschel",
        "Matthias Nieuwenhuisen",
        "Jan Quenzel",
        "Sebastian Houben",
        "Sven Behnke"
      ],
      "abstract": "The past years have shown a remarkable growth in use-cases for micro aerial\nvehicles (MAVs). Conceivable indoor applications require highly robust\nenvironment perception, fast reaction to changing situations, and stable\nnavigation, but reliable sources of absolute positioning like GNSS or compass\nmeasurements are unavailable during indoor flights. We present a\nhigh-performance autonomous inventory MAV for operation inside warehouses. The\nMAV navigates along warehouse aisles and detects the placed stock in the\nshelves alongside its path with a multimodal sensor setup containing an RFID\nreader and two high-resolution cameras. We describe in detail the SLAM pipeline\nbased on a 3D lidar, the setup for stock recognition, the mission planning and\ntrajectory generation, as well as a low-level routine for avoidance of\ndynamical or previously unobserved obstacles. Experiments were performed in an\noperative warehouse of a logistics provider, in which an external warehouse\nmanagement system provided the MAV with high-level inspection missions that are\nexecuted fully autonomously.",
      "published": "2018-09-18",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/1809.06628v1",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1809.03531v3",
      "title": "PRIMAL: Pathfinding via Reinforcement and Imitation Multi-Agent Learning",
      "authors": [
        "Guillaume Sartoretti",
        "Justin Kerr",
        "Yunfei Shi",
        "Glenn Wagner",
        "T. K. Satish Kumar",
        "Sven Koenig",
        "Howie Choset"
      ],
      "abstract": "Multi-agent path finding (MAPF) is an essential component of many\nlarge-scale, real-world robot deployments, from aerial swarms to warehouse\nautomation. However, despite the community's continued efforts, most\nstate-of-the-art MAPF planners still rely on centralized planning and scale\npoorly past a few hundred agents. Such planning approaches are maladapted to\nreal-world deployments, where noise and uncertainty often require paths be\nrecomputed online, which is impossible when planning times are in seconds to\nminutes. We present PRIMAL, a novel framework for MAPF that combines\nreinforcement and imitation learning to teach fully-decentralized policies,\nwhere agents reactively plan paths online in a partially-observable world while\nexhibiting implicit coordination. This framework extends our previous work on\ndistributed learning of collaborative policies by introducing demonstrations of\nan expert MAPF planner during training, as well as careful reward shaping and\nenvironment sampling. Once learned, the resulting policy can be copied onto any\nnumber of agents and naturally scales to different team sizes and world\ndimensions. We present results on randomized worlds with up to 1024 agents and\ncompare success rates against state-of-the-art MAPF planners. Finally, we\nexperimentally validate the learned policies in a hybrid simulation of a\nfactory mockup, involving both real-world and simulated robots.",
      "published": "2018-09-10",
      "categories": [
        "cs.RO"
      ],
      "pdf_url": "http://arxiv.org/pdf/1809.03531v3",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1805.08564v2",
      "title": "A 2D laser rangefinder scans dataset of standard EUR pallets",
      "authors": [
        "Ihab S. Mohamed",
        "Alessio Capitanelli",
        "Fulvio Mastrogiovanni",
        "Stefano Rovetta",
        "Renato Zaccaria"
      ],
      "abstract": "In the past few years, the technology of automated guided vehicles (AGVs) has\nnotably advanced. In particular, in the context of factory and warehouse\nautomation, different approaches have been presented for detecting and\nlocalizing pallets inside warehouses and shop-floor environments. In a related\nresearch paper [1], we show that an AGVs can detect, localize, and track\npallets using machine learning techniques based only on the data of an on-board\n2D laser rangefinder. Such sensor is very common in industrial scenarios due to\nits simplicity and robustness, but it can only provide a limited amount of\ndata. Therefore, it has been neglected in the past in favor of more complex\nsolutions. In this paper, we release to the community the data we collected in\n[1] for further research activities in the field of pallet localization and\ntracking. The dataset comprises a collection of 565 2D scans from real-world\nenvironments, which are divided into 340 samples where pallets are present, and\n225 samples where they are not. The data have been manually labelled and are\nprovided in different formats.",
      "published": "2018-05-22",
      "categories": [
        "cs.RO",
        "cs.CV",
        "68T40"
      ],
      "pdf_url": "http://arxiv.org/pdf/1805.08564v2",
      "source": "ArXiv"
    },
    {
      "id": "http://arxiv.org/abs/1804.03810v1",
      "title": "Privacy Verification in POMDPs via Barrier Certificates",
      "authors": [
        "Mohamadreza Ahmadi",
        "Bo Wu",
        "Hai Lin",
        "Ufuk Topcu"
      ],
      "abstract": "Privacy is an increasing concern in cyber-physical systems that operates over\na shared network. In this paper, we propose a method for privacy verification\nof cyber- physical systems modeled by Markov decision processes (MDPs) and\npartially-observable Markov decision processes (POMDPs) based on barrier\ncertificates. To this end, we consider an opacity-based notion of privacy,\nwhich is characterized by the beliefs in system states. We show that the belief\nupdate equations can be represented as discrete-time switched systems, for\nwhich we propose a set of conditions for privacy verification in terms of\nbarrier certificates. We further demonstrate that, for MDPs and for POMDPs,\nprivacy verification can be computationally implemented by solving a set of\nsemi-definite programs and sum-of-squares programs, respectively. The method is\nillustrated by an application to privacy verification of an inventory\nmanagement system.",
      "published": "2018-04-11",
      "categories": [
        "cs.SY"
      ],
      "pdf_url": "http://arxiv.org/pdf/1804.03810v1",
      "source": "ArXiv"
    }
  ]
}