{
  "source": "ArXiv",
  "filename": "013_Bridging_Hard_and_Soft__Mechanical_Metamaterials_E.pdf",
  "total_chars": 60135,
  "total_chunks": 82,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nBridging Hard and Soft: Mechanical Metamaterials\nEnable Rigid Torque Transmission in Soft Robots\nMolly Carton,1,2† Jakub F. Kowalewski,3† Jiani Guo4, Jacob F. Alpert3, Aman Garg,4\nDaniel Revier,5 and Jeffrey Ian Lipton3∗\n1DepartmentofMechanicalEngineering,MassachusettsInstituteofTechnology\n77MassachusettsAve.,Cambridge,MA02139,USA\n2DepartmentofMechanicalEngineering,UniversityofMaryland\n4289CampusDr.,CollegePark,MD20742,USA\n3DepartmentofMechanicalandIndustrialEngineering,NortheasternUniversity\n390HuntingtonAve.,Boston,MA02115,USA\n4DepartmentofMechanicalEngineering,UniversityofWashington\n3900EStevensWayNE,Seattle,WA98195,USA\n5DepartmentofComputerScience,UniversityofWashington\n185EStevensWayNE,Seattle,WA98195,USA\n∗Towhomcorrespondenceshouldbeaddressed;E-mail: j.lipton@northeastern.edu\n†Theseauthorscontributedequallytothiswork. Torque and continuous rotation are fundamental methods of actuation and\nmanipulation in rigid robots.",
      "size": 951,
      "sentences": 2
    },
    {
      "id": 2,
      "content": "nceshouldbeaddressed;E-mail: j.lipton@northeastern.edu\n†Theseauthorscontributedequallytothiswork. Torque and continuous rotation are fundamental methods of actuation and\nmanipulation in rigid robots. Soft robot arms use soft materials and struc-\nturestomimicthepassivecomplianceofbiologicalarmsthatbendandextend. Thisuseofcompliancepreventssoftarmsfromcontinuouslytransmittingand\nexerting torques to interact with their environment. Here, we show how re-\nlying on patterning structures instead of inherent material properties allows\nsoft robotic arms to remain compliant while continuously transmitting torque\nto their environment. We demonstrate a soft robotic arm made from a pair of\n1\n4202\nceD\n3\n]OR.sc[\n1v05620.2142:viXra\n=== 페이지 2 ===\nmechanical metamaterials that act as compliant constant-velocity joints. The\njoints are up to 52 times stiffer in torsion than bending and can bend up to\n45◦. This robot arm can continuously transmit torque while deforming in all\nother directions.",
      "size": 987,
      "sentences": 8
    },
    {
      "id": 3,
      "content": "onstant-velocity joints. The\njoints are up to 52 times stiffer in torsion than bending and can bend up to\n45◦. This robot arm can continuously transmit torque while deforming in all\nother directions. The arm’s mechanical design achieves high motion repeata-\nbility (0.4 mm and 0.1◦) when tracking trajectories. We then trained a neural\nnetwork to learn the inverse kinematics, enabling us to program the arm to\ncomplete tasks that are challenging for existing soft robots such as installing\nlight bulbs, fastening bolts, and turning valves. The arm’s passive compliance\nmakesitsafearoundhumansandprovidesasourceofmechanicalintelligence,\nenabling it to adapt to misalignment when manipulating objects. This work\nwillbridgethegapbetweenhardandsoftroboticswithapplicationsinhuman\nassistance,warehouseautomation,andextremeenvironments. One Sentence Summary We present a soft robot arm that can exert continuous torques based\nonamechanicalmetamaterial.",
      "size": 947,
      "sentences": 8
    },
    {
      "id": 4,
      "content": "oticswithapplicationsinhuman\nassistance,warehouseautomation,andextremeenvironments. One Sentence Summary We present a soft robot arm that can exert continuous torques based\nonamechanicalmetamaterial. INTRODUCTION\nSoft robots leverage their distributed compliance to interact safely with humans (1) and the\nenvironment (2,3). However, entirely compliant robots struggle to twist objects and transmit\ncontinuous rotations. In applications such as reorienting parts in warehouse automation (4),\nfastening bolts during industrial assembly (5), or twisting multi-turn valves in extreme human-\nengineered environments (6), soft robots remain unequipped to exert the necessary torque to\nmanipulate their environment. For traditional robot arms, torque can be directly and continu-\nously transmitted through links due to their torsional stiffness.",
      "size": 839,
      "sentences": 6
    },
    {
      "id": 5,
      "content": "uipped to exert the necessary torque to\nmanipulate their environment. For traditional robot arms, torque can be directly and continu-\nously transmitted through links due to their torsional stiffness. While this makes rigid robots\nefficient at twisting tasks, they carry inherent safety risks due to high mass and stiffness, re-\nsultinginrobotsworkinginstructuredenvironmentsisolatedfromhumans. Bymimickingsoft\n2\n=== 페이지 3 ===\nFig. 1. TRUNCsconceptualoverview. Wepresentajointthatistorsionallyrigidyetcompliant\nin bending and extension. The joint can be directly connected to a motor to create soft torque\nactuators. Multiple joints can then be composed to create soft arms with continuous torque\nactuation. biological appendages such as elephant trunks (1,7–10) and octopus tentacles (11–15), soft\nrobot arms are not only safe around humans but can also move with high dexterity and adapt\nto environmental uncertainty.",
      "size": 918,
      "sentences": 10
    },
    {
      "id": 6,
      "content": "ppendages such as elephant trunks (1,7–10) and octopus tentacles (11–15), soft\nrobot arms are not only safe around humans but can also move with high dexterity and adapt\nto environmental uncertainty. Bio-inspired robots that combine bending with extension gain\nadditional agility over just bending (16,17). We need robot arms that combine the safety and\ndexterity of bending and extending with the utility of continuous torque transmission to work\ndirectlyalongsidehumans. Buildingsoftrobotsfromsoftmaterialsmakestorquetransmissioninherentlydifficult. Ma-\nterials such as elastomers are commonly used to build soft arms (18,19), but lack the torsional\nrigidity necessary for exerting torques. Existing flexible torque couplings, such as flex shafts\nand bellows, have significant limitations. Flex shafts have a high torsional rigidity and can\nbe directly embedded within soft robots (20), however, they are only compliant in bending,\nand thus restrict the robot from extending.",
      "size": 977,
      "sentences": 7
    },
    {
      "id": 7,
      "content": "limitations. Flex shafts have a high torsional rigidity and can\nbe directly embedded within soft robots (20), however, they are only compliant in bending,\nand thus restrict the robot from extending. Bellows, while able to bend and extend (21), are\n3\n=== 페이지 4 ===\ndifficult to nest and must sacrifice their range of motion for torsional stiffness. Alternatively,\ntwist actuation can be achieved by introducing chirality into a soft structure. Soft robots that\nuse pneumatic artificial muscles (PAMs) with angled fibers (22,23), inflatable helical struc-\ntures (24–26), vacuum powered elastomeric twist actuators (27–29), foldable origami (30,31),\nandhandedshearingauxetics(HSAs)(32,33)cantransmitrotationbutareallconfinedtoafinite\nrange of motion. These existing solutions cannot be continuously driven to transmit multiple\ntorqueswhileremainingflexibleinextensionandbending.",
      "size": 875,
      "sentences": 6
    },
    {
      "id": 8,
      "content": "s)(32,33)cantransmitrotationbutareallconfinedtoafinite\nrange of motion. These existing solutions cannot be continuously driven to transmit multiple\ntorqueswhileremainingflexibleinextensionandbending. Creating a soft robot arm that bends and extends, but is torsionally stiff, requires a material\nwith both soft and hard modes of deformation. Specifically, we need a material that is much\nstifferintwistingthaninbendingandextension. Biologicalstructures,suchasplants,havebeen\nobservedtoevolvelargedifferencesintorsionalandflexuralstiffnessasamethodofadaptingto\ndynamic environmental conditions (34–36). By altering their morphometric parameters (axial\nand polar second moment of inertia), many species of plants use the geometry of their stems\nandpetiolestocontroltherelativestiffnessoftheirdeformationmodes. Similarly,creatingsoft\nrobotswithalargestiffnessdifferentialbetweenflexureandtorsioncanbedonebytuningtheir\nelasticresponseatthegeometriclevel.",
      "size": 950,
      "sentences": 7
    },
    {
      "id": 9,
      "content": "lestocontroltherelativestiffnessoftheirdeformationmodes. Similarly,creatingsoft\nrobotswithalargestiffnessdifferentialbetweenflexureandtorsioncanbedonebytuningtheir\nelasticresponseatthegeometriclevel. Thisispossibleusingmechanicalmetamaterials,where\nmechanicalbehaviorisafunctionofbothmesoscalegeometryandmaterialproperties(37,38). Inthiswork,wepresentarobotmadefromamechanicalmetamaterialthatisstiffintorsion,\nyetsoftunderallotherdeformationmodes. WecallthesemetamaterialsTorsionallyRigidUni-\nversal Couplings (TRUNCs). A single coupling acts as a soft constant-velocity joint (Fig. S2). Multiple couplings can be connected in series and parallel to create nestable flex shafts that\ntransmit independent concentric torques along complex curves. We present an arm composed\nof these joints that can interface with common tools such as socket drivers and wrenches while\nremaining soft and safe around humans.",
      "size": 905,
      "sentences": 9
    },
    {
      "id": 10,
      "content": "ncentric torques along complex curves. We present an arm composed\nof these joints that can interface with common tools such as socket drivers and wrenches while\nremaining soft and safe around humans. By bending and extending like an elephant’s trunk,\nthearmincreasesitsworkspacesizeandgainsadditionalmovementdexterity. Ourcable-driven\n4\n=== 페이지 5 ===\narmachieveshighmovementrepeatabilityfortrajectories(0.4mmand0.1◦)whichoutperforms\nthecurrentstate-of-the-artforsoftmulti-stagearms(1). Finally,wedemonstratethereal-world\nutility of our arm by having it install a lightbulb, assist a human with fastening bolts, and turn\na shut-off valve. This work presents a robot arm that combines the safety and dexterity of soft\nrobotswiththeutilityoftheirrigidcounterparts. RESULTS\nDesign and mechanical analysis\nFlexiblestructuresforcontinuoustorquetransmissionshouldbedesignednestableandfocused\non achieving a high torsional stiffness without reducing the overall range of motion.",
      "size": 970,
      "sentences": 7
    },
    {
      "id": 11,
      "content": "esign and mechanical analysis\nFlexiblestructuresforcontinuoustorquetransmissionshouldbedesignednestableandfocused\non achieving a high torsional stiffness without reducing the overall range of motion. The pri-\nmaryexistingsolutions,bellows(21)andflexshafts(20),donotfullysatisfytheseperformance\nmetrics. Flex shafts are inextensible while bellows trade-off torsional rigidity with bending\nrangeofmotion(SeeSupplementaryMaterials). Weinsteadtakeinspirationfrommetamaterial\ndesign to demonstrate a family of materials to build soft robots. We introduce the Point Group\nAuxetics(PGA)tocreateTorsionallyRigidUniversalCouplings(TRUNCs). Conventional auxetics are often modeled as, and constructed of, rigid links that connect at\nrotational joints. Auxetics expand along a trajectory controlled by a single phase angle γ that\ndetermines the expansion of the unit cell (identified for each cell with an arc in Fig. 2).",
      "size": 910,
      "sentences": 8
    },
    {
      "id": 12,
      "content": "connect at\nrotational joints. Auxetics expand along a trajectory controlled by a single phase angle γ that\ndetermines the expansion of the unit cell (identified for each cell with an arc in Fig. 2). As the\nphase angle increases, the cell expands in multiple directions up to a maximum phase angle\nγ (32). The symmetries of an auxetic are denoted here using orbifold notation. Orbifolds\nmax\nandtheirassociatednotationdenoteasymmetrygroupbyitsgeneratingmanifold(39). The symmetry group building blocks for 3D structures are the 3D point groups. The 3D\npoint groups are those that preserve a point through a discrete set of translations and rotations,\nand as such, they are also the tilings of the surface of a sphere. They break down into two\nsubsets, 7 polyhedral groups and 7 axial point groups. The axial point groups preserve a single\n5\n=== 페이지 6 ===\nFig. 2. The two TRUNC variants and mechanical properties.",
      "size": 910,
      "sentences": 12
    },
    {
      "id": 13,
      "content": "ere. They break down into two\nsubsets, 7 polyhedral groups and 7 axial point groups. The axial point groups preserve a single\n5\n=== 페이지 6 ===\nFig. 2. The two TRUNC variants and mechanical properties. (A) The equatorial TRUNC\nhas a single band of joints along its equator (B) and the truss TRUNC has two bands of\njoints on either side of the equator. This doubled structure allows for shear internal to\nthecell,whichisdisallowedintheequatorialstructure. (C)Moment-rotationintwistand\nbending modes and force-displacement in extension for the equatorial cell (D) and truss\ncell demonstrates soft bending and extension compared to twist. (E) A truss TRUNC per-\nforming a screwing operation at various bend angles, demonstrating torque transmission\nwhilebending. Aninternalconicalspringprovidesrestoringforce. 6\n=== 페이지 7 ===\naxis of rotation. The preservation of an axis generates two poles and an equator and orients\nthe structure.",
      "size": 928,
      "sentences": 12
    },
    {
      "id": 14,
      "content": "e transmission\nwhilebending. Aninternalconicalspringprovidesrestoringforce. 6\n=== 페이지 7 ===\naxis of rotation. The preservation of an axis generates two poles and an equator and orients\nthe structure. Although the polyhedral groups are finite, the axial groups form infinite families\nwheretherotationalandmirrorsymmetriesaroundtheaxiscanvaryfrom2toinfinity(40). Because the axial point group structures have a pole and equator, they can have three basic\nrotationalresponses: Thepolescantwistrelativetoeachothertoproduceanettwist,theequator\nrotates relative to the polls, or there is no relative rotation. The 2∗N patterns, where N is any\npositive integer, maintain a structure along the equator of the sphere that connects to the poles,\nmakingthemrigidtotorsion. We use these patterns to define a design space of TRUNCs, which encompasses their kine-\nmatic, geometric, and material parameters. The kinematic design space is defined by the tiling\nof a unit cell.",
      "size": 960,
      "sentences": 9
    },
    {
      "id": 15,
      "content": "We use these patterns to define a design space of TRUNCs, which encompasses their kine-\nmatic, geometric, and material parameters. The kinematic design space is defined by the tiling\nof a unit cell. The unit cell’s geometry and properties are defined by the beam thickness and\nwidth (Fig. S1A) relative to the neutral radius, and the Young’s modulus (E) of the base mate-\nrial. ThesetogetherdeterminethemechanicalperformanceofaTRUNC. We design TRUNCs as tilings of the auxetic double arrowhead structure seen in Figure 2. While there are N tilings of the cell around the equator defined by the symmetry group 2∗N,\nthere can also be M tilings between the poles, where M can be any number 2 or larger (Fig. S1). As M increases beyond 2, additional internal degrees of freedom are introduced. We\ntherefore focus on two variations of the TRUNC joint that we call the equatorial (M = 2) and\ntruss(M = 3)designs,showninFig.2AandBrespectively.",
      "size": 936,
      "sentences": 10
    },
    {
      "id": 16,
      "content": "ditional internal degrees of freedom are introduced. We\ntherefore focus on two variations of the TRUNC joint that we call the equatorial (M = 2) and\ntruss(M = 3)designs,showninFig.2AandBrespectively. Both variants behave as a spherical mechanism on a sphere of non-fixed radius and act\nas constant velocity joints (see Supplementary Materials). The axial point group symmetry\n2∗N reduces the easy modes of deformation to: 1) extension/compression along the axis when\nunit elements are deformed axisymmetrically and 2) bending along the axis produced by an\nantisymmetric deformation of unit elements. Twisting along the axis is a stiff mode, allowing\ntransmission of rotation along composed axes. We choose a four-fold equatorial symmetry ∗4\n7\n=== 페이지 8 ===\nasitisthesimplestfamilywhichproducespairsofcellsforexpansionandcompressionineach\ndirection. Theinternalmodeofthetrussstructure(M=3)allowsshearinternaltothecell,which\ncan only be achieved through beam bending in the equatorial structure (Fig.",
      "size": 998,
      "sentences": 7
    },
    {
      "id": 17,
      "content": "fcellsforexpansionandcompressionineach\ndirection. Theinternalmodeofthetrussstructure(M=3)allowsshearinternaltothecell,which\ncan only be achieved through beam bending in the equatorial structure (Fig. 2 A and B). The\nresultiscellsthatcanextend,bend,andshearwhilebeingrigidtotorsion. We characterized the selective compliance of both TRUNC variants using the ratio of tor-\nsional stiffness to flexural stiffness. The twist-bend ratio can be expressed as GJ/EI using a\nspecimen’selasticmodulus(E),shearmodulus(G),axialsecondmomentofarea(I),andpolar\nsecond moment of area (J). We note that the twist-bend ratio is the inverse of the ratio used\nto study plants, which often aim to minimize torsional stiffness and maximize flexural rigid-\nity (35,41). We empirically characterize the flexural and torsional stiffness of both variants of\nthejoints.",
      "size": 842,
      "sentences": 8
    },
    {
      "id": 18,
      "content": "study plants, which often aim to minimize torsional stiffness and maximize flexural rigid-\nity (35,41). We empirically characterize the flexural and torsional stiffness of both variants of\nthejoints. Thejointswecharacterizedweremadewithspringsteel(seeMaterialsandMethods)\nandtheirstiffnessvalueswerefoundusinglinearregressiononthemoment-rotationdatashown\ninFig.2CandD.Ourresultsshowthatbothvariantsaresignificantlystifferintwistingthanin\nbending. The equatorial TRUNC (Fig. 2 left) has a twist-bend ratio of 11 and the truss variant\n(Fig. 2 right) has a ratio of 52. In simulation, we investigated the fabrication design space pa-\nrameters,definedbythematerialchoice,celldiameter,andlinkwidthandthickness. Wefound\nthatwhilethetwist-bendratioofbothcellsincreasedwithamaterial’selasticmodulus,thetruss\ncell was less sensitive to changes between stiff materials (Fig. S3).",
      "size": 869,
      "sentences": 9
    },
    {
      "id": 19,
      "content": "ldiameter,andlinkwidthandthickness. Wefound\nthatwhilethetwist-bendratioofbothcellsincreasedwithamaterial’selasticmodulus,thetruss\ncell was less sensitive to changes between stiff materials (Fig. S3). Furthermore, as the link’s\nwidth and height increase relative to the cell’s diameter, the twist-bend ratio increases, and the\nperformancegapbetweenbothcellvariantsbecomessmaller(seeSupplementaryMaterials). Duetotheirlargetwist-bendratios,TRUNCscanserveashighlyflexibletorquecouplings. They can bend up to 45◦ from the neutral state while remaining 85.7% efficient in torque and\nenergy transmission (Fig S6A). This gives them the flexibility of rubber bellows while remain-\ning much closer to the torsional rigidity of steel bellows, which can only bend up to 10◦. To\nillustrate the TRUNC’s torsional rigidity, we connected a truss joint to a power drill and drove\n8\n=== 페이지 9 ===\na screw into birch wood at various bend angles (Fig. 2G Movie S1).",
      "size": 946,
      "sentences": 9
    },
    {
      "id": 20,
      "content": "bend up to 10◦. To\nillustrate the TRUNC’s torsional rigidity, we connected a truss joint to a power drill and drove\n8\n=== 페이지 9 ===\na screw into birch wood at various bend angles (Fig. 2G Movie S1). A conical spring was\nadded inside the cell to provide a restoring force without transmitting any torsional load, as its\nrotational degree of freedom is not rigidly constrained. This demonstrates how the TRUNC’s\nlargetwist-bendratioenablestorquetransmissionthroughthehardmodewhileaccommodating\nmisalignment through the soft modes. To demonstrate the fatigue resistance of the cells we cy-\ncled7cellsthroughover6800cycleswithstrainsover10%withoutfailure(seeSupplementary\nMaterials). TRUNCs can be chained and nested\nThetwoTRUNCvariantswepreviouslyintroducedcanbecomposedintolargermetamaterials\nby connecting them in series or by concentrically nesting as shown in Fig. 3. When connected\ninseries,fixedaxis-to-axis,theTRUNCsactasaflexibleshaft,conveyingrotationalmotionand\ntorquealongacurvedpath.",
      "size": 992,
      "sentences": 9
    },
    {
      "id": 21,
      "content": "connecting them in series or by concentrically nesting as shown in Fig. 3. When connected\ninseries,fixedaxis-to-axis,theTRUNCsactasaflexibleshaft,conveyingrotationalmotionand\ntorquealongacurvedpath. WeshowhowaTRUNCmadeasacontinuousmaterialwithliving\nhinges can deform and transmit rotation. However, unlike traditional flex shafts, our design is\nextendable. When stretched by 20% of its length, the TRUNC flex shaft maintained 83.6% of\nits original torsional rigidity (Fig. 3B). Chained TRUNCs can mimic the extension of elephant\ntrunkswhilemaintainingtheirstifftorsionalcouplingproperties. Totransmitmultipleconcentrictorques,flexibletorquecouplingsshouldnestefficientlyin-\nside each other. Because TRUNCS are based on spherical geometry, they can easily be nested\nas a series of concentric shells with ample room for clearance. This concentric composition is\nlimited only by space, and can theoretically provide an infinite number of rotational degrees\nof freedom.",
      "size": 966,
      "sentences": 11
    },
    {
      "id": 22,
      "content": "s a series of concentric shells with ample room for clearance. This concentric composition is\nlimited only by space, and can theoretically provide an infinite number of rotational degrees\nof freedom. Nested TRUNCs bend and extend in unison but rotate independently (Fig. 3D). TRUNCs can be nested much more efficiently than bellows because more than 85% of their\nvolume is unoccupied, compared to 35% or less in bellows couplings (see Supplementary Ma-\nterials). When nested, a small cross-coupling effect exists between the cells due to friction\n9\n=== 페이지 10 ===\nFig. 3. Composition of TRUNCs. (A) Joints can be chained in series to create flex shafts\nthat transmit torque while bending and extending. (B) TRUNC flex shafts remain torsional\nrigid under extension. The shaded region represents the min and max bounds for N = 5\ntrials. (C) Joints can also be concentrically nested. Nested joints are coupled in bending and\nextension but (D) rotate independently.",
      "size": 961,
      "sentences": 13
    },
    {
      "id": 23,
      "content": "n. The shaded region represents the min and max bounds for N = 5\ntrials. (C) Joints can also be concentrically nested. Nested joints are coupled in bending and\nextension but (D) rotate independently. (E) Nested joints can be chained to create flex shafts\nthat transmit multiple torques. (F) Each column of the flex shaft rotates separately, allowing\nmultipleindependentrotationaldegreesoffreedom. 10\n=== 페이지 11 ===\nwithin the bearings of the assembly (Fig. S3). This allows nested TRUNCS to transmit multi-\npleindependenttorquesthroughthesamebendangle. When cells are nested and chained (Fig. 3E), they create a flex shaft that can transmit mul-\ntiple torques independently along its length. To demonstrate this, we connected the flex shaft\nto a rotational gauge with two indicator dials. We then independently controlled the dials by\nswitching the input torque between the inner and outer columns of the flex shaft (see Fig. 3\nand Movie S2).",
      "size": 942,
      "sentences": 13
    },
    {
      "id": 24,
      "content": "a rotational gauge with two indicator dials. We then independently controlled the dials by\nswitching the input torque between the inner and outer columns of the flex shaft (see Fig. 3\nand Movie S2). When the inner shaft is driven, the green dial moves, and the red remains still\neven as the arm deforms. When the outer shell is driven the inner green dial remains still. This\ndemonstrates that the drill is only weakly connected to the dial indicator in terms of position,\nwhile the torsional connection remains strong. This allows us to build couplings that move\nfreely through space while transmitting an arbitrary number of independent torques. Moving\nbeyondsoftmaterialstomechanicalmetamaterialsenablesustobuildtorquetransmissionsthat\nrigidlycoupleinputandoutputdriveswhileremainingflexibleinbendingandextension. A soft robotic arm composed of TRUNCs\nThe nested TRUNC flex shafts we produce above enable us to create soft robots capable of\ncontinuous torque actuation.",
      "size": 972,
      "sentences": 9
    },
    {
      "id": 25,
      "content": "hileremainingflexibleinbendingandextension. A soft robotic arm composed of TRUNCs\nThe nested TRUNC flex shafts we produce above enable us to create soft robots capable of\ncontinuous torque actuation. Our arm’s design rigidly couples the end effector to a drill motor\nstaticallymountedatthebaseusingatrussflexshaft. Thislayoutleveragesthebenefitsofdirect\nmotordriveswhilemaintainingtherobot’slowinertia. Thetrussflexshaftisthennestedwithin\nan equatorial shaft that guides the actuation tendons that control the arm (Fig. 4A). The cable\nactuationsystemusesnineservomotorsmountedatthebase. Theninecablelengthsdefinethe\narm’s configuration space L ∈ R9 and encode all possible arm poses. Cables attach to the arm\nat three active joints we call the shoulder, elbow, and wrist. The remaining joints connected in\nbetween are passive. In its neutral state L , the arm’s cables are minimally pre-tensioned to\nhome\na manually configured set point.",
      "size": 937,
      "sentences": 11
    },
    {
      "id": 26,
      "content": "l the shoulder, elbow, and wrist. The remaining joints connected in\nbetween are passive. In its neutral state L , the arm’s cables are minimally pre-tensioned to\nhome\na manually configured set point. An active joint can then be bent and compressed by varying\n11\n=== 페이지 12 ===\nFig. 4. Design and analysis of the TRUNC arm. (A) The body of the robotic arm consists\nof two nested flex shafts. Torque is transmitted to the end-effector using a drill motor mounted\nat the base. (B) A head-on view of the arm with the socket driver end effector. (C) The cables\nare connected via a structure that can bend and twist in-plane but resists out-of-plane bending. (D) The workspace was empirically measured by sampling 18,300 poses. The bounding hull is\nconcave and approximately symmetric about the z axis. A cross-sectional view shows how the\narmincreasesitsworkspacevolumebyextendingalongitslength.",
      "size": 890,
      "sentences": 13
    },
    {
      "id": 27,
      "content": "ured by sampling 18,300 poses. The bounding hull is\nconcave and approximately symmetric about the z axis. A cross-sectional view shows how the\narmincreasesitsworkspacevolumebyextendingalongitslength. (E)Thearm’spositionaland\nangular repeatability when visiting points in a random order (point precision) and (F) a fixed\norder(trajectoryprecision). Colormapsrepresentthestandarddeviation(SD)acrossfivetrials. 12\n=== 페이지 13 ===\nthe three corresponding cable lengths. This deformation is coupled to the passive joints above\nthe active joint, allowing smooth bending and compression along each arm segment. We use\nsprings to provide restoring forces that extend the arm as cable tension is released. The cables\nattach to the arm using spring structures that bend and twist in-plane, allowing them to remain\ncompliant to contact forces (Fig. 4C), but resist out-of-plane bending when actuated.",
      "size": 888,
      "sentences": 10
    },
    {
      "id": 28,
      "content": "eased. The cables\nattach to the arm using spring structures that bend and twist in-plane, allowing them to remain\ncompliant to contact forces (Fig. 4C), but resist out-of-plane bending when actuated. Our\narm design combines the advantages of soft bio-inspired arms with the utility of direct and\ncontinuoustorqueactuation. Bendingandextensionenablethearmtopositiontheendeffectorwithinasizableworkspace. We empirically measured the arm’s reachable workspace by recording the end effector’s posi-\ntion over a bounded sub-space of L consisting of 18,300 poses (see Materials and Methods). The boundaries of this subspace were found experimentally by driving the arm to extremal\nposes. The workspace was then reconstructed by fitting an alpha shape (α = 34.4 mm) to the\n3D point cloud, producing a concave hull with a volume of 18,272 cm3 (Fig. 4D). The projec-\ntion of the workspace onto the xy plane approximates a circle with a diameter of 600 mm or\n84.5% of the arm’s neutral length (l = 710 mm).",
      "size": 996,
      "sentences": 10
    },
    {
      "id": 29,
      "content": "cave hull with a volume of 18,272 cm3 (Fig. 4D). The projec-\ntion of the workspace onto the xy plane approximates a circle with a diameter of 600 mm or\n84.5% of the arm’s neutral length (l = 710 mm). The cross-sectional view of the xz projection\nshows the workspace is symmetric about the z axis and illustrates how the extension degree\nof freedom increases the total volume. We note that the workspace is thickest near the origin\nand becomes thinner near the edges. This thinning effect occurs because the arm undergoes\nadditionalcompressionwhilebending,whichreducesitsrangeofmotion. Fromourworkspace\nanalysis, we found that the arm can compress up to ∆l = 94.3 mm, or 13.3% of its length in\nthez direction,andtilttheendeffectorupto83.9◦ fromthegroundplane. Within this recorded workspace, we characterized the positional and angular repeatability\nof the arm’s movements. Due to non-linear and hysteretic effects, a soft robot’s state at any\ntimeisinfluencedbyitshistoryofpreviousstates(42).",
      "size": 992,
      "sentences": 9
    },
    {
      "id": 30,
      "content": "characterized the positional and angular repeatability\nof the arm’s movements. Due to non-linear and hysteretic effects, a soft robot’s state at any\ntimeisinfluencedbyitshistoryofpreviousstates(42). Thus,weusedseparateteststomeasure\nrepeatability for point positioning and trajectory following. We generated the test trajectory\n13\n=== 페이지 14 ===\nbyrandomlyselecting100configurationsandorderingthemusingK-nearestneighbors(KNN)\nas a greedy solution to the traveling salesman problem. The point repeatability test used the\nsamepointsbutrandomizedtheorderatthestartofeachtrial. Beforeeachtrial,thearmcycled\nfive times between its neutral and fully compressed state to reset any hysteretic effects from\nprevious tests. For each test, the arm visited the 100 points over five trials and we calculated\nthe translational and angular distance of each data point from its cluster’s mean. For point\npositioning, we found the standard deviation (SD) of the residual distances to be 2.1 mm and\n0.1◦ (Fig. 4E).",
      "size": 996,
      "sentences": 9
    },
    {
      "id": 31,
      "content": "e translational and angular distance of each data point from its cluster’s mean. For point\npositioning, we found the standard deviation (SD) of the residual distances to be 2.1 mm and\n0.1◦ (Fig. 4E). When tracking a trajectory, the SD decreased to 0.4 mm and 0.1◦ (Fig. 4F). With millimeter-level trajectory repeatability, our arm outperforms state-of-the-art multi-stage\nsoftarmsontrajectoryprecision(1). Experimental demonstration\nContinuous torque actuation can enable soft robots to perform a broader range of real-world\ntasks than their completely compliant counterparts. We trained a neural network to learn the\narm’s inverse kinematics (see Materials and Methods) and demonstrated the TRUNC arm in-\nstalling a light bulb, fastening bolts for a motherboard, and shutting off a valve. For these\nexperiments, we measured the position of target objects (see Materials and Methods) and then\nused the learned inverse kinematics model to generate each trajectory.",
      "size": 963,
      "sentences": 9
    },
    {
      "id": 32,
      "content": "and shutting off a valve. For these\nexperiments, we measured the position of target objects (see Materials and Methods) and then\nused the learned inverse kinematics model to generate each trajectory. In the first experimental\ndemonstration, the arm installed a light bulb into a lamp (Fig. 5A and Movie S3). Our end\neffector was a commercially available universal light bulb changer that grips the bulb using\nrubber-coated steel. The arm first positioned the bulb above the socket before lowering it into\nplace. Compliance enables the arm to passively align itself for peg-in-hole insertion tasks. The\narmleveragedthisbyextendingpastthetargetedzheighttoincreasetheinsertionforce,helping\nthe bulb’s threads engage once the bulb starts rotating. Once positioned within the socket, the\nbulb was rotated by 2 1 revolutions which completed the circuit and turned it on. The arm then\n2\n14\n=== 페이지 15 ===\nFig. 5. Demonstrating applications for the TRUNC arm. (A) Delicately installing a light\nbulbintoalamp.",
      "size": 1000,
      "sentences": 13
    },
    {
      "id": 33,
      "content": "y 2 1 revolutions which completed the circuit and turned it on. The arm then\n2\n14\n=== 페이지 15 ===\nFig. 5. Demonstrating applications for the TRUNC arm. (A) Delicately installing a light\nbulbintoalamp. Thearmpositionsthebulbandthenrotatesituntilthebulbturnson. (B)Safe\nhuman-robot collaboration for motherboard installation. The robot secured the board to the\nframe by fastening bolts while the human installed RAM modules. (C) Manipulating a valve\npositionedbetweentwoPVCpipestoshutoffairflow. 15\n=== 페이지 16 ===\ndisengaged with the bulb by pulling the end effector up before returning to the home position. This demonstrates that even using simple motion planning, the arm can carefully handle and\nmanipulatedelicateobjectsandperformcomplexfasteningoperations. In the next experiment, we used the TRUNC arm to work alongside a human and install a\nmotherboardonamountingframe(Fig.5BandMovieS4).",
      "size": 892,
      "sentences": 12
    },
    {
      "id": 34,
      "content": "and\nmanipulatedelicateobjectsandperformcomplexfasteningoperations. In the next experiment, we used the TRUNC arm to work alongside a human and install a\nmotherboardonamountingframe(Fig.5BandMovieS4). Theassemblybeganwiththehuman\nplacing the board on the stand-offs and pre-fastening the M6 bolts by two turns each while the\narmwaitednearby. Oncetheboardwasplaced,thearmreceivedacommandtobeginfastening\nboltsthatsecuredtheboardtoanaluminumframe. Asthearmfastenedbolts,thehumanworked\nalongsideitbyinstallingRAMmodules. Thearmwasprogrammedtopositionthesocketabove\neach fastener before plunging in the −z direction. The end effector’s universal socket adapter\n(Fig.4B)hasspring-loadedpinsthatdecoupletheneedforsimultaneousextensionandrotation\nduringthreadfasteningoperations. Thisenabledthearmtoholditspositionwhiletransmitting\ntorque to fasten each bolt by 73 revolutions. Automating this thread fastening sub-routine\n4\nallowedthehumanco-workertocontinueworkingsafelyinparallelwiththerobot.",
      "size": 987,
      "sentences": 9
    },
    {
      "id": 35,
      "content": "mtoholditspositionwhiletransmitting\ntorque to fasten each bolt by 73 revolutions. Automating this thread fastening sub-routine\n4\nallowedthehumanco-workertocontinueworkingsafelyinparallelwiththerobot. Finally, we showed how the arm can manipulate objects within constrained spaces. This\ndemonstrationsimulatedaleakscenariowherethearmhadtoreachandturnavalvepositioned\nbetween two pipes (Fig. 5C and Movie S5). We used a 3D-printed wrench end effector that\npassively grips and locks onto the valve once it begins turning. The arm’s continuous end\neffector rotation simplifies the task as the gripper does not need to disengage and reengage\nwhileoperatinginatightspace. Thearmcombinedbendingwithlineartranslationtoreachthe\nvalveandslidetheendeffectoroverit. Asmoothmotiontransitioninorientationwasachieved\nusing spherical linear interpolation between the home and target quaternions.",
      "size": 879,
      "sentences": 9
    },
    {
      "id": 36,
      "content": "bendingwithlineartranslationtoreachthe\nvalveandslidetheendeffectoroverit. Asmoothmotiontransitioninorientationwasachieved\nusing spherical linear interpolation between the home and target quaternions. Once engaged\nwith the valve, the arm applied 3 1 clockwise rotations which successfully shut off airflow as\n2\nindicatedbytheoutlet’sbluestreamers. Whileactuatingthevalve,thearmpassivelydeformed\ntocompensateformisalignmentbetweenthewrenchandvalve’scenterofrotation. 16\n=== 페이지 17 ===\nDISCUSSION\nWe presented the TRUNC arm, a flexible soft robot that possesses the utility of continuous\ntorqueactuation. Thearm’sdesignisbasedonapairofsoftextendableconstant-velocityjoints\ncapable of continuous torque actuation. We introduced and characterized two variants of the\njoint based on the same symmetry group. The joints achieved a wide range of motion in com-\npression and bending.",
      "size": 874,
      "sentences": 8
    },
    {
      "id": 37,
      "content": "le of continuous torque actuation. We introduced and characterized two variants of the\njoint based on the same symmetry group. The joints achieved a wide range of motion in com-\npression and bending. The selective compliance architected into their design, with a low axial\nand bending stiffness but high torsional rigidity, allows TRUNCs to be coupled with motors to\ncreatesoftactuatorsthatcantransmittorque. WeshowedhowcomposingTRUNCsenablesthemtotransmitmultipletorquesoverlonger\ndistances. Thefirstcompositionmethodconnectsjointsinseriestocreateflexibleshaftscapable\nof bending and extending, while nesting joints inside each other enabled concentric torque\ntransmission. Combining both methods, we created a nested flex shaft with two rotational\ndegreesoffreedomaboutthecentralaxisthatweindependentlyactuatedinFig. 3E. We applied these principles to create a soft arm with continuous torque actuation.",
      "size": 905,
      "sentences": 9
    },
    {
      "id": 38,
      "content": "ted a nested flex shaft with two rotational\ndegreesoffreedomaboutthecentralaxisthatweindependentlyactuatedinFig. 3E. We applied these principles to create a soft arm with continuous torque actuation. The\ncable-driven arm transmits torque to its end effector using a flexible TRUNC shaft connected\nto a motor mounted at its base. We demonstrated that the arm can compress up to 13.3% of\nits length and tilt the end effector up to 83.9◦ from the ground plane. The arm can position\nthe end effector within a large workspace by bending, compressing, and extending, and moves\nwithhighmotionrepeatabilityalongtrajectories(0.4mmand0.1◦). Thisenablesustoperform\nmanyreal-worldtasksthatwerepreviouslyinaccessibletosoftrobots. We chose three tasks to demonstrate the versatility of the TRUNC arm using different end\neffectors in different environments.",
      "size": 842,
      "sentences": 8
    },
    {
      "id": 39,
      "content": "stoperform\nmanyreal-worldtasksthatwerepreviouslyinaccessibletosoftrobots. We chose three tasks to demonstrate the versatility of the TRUNC arm using different end\neffectors in different environments. The first task, installing a light bulb, demonstrated that the\narm has the mobility to extend and twist while manipulating delicate objects and to passively\nalign itself when fastening threads. In the second, the arm works safely around a human to\n17\n=== 페이지 18 ===\ninstall electronic components. In the third task, the soft arm was able to navigate a close en-\nvironment to shut off a valve by rotating it continuously over multiple turns. Using selective\ncompliance, the arm combines flexibility with robust manipulation. This work bridges the gap\nbetweensoftandrigidrobotsbycombiningthesafetyofcompliantstructureswiththeutilityof\nrigidandcontinuoustorquetransmission.",
      "size": 870,
      "sentences": 7
    },
    {
      "id": 40,
      "content": "e arm combines flexibility with robust manipulation. This work bridges the gap\nbetweensoftandrigidrobotsbycombiningthesafetyofcompliantstructureswiththeutilityof\nrigidandcontinuoustorquetransmission. MATERIALS AND METHODS\nCell and arm fabrication\nThe monolithic flexure TRUNCs were printed on a Carbon M1 printer using FPU 50 resin. Spring steel TRUNCs were assembled from laser-cut 0.01” 1095 hardened spring steel. Tech-\nnicaldrawingsareprovidedinSupplementaryMaterials. Springsteelpartsweresandedaround\nthejointlocationstoexposethebaremetal,removingdefects,burs,andsurfacecoatings. Steel\nlinks were manually bent using a spherical mold with a 56 mm diameter for the truss cells and\nan 88 mm diameter mold for equatorial cells. The links were then assembled using M2 screws\nand nylon lock nuts. Chained cells were connected using a 4 mm steel rod press-fit into a bear-\ning (McMaster part ID: 6655K47) which was fastened to the cell with a 3D printed connector.",
      "size": 963,
      "sentences": 9
    },
    {
      "id": 41,
      "content": "g M2 screws\nand nylon lock nuts. Chained cells were connected using a 4 mm steel rod press-fit into a bear-\ning (McMaster part ID: 6655K47) which was fastened to the cell with a 3D printed connector. Heat-set threaded inserts were installed to fix the coupling shafts to the cells. Nesting cells,\nwereoffsetwithathrustbearing(McMasterpartID:6655K47)betweenthecontactingsurfaces\ntoreducefriction. We used nine Hitec HS-785HB winch servos for the cable actuation system. The home\nconfiguration (L ) was found during the arm’s setup by controlling each motor until its ca-\nhome\nble’s slack was removed. The cable attachment triads (Fig. 4C) were fabricated on a Prusa\nMK4extrusion3DprinterinPLA+. Thetriadstructuresroutethecablesthroughanembedded\nPolytetrafluoroethylene (PTFE) lining to reduce friction. Actuating cables are 0.75 mm syn-\nthetic braided cable.",
      "size": 857,
      "sentences": 10
    },
    {
      "id": 42,
      "content": "Prusa\nMK4extrusion3DprinterinPLA+. Thetriadstructuresroutethecablesthroughanembedded\nPolytetrafluoroethylene (PTFE) lining to reduce friction. Actuating cables are 0.75 mm syn-\nthetic braided cable. A conical spring (K = 1.22 N/mm) is mounted inside each cell with a\n18\n=== 페이지 19 ===\nfreelengthlongerthantheinnerspherediametersothatthecellsarepre-tensioned,providinga\nrestoring force for the arm. The arm also has six extension springs (K = 0.07 N/mm) for each\ncell that provide restorative forces when bending. Torque was transmitted to the end effector\nusing an 18V DC Milwaukee drill motor (connected to 2.15 V power supply) and was toggled\nusing a relay module. The motors and arm were mounted to a 0.25” aluminum base plate that\nwasfixturedtothemotioncapturebooth. Kinematic characterization using rotational encoders\nKinematic tests for the joints (Fig. 3D and Fig.",
      "size": 872,
      "sentences": 9
    },
    {
      "id": 43,
      "content": "tors and arm were mounted to a 0.25” aluminum base plate that\nwasfixturedtothemotioncapturebooth. Kinematic characterization using rotational encoders\nKinematic tests for the joints (Fig. 3D and Fig. S2) were conducted using two YUMO E6B2-\nCWZ3E rotational encoders connected to a National Instruments (NI) USB-6009 Data Acqui-\nsition (DAQ) unit. The input and output shafts were connected to separate encoders mounted\non a steel fixture plate and a 12V DC motor was then used to drive the input shaft. Data was\nsampledatarateof10,000HzandthequadraturesignalswerereadanddecodedinMATLAB. Mechanical characterization\nThe tensile, torsional, and flexural tests were performed using an Instron CCP122055 biaxial\nload cell ±450 N and ±5 N·m. For the spring steel TRUNCs, we applied WD-40 to the spring\nto reduce friction. In our bending and torsion tests, we rotated the cell by −5◦ before returning\nto the origin to reduce backlash effects.",
      "size": 936,
      "sentences": 9
    },
    {
      "id": 44,
      "content": "For the spring steel TRUNCs, we applied WD-40 to the spring\nto reduce friction. In our bending and torsion tests, we rotated the cell by −5◦ before returning\nto the origin to reduce backlash effects. Data was collected at intervals of 1◦ with an angular\nvelocity of 1 rev/min. In our extension tests, we pre-compressed the cell to −2 mm before\nreturning to the origin. Data was then collected at intervals of 0.2 mm with a linear velocity of\n0.5mm/s. Motion capture setup\nWe captured the ground truth pose of the arm using an OptiTrack motion capture system with\neightFlex13camerasandstreamedthedatatoMATLABusingNatNet. Theworkspacedataset\n19\n=== 페이지 20 ===\n(Fig. 4D) and trajectory tests (Fig. 9) tracked the end effector using the socket tool with four\nmarkers affixed at the base.",
      "size": 783,
      "sentences": 9
    },
    {
      "id": 45,
      "content": "streamedthedatatoMATLABusingNatNet. Theworkspacedataset\n19\n=== 페이지 20 ===\n(Fig. 4D) and trajectory tests (Fig. 9) tracked the end effector using the socket tool with four\nmarkers affixed at the base. Because the inverse model was trained on data collected with the\nsocket end effector, we measured a coordinate transformation for each new tool to compensate\nfor geometric differences when generating new trajectories. For our experimental demos (Fig. 5) we measured the position of the target objects (bolts, socket, and valve) using 3D printed\nmountsformotioncapturemarkerspriortotesting. Neural network training\nWe trained our inverse kinematic model on the workspace dataset (Fig. 4D), consisting of\n18,300 pairs of configuration states and end effector poses. Randomly sampling the configu-\nration space of cable-driven results in ill-defined configurations where the arm loses actuation\ndegrees of freedom due to slack or ‘dead-bands’ in the cables.",
      "size": 954,
      "sentences": 10
    },
    {
      "id": 46,
      "content": "r poses. Randomly sampling the configu-\nration space of cable-driven results in ill-defined configurations where the arm loses actuation\ndegrees of freedom due to slack or ‘dead-bands’ in the cables. Our learning approach sam-\npledLusinganapproximatekinematicmodel(seeSupplementaryMaterials)andrefinedthese\nconfigurations during the data collection process by slowly tensioning each cable until the end\neffector moved by more than 3 mm or 1◦. Additionally, we enforced a bijective mapping to\nSE(3) by virtually coupling the shoulder and elbow rotations (see Supplementary Materials). The dataset was normalized using min-max normalization and then split into training (80%)\nandvalidation(20%)sets. The DNN was implemented in PyTorch and consists of three fully connected layers. The\ninput layer size (7 neurons) corresponds to the end effector’s position (x,y,z) and orientation\nrepresentedasaquaternion(q ,q ,q ,q ).",
      "size": 917,
      "sentences": 7
    },
    {
      "id": 47,
      "content": "ted in PyTorch and consists of three fully connected layers. The\ninput layer size (7 neurons) corresponds to the end effector’s position (x,y,z) and orientation\nrepresentedasaquaternion(q ,q ,q ,q ). Therearetwohiddenlayerswith1600neuronseach\nw x y z\nandReLUactivationfunctionstointroducenon-linearity. Finally,theoutputlayerhas9neurons\ncorresponding to the dimensions of L. For our loss function, we used the Mean Squared Error\n(MSE)betweenthepredictedandactualarmconfigurations. Whentraining,weusedtheAdam\noptimizer with a learning rate of 0.001, momentum of 0.9, and no weight decay. The learning\n20\n=== 페이지 21 ===\nrate was annealed during using exponential decay with λ = 0.9. We used a batch size of 16 to\nbalancecomputationalefficiencyandthegranularityoflearning. Themodelwastrainedfor50\nepochswhichtook120.6secondsusingacloud-basedGPU(NvidiaTeslav100). Thefinalmean\ntraining error was 1.04 mm per cable while the mean validation error was 1.11 mm per cable.",
      "size": 964,
      "sentences": 9
    },
    {
      "id": 48,
      "content": "ing. Themodelwastrainedfor50\nepochswhichtook120.6secondsusingacloud-basedGPU(NvidiaTeslav100). Thefinalmean\ntraining error was 1.04 mm per cable while the mean validation error was 1.11 mm per cable. When performing inferenceto generate trajectories, the model was runon the computer’s CPU\n(12th Gen Intel i7-12700 2.10 GHz) and took on average 0.368 ms per waypoint. Trajectory\nfollowingresultsareprovidedinSupplementaryMaterials. ACKNOWLEDGMENTS\nFunding: This work was funded by the National Science Foundation grant number 2212049,\na grant from The Murdock Charitable Trust, and the Office of Naval Research grant number\n304220. Author Contributions: M. C. and J.I.L designed the cell; M.C., J.F.K., and J.G. designed the robot; M.C., J.F.K., A.G., and D.R., modeled the robot; M.C., J.F.K., J.G., and\nJ.F.A., tested the cell; M.C., J.F.K., J.G., and J.F.A. tested the robot; M.C., J.F.K., J.F.A., D.R.,\nand J.I.L. wrote the paper; J.I.L provided funding.",
      "size": 958,
      "sentences": 10
    },
    {
      "id": 49,
      "content": "., modeled the robot; M.C., J.F.K., J.G., and\nJ.F.A., tested the cell; M.C., J.F.K., J.G., and J.F.A. tested the robot; M.C., J.F.K., J.F.A., D.R.,\nand J.I.L. wrote the paper; J.I.L provided funding. Competing Interests: We have filed a\npatent: US Patent App. 17/759,826. Data and materials availability: All data and materials\nwillbepubliclyavailableathttps://github.com/TransformativeRoboticsLab/TRUNC. SUPPLEMENTARY MATERIALS\nSupplementaryText\nFigs. S1toS7\nMoviesS1toS5\n21\n=== 페이지 22 ===\nREFERENCES AND NOTES\n1. Q. Guan, F. Stella, C. Della Santina, J. Leng, J. Hughes, Trimmed helicoids: an architec-\nturedsoftstructureyieldingsoftrobotswithhighprecision,largeworkspace,andcompliant\ninteractions,NPJRobotics1,1–13(2023). 2. E. Del Dottore, A. Mondini, N. Rowe, B. Mazzolai, A growing soft robot with climbing\nplant-inspired adaptive behaviors for navigation in unstructured environments, Sci. Robot. 9,eadi5908(2024). 3.",
      "size": 924,
      "sentences": 14
    },
    {
      "id": 50,
      "content": "2. E. Del Dottore, A. Mondini, N. Rowe, B. Mazzolai, A growing soft robot with climbing\nplant-inspired adaptive behaviors for navigation in unstructured environments, Sci. Robot. 9,eadi5908(2024). 3. E.W.Hawkes,L.H.Blumenschein,J.D.Greer,A.M.Okamura,Asoftrobotthatnavigates\nitsenvironmentthroughgrowth,Sci.Robot.2(2017). 4. N. Correll, K. E. Bekris, D. Berenson, O. Brock, A. Causo, K. Hauser, K. Okada, A. Ro-\ndriguez, J. M. Romano, P. R. Wurman, Analysis and observations from the first amazon\npicking challenge, IEEE Transactions on Automation Science and Engineering 15, 172–\n188(2016). 5. S.Hamdule,S.S.Goilkar,Anoverviewoftheuntappedpotentialofsoftroboticarmswith\nintegration of machining tools, Machining and Additive Manufacturing (Springer Nature\nSingapore,2024),pp.107–115. 6. E. Krotkov, D. Hackett, L. Jackel, M. Perschbacher, J. Pippine, J. Strauss, G. Pratt,\nC. Orlowski, The DARPA Robotics Challenge Finals: Humanoid Robots To The Rescue,\nM. Spenko, S. Buerger, K. Iagnemma, eds.",
      "size": 994,
      "sentences": 12
    },
    {
      "id": 51,
      "content": "ov, D. Hackett, L. Jackel, M. Perschbacher, J. Pippine, J. Strauss, G. Pratt,\nC. Orlowski, The DARPA Robotics Challenge Finals: Humanoid Robots To The Rescue,\nM. Spenko, S. Buerger, K. Iagnemma, eds. (Springer International Publishing, Cham,\n2018),pp.1–26. 7. M. W. Hannan, I. D. Walker, Kinematics and the implementation of an elephant’s trunk\nmanipulatorandothercontinuumstylerobots,J.Robot.Syst.20,45–63(2003). 22\n=== 페이지 23 ===\n8. A. Grzesiak, R. Becker, A. Verl, The bionic handling assistant: A success story of additive\nmanufacturing,AssemblyAutomation31,329–333(2011). 9. Q. Guan, J. Sun, Y. Liu, N. M. Wereley, J. Leng, Novel ending and helical exten-\nsile/contractile pneumatic artificial muscles inspired by elephant trunk, Soft Robot 7, 597–\n614(2020). 10. A. Zhang, T.-H. Wang, R. L. Truby, L. Chin, D. Rus, Machine learning best practices for\nsoft robot proprioception, 2023 IEEE/RSJ International Conference on Intelligent Robots\nandSystems(IROS)(IEEE,2023),pp.2564–2571. 11.",
      "size": 990,
      "sentences": 12
    },
    {
      "id": 52,
      "content": "R. L. Truby, L. Chin, D. Rus, Machine learning best practices for\nsoft robot proprioception, 2023 IEEE/RSJ International Conference on Intelligent Robots\nandSystems(IROS)(IEEE,2023),pp.2564–2571. 11. G. Immega, K. Antonelli, The KSI tentacle manipulator, Proceedings of 1995 IEEE In-\nternational Conference on Robotics and Automation (IEEE, 1995), vol. 3, pp. 3149–3154\nvol.3. 12. W. McMahan, V. Chitrakaran, M. Csencsits, D. Dawson, I. D. Walker, B. A. Jones,\nM. Pritts, D. Dienno, M. Grissom, C. D. Rahn, Field trials and testing of the OctArm con-\ntinuum manipulator, Proceedings 2006 IEEE International Conference on Robotics and\nAutomation,2006.ICRA2006.(IEEE,2006),pp.2336–2341. 13. M. Cianchetti, M. Follador, B. Mazzolai, P. Dario, C. Laschi, Design and development\nof a soft robotic octopus arm exploiting embodied intelligence, 2012 IEEE International\nConferenceonRoboticsandAutomation(IEEE,2012),pp.5271–5276. 14.",
      "size": 924,
      "sentences": 11
    },
    {
      "id": 53,
      "content": "lai, P. Dario, C. Laschi, Design and development\nof a soft robotic octopus arm exploiting embodied intelligence, 2012 IEEE International\nConferenceonRoboticsandAutomation(IEEE,2012),pp.5271–5276. 14. Pettinato, Stephanou, Manipulability and stability of a tentacle based robot manipula-\ntor, 1989 IEEE International Conference on Robotics and Automation (1989), vol. 0, pp. 458,459,460,461,462,463. 23\n=== 페이지 24 ===\n15. Z. Han, Z. Liu, W. He, G. Li, Distributed parameter modeling and boundary control of an\noctopus Tentacle-Inspired soft robot, IEEE Trans. Control Syst. Technol. 30, 1244–1256\n(2022). 16. A. K. Schulz, M. Boyle, C. Boyle, S. Sordilla, C. Rincon, S. Hooper, C. Aubuchon, J. S.\nReidenberg, C. Higgins, D. L. Hu, Skin wrinkles and folds enable asymmetric stretch in\nthe elephant trunk, Proceedings of the National Academy of Sciences 119, e2122563119\n(2022). 17.",
      "size": 879,
      "sentences": 13
    },
    {
      "id": 54,
      "content": "Aubuchon, J. S.\nReidenberg, C. Higgins, D. L. Hu, Skin wrinkles and folds enable asymmetric stretch in\nthe elephant trunk, Proceedings of the National Academy of Sciences 119, e2122563119\n(2022). 17. A. Shikari, H. Asada, Triple scissor extender robot arm: A solution to the last one foot\nproblemofmanipulation,IEEERoboticsandAutomationLetters3,3975-3982(2018). 18. M.Calisti,M.Giorelli,G.Levy,B.Mazzolai,B.Hochner,C.Laschi,P.Dario,Anoctopus-\nbioinspired solution to movement and manipulation for soft robots, Bioinspir. Biomim. 6,\n036002(2011). 19. R. V. Martinez, J. L. Branch, C. R. Fish, L. Jin, R. F. Shepherd, R. M. D. Nunes, Z. Suo,\nG.M.Whitesides,Robotictentacleswiththree-dimensionalmobilitybasedonflexibleelas-\ntomers,Adv.Mater.25,205–212(2013). 20. N. Tan, X. Gu, H. Ren, Design, characterization and applications of a novel soft actuator\ndrivenbyflexibleshafts,MechanismandMachineTheory122,197–218(2018). 21.",
      "size": 920,
      "sentences": 12
    },
    {
      "id": 55,
      "content": "tomers,Adv.Mater.25,205–212(2013). 20. N. Tan, X. Gu, H. Ren, Design, characterization and applications of a novel soft actuator\ndrivenbyflexibleshafts,MechanismandMachineTheory122,197–218(2018). 21. T.Kim,P.Kaarthik,R.L.Truby,Aflexible,architectedsoftroboticactuatorformotorized\nextensionalmotion,Adv.Intell.Syst.(2024). 22. F.Connolly,C.J.Walsh,K.Bertoldi,Automaticdesignoffiber-reinforcedsoftactuatorsfor\ntrajectorymatching,ProceedingsoftheNationalAcademyofSciences114,51–56(2017). 24\n=== 페이지 25 ===\n23. J. Bishop-Moser, S. Kota, Design and modeling of generalized fiber-reinforced pneumatic\nsoftactuators,IEEETrans.Rob.31,536–545(2015). 24. J. Yan, X. Zhang, B. Xu, J. Zhao, A new spiral-type inflatable pure torsional soft actuator,\nSoftRobotics5,527–540(2018). 25. L.H.Blumenschein,N.S.Usevitch,B.H.Do,E.W.Hawkes,A.M.Okamura,Helicalac-\ntuationonasoftinflatedrobotbody,2018IEEEInternationalConferenceonSoftRobotics\n(RoboSoft)(IEEE,2018),pp.245–252. 26.",
      "size": 957,
      "sentences": 14
    },
    {
      "id": 56,
      "content": "0(2018). 25. L.H.Blumenschein,N.S.Usevitch,B.H.Do,E.W.Hawkes,A.M.Okamura,Helicalac-\ntuationonasoftinflatedrobotbody,2018IEEEInternationalConferenceonSoftRobotics\n(RoboSoft)(IEEE,2018),pp.245–252. 26. N. Oh, J.-G. Lee, H. Rodrigue, Torsional pneumatic actuator based on pre-twisted pneu-\nmatic tubes for soft robotic manipulators, IEEE/ASME Trans. Mechatron. 28, 3191–3201\n(2023). 27. D.Yang,B.Mosadegh,A.Ainla,B.Lee,F.Khashai,Z.Suo,K.Bertoldi,G.M.Whitesides,\nBuckling of elastomeric beams enables actuation of soft machines, Adv. Mater. 27, 6323–\n6327(2015). 28. Z.Jiao,C.Ji,J.Zou,H.Yang,M.Pan,Vacuum-poweredsoftpneumatictwistingactuators\ntoempowernewcapabilitiesforsoftrobots,Adv.Mater.Technol.4,1800429(2019). 29. F. Chen, Y. Miao, G. Gu, X. Zhu, Soft twisting pneumatic actuators enabled by freeform\nsurfacedesign,IEEERoboticsandAutomationLetters6,5253–5260(2021). 30.",
      "size": 871,
      "sentences": 16
    },
    {
      "id": 57,
      "content": "bots,Adv.Mater.Technol.4,1800429(2019). 29. F. Chen, Y. Miao, G. Gu, X. Zhu, Soft twisting pneumatic actuators enabled by freeform\nsurfacedesign,IEEERoboticsandAutomationLetters6,5253–5260(2021). 30. T.Liu,Y.Wang,K.Lee,Three-dimensionalprintableorigamitwistedtower: Design,fabri-\ncation,androbotembodiment,IEEERoboticsandAutomationLetters3,116–123(2018). 31. D. Li, D. Fan, R. Zhu, Q. Lei, Y. Liao, X. Yang, Y. Pan, Z. Wang, Y. Wu, S. Liu, H. Wang,\nOrigami-Inspiredsofttwistingactuator,SoftRobotics10,395–409(2023). 25\n=== 페이지 26 ===\n32. J. I. Lipton, R. MacCurdy, Z. Manchester, L. Chin, D. Cellucci, D. Rus, Handedness in\nshearingauxeticscreatesrigidandcompliantstructures,Science360,632–635(2018). 33. L. Chin, J. Lipton, R. MacCurdy, J. Romanishin, C. Sharma, D. Rus, Compliant electric\nactuators based on handed shearing auxetics, 2018 IEEE International Conference on Soft\nRobotics(RoboSoft)(IEEE,2018),pp.100–107. 34.",
      "size": 924,
      "sentences": 12
    },
    {
      "id": 58,
      "content": "R. MacCurdy, J. Romanishin, C. Sharma, D. Rus, Compliant electric\nactuators based on handed shearing auxetics, 2018 IEEE International Conference on Soft\nRobotics(RoboSoft)(IEEE,2018),pp.100–107. 34. S.A.Etnier,Twistingandbendingofbiologicalbeams: distributionofbiologicalbeamsin\nastiffnessmechanospace,Biol.Bull.205,36–46(2003). 35. S.Wolff-Vorbeck,M.Langer,O.Speck,T.Speck,P.Dondl,Twist-to-bendratio: animpor-\ntantselectivefactorformanyrod-shapedbiologicalstructures,Sci.Rep.9,17182(2019). 36. S. Wolff-Vorbeck, O. Speck, M. Langer, T. Speck, P. W. Dondl, Charting the twist-to-bend\nratioofplantaxes,J.R.Soc.Interface19,20220131(2022). 37. K. Bertoldi, V. Vitelli, J. Christensen, M. van Hecke, Flexible mechanical metamaterials,\nNatureReviewsMaterials2,1–11(2017). 38. J. B. Berger, H. N. G. Wadley, R. M. McMeeking, Mechanical metamaterials at the theo-\nreticallimitofisotropicelasticstiffness,Nature543,533–537(2017). 39.",
      "size": 926,
      "sentences": 13
    },
    {
      "id": 59,
      "content": "als,\nNatureReviewsMaterials2,1–11(2017). 38. J. B. Berger, H. N. G. Wadley, R. M. McMeeking, Mechanical metamaterials at the theo-\nreticallimitofisotropicelasticstiffness,Nature543,533–537(2017). 39. J. H. Conway, D. H. Huson, The orbifold notation for two-dimensional groups, Struct. Chem.13,247–257(2002). 40. J. H. Conway, H. Burgiel, C. Goodman-Strauss, The Symmetries of Things (CRC Press,\n2016). 41. G.A.Naselli,R.B.N.Scharff,M.Thielen,F.Visentin,T.Speck,B.Mazzolai,Asoftcon-\ntinuum robotic arm with a climbing plant-inspired adaptive behavior for minimal sensing,\nactuation,andcontroleffort,Adv.Intell.Syst.(2023). 26\n=== 페이지 27 ===\n42. T. G. Thuruthel, B. Shih, C. Laschi, M. T. Tolley, Soft robot perception using embedded\nsoftsensorsandrecurrentneuralnetworks,ScienceRobotics4(2019). 27\n=== 페이지 28 ===\nSupplementary Materials for\nBridging Hard and Soft: Mechanical Metamaterials Enable\nRigid Torque Transmission in Soft Robots\nMolly Carton et al. ThePDFfileincludes:\nSupplementaryText\nFigs.",
      "size": 1000,
      "sentences": 15
    },
    {
      "id": 60,
      "content": "페이지 28 ===\nSupplementary Materials for\nBridging Hard and Soft: Mechanical Metamaterials Enable\nRigid Torque Transmission in Soft Robots\nMolly Carton et al. ThePDFfileincludes:\nSupplementaryText\nFigs. S1toS9\nOtherSupplementaryMaterialforthismanuscriptincludesthefollowing:\nMoviesS1toS5\n=== 페이지 29 ===\nSupplementary Text\nConstant-velocity kinematics\nConstant velocity joints are kinematic couplings that maintain equal speeds between input and\noutput shafts while bending. We characterize the spherical element as a constant-velocity joint\nby performing a phase-matching test (Fig. 2). The single spring-steel joints were fixtured with\nvarying(A)axialbendangleand(B)extensionanddrivenusingaDCmotor,whileangularpo-\nsition encoders measured the input and output position and velocity. These results demonstrate\naclosephase-matchbetweenthedriveninputandoutputshafts.",
      "size": 861,
      "sentences": 7
    },
    {
      "id": 61,
      "content": "B)extensionanddrivenusingaDCmotor,whileangularpo-\nsition encoders measured the input and output position and velocity. These results demonstrate\naclosephase-matchbetweenthedriveninputandoutputshafts. Design space analysis\nWe used Finite Element Analysis (FEA) to understand how size scale and material selection\nimpact a TRUNC’s twist-bend ratio (Fig. S3). In our analysis, we varied the TRUNC’s diame-\nterwhileholdingthewidthandthicknessofeachlinkconstant. Thediameterswerenormalized\nusing the truss joints in the arm (D = 56 mm). Models were loaded into Ansys Static Struc-\ntural Analysis and pin joints were defined as revolute connections. Friction in the joints was\napproximated using a torsional stiffness of 0.05 N·mm/◦. Large deflections and weak springs\nwere enabled and the mesh’s element order was set to quadratic to improve the solver’s con-\nverge. The equatorial TRUNC was meshed with approximately 7500 elements, while the truss\nTRUNC was meshed with approximately 14000 elements.",
      "size": 995,
      "sentences": 10
    },
    {
      "id": 62,
      "content": "nt order was set to quadratic to improve the solver’s con-\nverge. The equatorial TRUNC was meshed with approximately 7500 elements, while the truss\nTRUNC was meshed with approximately 14000 elements. The twist-bend ratios were calcu-\nlated by applying a 1.5 N·mm twisting moment followed by a 0.15 N·mm bending moment\nto the cell’s top surface while the bottom was fixed. Across three trials, we assigned the link\nmaterial as Polyethylene terephthalate (PET), 6061 Aluminum, and 1095 Spring Steel (hard-\nened and tempered) with elastic moduli of 2.9 (GPa), 69 (GPa), and 211 (GPa) respectively. We also simulated Neoprene Rubber but excluded these results from the analysis because the\nstructuredeformedwithoutthelinksrotatingaboutthepinsduetoinsufficientrigidity. Thepins\n=== 페이지 30 ===\nwerealwaysassignedasStructuralSteelwithamodulusof200(GPa). Loadingmomentswere\nnormalizedbasedonthematerial’selasticmodulus.",
      "size": 911,
      "sentences": 7
    },
    {
      "id": 63,
      "content": "elinksrotatingaboutthepinsduetoinsufficientrigidity. Thepins\n=== 페이지 30 ===\nwerealwaysassignedasStructuralSteelwithamodulusof200(GPa). Loadingmomentswere\nnormalizedbasedonthematerial’selasticmodulus. Our simulation results show increasing the TRUNC’s material stiffness resulted in a higher\ntwist-bend ratio for both the equatorial (A) and truss (B) variants. Furthermore, the truss cell\nwas less sensitive to changes in modulus between stiffer materials. Moving from Aluminum to\nSteel, a 190% increase in modulus, yielded a 124% and 44% increase in the twist-bend ratios\nof the equatorial and truss cells respectively. Additionally, we found that the twist-bend ratio\nis inversely related to the scaling factor. Thus, scaling the link’s width and thickness relative\nto cell diameter can increase the twist-bend ratio. Doubling the relative thickness and width\nresultedinthetwist-bendratiosincreasingby472%and140%fortheequatorialandtrusscells\nrespectively.",
      "size": 956,
      "sentences": 9
    },
    {
      "id": 64,
      "content": "relative\nto cell diameter can increase the twist-bend ratio. Doubling the relative thickness and width\nresultedinthetwist-bendratiosincreasingby472%and140%fortheequatorialandtrusscells\nrespectively. These results suggest that a future design optimization of the link parameters,\nrelativetothecellsize,couldsubstantiallyincreasetheTRUNC’sselectivecompliance. Monolithic TRUNCs\nMonolithic (3D-printed flexure-based) modules were designed using Autodesk Fusion 360. Joint features and aspect ratios were determined empirically, to achieve approximate pin joint\nbehavior. Part performance was evaluated using an Instron 68SC2 test frame with a 450 N/5\nN·m torsion-tension load cell. Rotational stiffness and load/displacement for a single printed\njointareshowninFigure5. InFigure5A,weshowthebendingandextensionofthemonolithic\njoint. Part B demonstrates the joint has a twist-bend ratio of 2. These printed flexure mecha-\nnisms demonstrate the material-agnostic nature of this structure.",
      "size": 982,
      "sentences": 10
    },
    {
      "id": 65,
      "content": "wthebendingandextensionofthemonolithic\njoint. Part B demonstrates the joint has a twist-bend ratio of 2. These printed flexure mecha-\nnisms demonstrate the material-agnostic nature of this structure. While the idealness of the\nmechanism is dependent on geometric properties, with appropriate translation to flexure joints\nit is possible to realize these mechanisms in a single-material monolithic structure. We use this\nto demonstrate that stiffness remains uncoupled from extension despite the jointed flexure of\ntheconstituentmaterial. === 페이지 31 ===\nCross-coupling of nested joints\nCross-coupling between nested joints occurs due to friction in the system. We measured this\neffectwhendrivingtheinnerandoutercouplingsforthenestedspring-steelTRUNC(Fig. 3C). For these tests, we connected the driven side to the Instron’s upper grippers which rotate the\nspecimen, while the passive coupling was connected to the load cell via the lower grippers.",
      "size": 945,
      "sentences": 9
    },
    {
      "id": 66,
      "content": "NC(Fig. 3C). For these tests, we connected the driven side to the Instron’s upper grippers which rotate the\nspecimen, while the passive coupling was connected to the load cell via the lower grippers. The driven coupling was rotated at 1 rev/min for 10◦ (0.174 rad). We measured cross-coupling\nwhen driving the inner (Fig. S7A) and outer (Fig. S7B) TRUNCs. Each experiment was\nrepeated n = 5 times to obtain uncertainty bounds. We found that in both experiments, the\ncross-coupling torque remained significantly below the Instron’s calibrated sensitivity of 0.05\n% of the maximum rated load or 2.5 N·mm. This represents 0.51% and 2.38% of the torque\ncapacityofthetrussandequatorialcellsrespectively. Performance Comparison\nWecomparedtheTRUNCstocommerciallyavailablesteelandrubberbellowscouplingswhich\ncanaccommodatemisalignmentwhentransmittingtorque.",
      "size": 849,
      "sentences": 11
    },
    {
      "id": 67,
      "content": "apacityofthetrussandequatorialcellsrespectively. Performance Comparison\nWecomparedtheTRUNCstocommerciallyavailablesteelandrubberbellowscouplingswhich\ncanaccommodatemisalignmentwhentransmittingtorque. Forthebellows,wepurchaseda303\nStainless Steel and Nickel Alloy bellows coupling (McMaster part ID: 59925K88) and a Neo-\nprene Rubber bellows (McMaster part ID: 5298K23). We characterized the energy efficiency\nη = Pout of each coupling as a function of their bend angle β (Fig. S6A). For each bend\nPin\nangle, we conducted two tests to measure P and P using an ATO-TQS-DYN-200 (1\ninput output\nN·m)dynamictorquesensor. Inputtorquewassuppliedusinga12VDCmotor. Beforetesting,\nWD-40 Specialist White Lithium Grease was applied to the TRUNC’s joints. A hanging mass\nwas attached to the output to create a 0.1 N·mm load. Up to a small bend angle (β = 10◦),\nthe steel bellows was the most efficient (η = 98.8%) followed closely by the rubber bellows\n(η = 97.5%), and TRUNC (η = 96.5%).",
      "size": 976,
      "sentences": 10
    },
    {
      "id": 68,
      "content": "e output to create a 0.1 N·mm load. Up to a small bend angle (β = 10◦),\nthe steel bellows was the most efficient (η = 98.8%) followed closely by the rubber bellows\n(η = 97.5%), and TRUNC (η = 96.5%). The rubber bellows and TRUNC could both bend up\ntoβ = 45◦ andachievedefficienciesofη = 94.2%andη = 85.7%respectively. Infuturework,\n=== 페이지 32 ===\nthe TRUNC’s efficiency at larger bend angles could be potentially improved by switching the\njoints,currentlymadeusingfullythreadedM2bolts,tosmoothershoulderscrews. While the rubber bellows bent almost five times further than steel bellows, its torsional\nstiffness was much lower. TRUNC’s achieved the same large bending range of motion as the\nrubberbellowswhileremainingclosertothetorsionalstiffnessofsteelbellows(Fig. S6B).The\ntorsional stiffness for the bellows was calculated using the same mechanical characterization\ntechniques discussed in Materials and Methods for the TRUNCs.",
      "size": 930,
      "sentences": 7
    },
    {
      "id": 69,
      "content": "sionalstiffnessofsteelbellows(Fig. S6B).The\ntorsional stiffness for the bellows was calculated using the same mechanical characterization\ntechniques discussed in Materials and Methods for the TRUNCs. Furthermore, TRUNCs can\nbemoreefficientlynestedinsideeachotherthanbellows. Asascale-invariantmetricfornesting\nefficiency,weusedtheratioofunoccupiedvolume(showningreeninFig. S6C)tototalvolume. For hollow cylinders with length l, total radius r , and unoccupied radius r , the nesting\ntotal free\nefficiencyis:\nl π r2 r2\nN = 4 free = free\ncylinder l π r2 r2\n4 total total\nForhollowspheres,thenestingefficiencyis:\n4π r3 r3\nN = free = free\nsphere 4π r3 r3\ntotal total\nBecause TRUNCs lie on the surface of a sphere, they occupy much less volume, with approx-\nimately 85% of the space being free. On the other hand, bellows must occupy a thick-shell\nvolumeinsideofacylindertogainflexibilityandhavelessthan35%unoccupiedvolume.",
      "size": 918,
      "sentences": 7
    },
    {
      "id": 70,
      "content": "py much less volume, with approx-\nimately 85% of the space being free. On the other hand, bellows must occupy a thick-shell\nvolumeinsideofacylindertogainflexibilityandhavelessthan35%unoccupiedvolume. Cyclic loading and durability\nThroughout our testing, we recorded the arm visiting a total of 137,300 poses randomly dis-\ntributed over the workspace. After every 100 poses, the arm was cyclically compressed (∆L =\n−70 mm) five times. This corresponds to 6,865 compression cycles with a strain of 17.8% and\n11.8% for the truss and equatorial cells, respectively. During the arm’s training data collection,\nwe only observed cells breaking when pushed substantially beyond bend angles of β = 45◦. === 페이지 33 ===\nIn these extremal pose cases, we observed the “cross link” (Fig. S4A) on the truss cell break-\ning near the corner where the link connects to the base. To mitigate these failures, we set the\nmaximum cable retraction for the shoulder, elbow, and wrist to be -250 mm.",
      "size": 974,
      "sentences": 9
    },
    {
      "id": 71,
      "content": "4A) on the truss cell break-\ning near the corner where the link connects to the base. To mitigate these failures, we set the\nmaximum cable retraction for the shoulder, elbow, and wrist to be -250 mm. In the future, the\nTRUNC’s durability under large deflections could be improved by adding structural fillets to\nthecross-linkstoreducestressconcentration. Configuration space sampling\nWe sampled the arm’s configuration space by randomly generating cable displacement values\nfrom the home position. Using an approximated model of the arm’s mechanics, we generated\nseparatecabledisplacementvaluesforbendingandcompression. Thismodelassumesthatcom-\npressionresultsfromuniformlydisplacingallthreecablesatasegmentwhereasrotationresults\nfromnon-uniformityamongcabledisplacements. Thedisplacementvaluesweresampledusing\nupperboundsonextension(∆l = 60)androtation(∆r = 60,∆r = 60,and\nmax max,shoulder max,elbow\nr = 80).",
      "size": 909,
      "sentences": 7
    },
    {
      "id": 72,
      "content": "reasrotationresults\nfromnon-uniformityamongcabledisplacements. Thedisplacementvaluesweresampledusing\nupperboundsonextension(∆l = 60)androtation(∆r = 60,∆r = 60,and\nmax max,shoulder max,elbow\nr = 80). For sample n configurations, we first generate an extension/contraction vector\nmax,wrist\nfortheentirearm. ∆L = −∆l ·rand(n,1)\nmax\nTo control rotation for the wrist, we generated random displacement values for all three cables\nandthenrandomlyassignedoneoftheinputstozero. ∆R = −∆r ·rand(n,3)\nwrist max,wrist\nfori = 1 : n, ∆R (i,randi(3)) = 0\nwrist\nTherotationoftheelbowjointfollowsasimilarpattern:\n∆R = −∆r ·rand(n,3)\nelbow max,elbow\nfori = 1 : n, ∆R (i,randi(3)) = 0\nelbow\n=== 페이지 34 ===\nWecoupledtheshoulderandelbowrotationsatthisstage:\n∆R = ∆R\nshoulder elbow\nAn offset is applied to ∆L based on the amount of bending the arm experiences. Each joint\ncompresses during rotation since the cables are in tension.",
      "size": 910,
      "sentences": 6
    },
    {
      "id": 73,
      "content": "elbowrotationsatthisstage:\n∆R = ∆R\nshoulder elbow\nAn offset is applied to ∆L based on the amount of bending the arm experiences. Each joint\ncompresses during rotation since the cables are in tension. To compensate for this, we slacken\nthecablesproportionatelytothemaxof∆R foreachjoint:\nmax(|∆R |)+max(|∆R |)+max(|∆R |)\n∆L = wrist elbow shoulder\noffset\nα\n∆L = ∆L+∆L\noffset\nWeempiricallydeterminedthatusingavalueofα = 8couldincreasethearm’srangeofmotion\nforlargevaluesof∆L\nThesegmentdisplacementsarethencalculatedbysummingthe∆Rand∆Ldisplacements. Wescale∆Lbasedonthenumberofactiveandpassivejointsineachsegment. 3\n∆S = ∆R + ·∆L\nshoulder shoulder\n7\n2\n∆S = ∆R + ·∆L\nelbow shoulder\n7\n2\n∆S = ∆R + ·∆L\nwrist wrist\n7\nFinally, we calculate L by adding the displacements to the arm’s home configuration. We\nempirically found that adding a compensation factor of β = 3 to the wrist helped create more\n4\nposeswiththeendeffectornormaltotheground.",
      "size": 932,
      "sentences": 6
    },
    {
      "id": 74,
      "content": "y adding the displacements to the arm’s home configuration. We\nempirically found that adding a compensation factor of β = 3 to the wrist helped create more\n4\nposeswiththeendeffectornormaltotheground. (cid:2) (cid:3)T\n∆L = ∆S ,∆S +∆S ,β ·(∆S +∆S )+∆S\nshoulder shoulder elbow shoulder elbow wrist\nL = L +∆L\nhome\nOrientation subsets of workspace\nRobotsfrequentlyneedtobothpositionandorienttheirendeffectorwheninteractingwiththeir\nenvironment. We analyzed the arm’s workspace with constraints on orientation to find regions\n=== 페이지 35 ===\nwheretheendeffectorwasnormal(A),partiallytilted(B),andalmostparalleltotheground(C)\nas shown in Fig. 8. Given a set of quaternions Q, where each quaternion q ∈ Q is represented\ni\nasq = (q ,q ,q ,q ),andthegroundplane’snormalvectorisu = [0,0,1]T,wecalculatedthe\ni w x y z\nangleϕ betweentheglobalz-axisandtheaxisdefinedbyeachquaternion’srotationofu.",
      "size": 881,
      "sentences": 6
    },
    {
      "id": 75,
      "content": "ternion q ∈ Q is represented\ni\nasq = (q ,q ,q ,q ),andthegroundplane’snormalvectorisu = [0,0,1]T,wecalculatedthe\ni w x y z\nangleϕ betweentheglobalz-axisandtheaxisdefinedbyeachquaternion’srotationofu. First,\ni\nwe converted the quaternion q to a 3x3 rotation matrix R(q ) using the quat2rotm function in\ni i\nMATLAB’sAerospaceToolbox. Wethenrotatedthez-axisunitvectorusingthematrixderived\nfromthequaternion\nv = R(q )·u\ni i\nwhere v is the rotated vector. We then calculated the cosine of the angle between the rotated\ni\nvectorandthez-axis:\nv ·u\ni\ncos(ϕ ) =\ni\n∥v ∥·∥u∥\ni\nTopreventadomainerrorduetonumericalinaccuracies,weclippedcos(ϕ )toensureitsvalues\ni\n(cid:2) (cid:3)\nwerebetween −1,1 :\ncos(ϕ ) = max(min(cos(ϕ ),1),−1)\ni i\nFinally,wecalculatedtheangulardistanceinradians:\nϕ = arccos(cos(ϕ ))\ni i\nWecalculatedtheangulardistanceforallquaternionsinthesetQandthenfilteredtheworkspace\nto find the regions of interest shown in Fig. S8.",
      "size": 928,
      "sentences": 5
    },
    {
      "id": 76,
      "content": ",wecalculatedtheangulardistanceinradians:\nϕ = arccos(cos(ϕ ))\ni i\nWecalculatedtheangulardistanceforallquaternionsinthesetQandthenfilteredtheworkspace\nto find the regions of interest shown in Fig. S8. Within our workspace data, we found a clear\ncorrelation between ϕ and positional distance from the origin. Lifting the end effector to a\ni\nparallel pose requires the arm to move towards the edge of the workspace while normal poses\ncanbeachievedclosertotheorigin. === 페이지 36 ===\nLearning the inverse kinematics\nWetrainedadeepneuralnetwork(DNN)tolearnthearm’sinversekinematicsusingthedataset\nof well-defined poses previously collected. These configurations represent a manifold of L\nwhere each cable is tensioned and the arm has full mobility. We evaluated the accuracy of\nour learned model using three representative trajectories designed to test performance across\nvarious movement patterns.",
      "size": 891,
      "sentences": 7
    },
    {
      "id": 77,
      "content": "cable is tensioned and the arm has full mobility. We evaluated the accuracy of\nour learned model using three representative trajectories designed to test performance across\nvarious movement patterns. For each test, the pose of the end effector was recorded at 100\nreference waypoints with a 4 second pause between movements (Fig. S9). First, we tested a\ncirculartrajectorygeneratedusingcubicinterpolationtocreateasmoothcurve(Fig. S9A).The\narm tracked the reference input with a mean error of 5.0 mm and 2.1◦. Next, we generated a\ntriangulartrajectoryusinglinearinterpolationtocreatestraightmovementsinthehorizontalxy\nplane and added retraction movements in the −z direction at the triangle’s vertices (Fig. S9B). Themeanerrorforthistestwas7.3mmand1.9◦. Thefinaltestwasastaircasepathwithlinear\nmovements in the xz plane and abrupt changes in the +z direction. The test had a mean error\nof 5.7 mm and 2.5◦ (Fig. S9C).",
      "size": 915,
      "sentences": 12
    },
    {
      "id": 78,
      "content": "meanerrorforthistestwas7.3mmand1.9◦. Thefinaltestwasastaircasepathwithlinear\nmovements in the xz plane and abrupt changes in the +z direction. The test had a mean error\nof 5.7 mm and 2.5◦ (Fig. S9C). We note the arm is less sensitive to errors that map to the z\ndirection compared to the x and y directions. These results demonstrate our learned inverse\nkinematics model can accurately generate arbitrary trajectories within the arm’s workspace,\nenablingbasicmotionplanningforreal-worldtasks. === 페이지 37 ===\nSupplementary Figures\nFig. S1. TRUNCsarebasedontilingsofthedoublearrowhead. (A) Thedoublearrowhead\ncan be made as a linkage where links have a width w and thickness t. (B) The equatorial cell\nis based on a tiling where N = 4 and M = 2 while the truss cell (N = 4 and M = 3) has an\nadditionalrowofarrowheads. === 페이지 38 ===\nFig. S2. TRUNCsareconstant-velocityjoints. TRUNCsmaintainaconstantangularvelocity\nbetween input and output shafts when (A) bending and (B) extending.",
      "size": 980,
      "sentences": 14
    },
    {
      "id": 79,
      "content": "has an\nadditionalrowofarrowheads. === 페이지 38 ===\nFig. S2. TRUNCsareconstant-velocityjoints. TRUNCsmaintainaconstantangularvelocity\nbetween input and output shafts when (A) bending and (B) extending. Input and output signals\nareplottedinradians(modulo2π). Fig. S3. Design space analysis of the TRUNCs. The twist-bend ratio, calculated from sim-\nulation using Ansys Static Structural, versus size scale for the (A) equatorial and (B) truss\nTRUNCs,comparingvaryingmaterialmodelsagainstexperimentalresults. === 페이지 39 ===\nFig. S4. Spring steel link dimensions. Dimensions for the 1095 Spring Steel links used in the\n(A)equatorialand(B)trussTRUNCs. Fig. S5. Monolithic TRUNC characterization. (A) A monolithic equatorial TRUNC printed\nfrom FPU 50 demonstrating polar bending mode and extension. We characterized the me-\nchanical properties of a single printed cell for (B) torsional and flexural stiffness (C) and axial\nstiffness. Shadederrorbarsrepresenttheminandmaxvaluesforfivetrials.",
      "size": 982,
      "sentences": 20
    },
    {
      "id": 80,
      "content": "nsion. We characterized the me-\nchanical properties of a single printed cell for (B) torsional and flexural stiffness (C) and axial\nstiffness. Shadederrorbarsrepresenttheminandmaxvaluesforfivetrials. === 페이지 40 ===\nFig. S6. PerformancecomparisonofTRUNCsandbellows. (A)Wecharacterizedtheenergy\nefficiency of the nested truss TRUNC as a function of its bend angle β. As a point of compari-\nson, the same experiment was performed with off-the-shelf rubber and steel bellows couplings\ndemonstrating that the TRUNC achieves an energy efficiency close to that of the rubber cou-\nplings for the same large range of motion. (B) Comparison of torsional rigidity for off-the-shelf\nsteelandrubbercouplingsandtrusscell. TheTRUNCcellachievesatorsionalrigiditybetween\nthat of the steel and rubber couplings while maintaining the wide angle range of the rubber\ncoupling. (C) Comparison of cross-sectional nesting efficiency. The cross-sectional radii (r\nfree\nand r ) were matched to the CAD models.",
      "size": 983,
      "sentences": 12
    },
    {
      "id": 81,
      "content": "ouplings while maintaining the wide angle range of the rubber\ncoupling. (C) Comparison of cross-sectional nesting efficiency. The cross-sectional radii (r\nfree\nand r ) were matched to the CAD models. TRUNCs can nest more efficiently within each\ntotal\nothercomparedtobellowsbecausetheylieonthesurfaceofasphere,whereasbellowsoccupy\nacylindricalvolume. === 페이지 41 ===\nFig. S7. Cross-couplinganalysisofnestedTRUNCs. Nestedjointsexperienceasmallamount\nofrotationalcross-couplingduetofriction. Wemeasuredthecross-couplingtorqueexperienced\nwhen (A) driving the inner truss joint and (B) the outer equatorial joint. Shaded error bars\nrepresenttheminandmaxvaluesforfivetrials. Fig. S8. Analysis of end effector orientations. Regions of the workspace where the end\neffector is approximately (A) perpendicular, (B) partially tilted, and (C) parallel relative to the\ngroundplane. === 페이지 42 ===\nFig. S9. Learninganinversekinematicmodelfortrajectoryfollowing.",
      "size": 946,
      "sentences": 17
    },
    {
      "id": 82,
      "content": "the end\neffector is approximately (A) perpendicular, (B) partially tilted, and (C) parallel relative to the\ngroundplane. === 페이지 42 ===\nFig. S9. Learninganinversekinematicmodelfortrajectoryfollowing. Welearnedthearm’s\ninverse kinematic mapping by training a DNN on a well-defined configuration space manifold. We then validated the model by following trajectories in the shape of (A) a circle, (B) triangle,\nand(C)stairs. Thisisthencomparedtothegroundtruthmotionovereachtrajectorytofindthe\npositionalandangularerrorofthemodel. === 페이지 43 ===\nSupplementary Movies\nMovieS1. ATRUNCtransmittingtorqueatvariousbendangles. MovieS2. NestedandchainedTRUNCstransmittingmultipleindependenttorques. MovieS3. TheTRUNCarminstallingalightbulb. MovieS5. TheTRUNCarmfasteningboltsalongsideahuman. MovieS5. TheTRUNCarmturningavalve.",
      "size": 815,
      "sentences": 17
    }
  ]
}