{
  "source": "ArXiv",
  "filename": "016_Collision_and_Obstacle_Avoidance_for_Industrial_Au.pdf",
  "total_chars": 42108,
  "total_chunks": 58,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nChapter 1\nCollision and Obstacle Avoidance\nfor Industrial Autonomous Vehicles –\nSimulation and Experimentation\nBased on a Cooperative Approach\nJ. Grosset, A.-J. Fougères, M. Djoko-Kouam, C. Couturier\nand J.-M. Bonnin1\n1.1. Introduction\nOne of the challenges of Industry 4.0, is to determine and optimize the\nflow of data, products and materials in manufacturing companies. To\nrealize these challenges, many solutions have been defined [1] such as\nthe utilization of automated guided vehicles (AGVs). However, being\nguided is a handicap for these vehicles to fully meet the requirements of\nIndustry 4.0 in terms of adaptability and flexibility: the autonomy of\nvehicles cannot be reduced to predetermined trajectories. Therefore, it is\nnecessary to develop their autonomy.",
      "size": 929,
      "sentences": 7
    },
    {
      "id": 2,
      "content": "requirements of\nIndustry 4.0 in terms of adaptability and flexibility: the autonomy of\nvehicles cannot be reduced to predetermined trajectories. Therefore, it is\nnecessary to develop their autonomy. This will be possible by designing\nnew generations of industrial autonomous vehicles (IAVs), in the form\nof intelligent and cooperative autonomous mobile robots. In the field of road transport, research is very active to make the car\nautonomous. Many algorithms, solving problematic traffic situations\nsimilar to those that can occur in an industrial environment, can be\ntransposed in the industrial field and therefore for IAVs. The\ntechnologies standardized in dedicated bodies (e.g., ETSI TC ITS), such\nas those concerning the exchange of messages between vehicles to\nincrease their awareness or their ability to cooperate, can also be\ntransposed to the industrial context.",
      "size": 875,
      "sentences": 6
    },
    {
      "id": 3,
      "content": "es (e.g., ETSI TC ITS), such\nas those concerning the exchange of messages between vehicles to\nincrease their awareness or their ability to cooperate, can also be\ntransposed to the industrial context. J. Grosset\nIMT Atlantique, IRISA, ECAM Rennes, Louis de Broglie, Campus de Ker Lann, Bruz,\nRennes 35091, France\n1\n=== 페이지 2 ===\nAdvances in Robotics, Book Series, Vol. 3\nThe deployment of intelligent autonomous vehicle fleets raises several\nchallenges: acceptability by employees, vehicle location, traffic fluidity,\nvehicle perception of changing environments (dynamic),\nvehicle-infrastructure cooperation, or vehicles heterogeneity. In this\ncontext, developing the autonomy of IAVs requires a relevant working\nmethod. The identification of reusable or adaptable algorithms to the\nvarious problems raised by the increase in the autonomy of IAVs is not\nsufficient, it is also necessary to be able to model, to simulate, to test and\nto experiment with the proposed solutions.",
      "size": 974,
      "sentences": 5
    },
    {
      "id": 4,
      "content": "to the\nvarious problems raised by the increase in the autonomy of IAVs is not\nsufficient, it is also necessary to be able to model, to simulate, to test and\nto experiment with the proposed solutions. Simulation is essential since\nit allows both to adapt and to validate the algorithms, but also to design\nand to prepare the experiments. To improve the autonomy of a fleet, we consider the approach relying on\na collective intelligence to make the behaviours of vehicles adaptive. In\nthis chapter, we will focus on a class of problems faced by IAVs related\nto collision and obstacle avoidance. Among these problems, we are\nparticularly interested when two vehicles need to cross an intersection at\nthe same time, known as a deadlock situation. But also, when obstacles\nare present in the aisles and need to be avoided by the vehicles safely. This chapter is organized as follows: state of the art on algorithms and\ntechniques to improve the autonomy of an IAV in Section 1.2.",
      "size": 974,
      "sentences": 7
    },
    {
      "id": 5,
      "content": "sent in the aisles and need to be avoided by the vehicles safely. This chapter is organized as follows: state of the art on algorithms and\ntechniques to improve the autonomy of an IAV in Section 1.2. The\nimprovement of a collision avoidance algorithm [2] in order to handle\nthe problem of o is described in Section 1.3. In order to set up simulations\nand experiments, we propose an agent model which is presented in\nSection 1.4. The results related to the simulation are explained in\nSection 1.5. Section 1.6 describes the implementation of experiments\nwith real robots. The results and a discussion of these experiments are\ninitiated in Section 1.7. Finally, conclusions and future work are\npresented in Section 1.8. 1.2. State of the Art\nIn researches on Intelligent Transport System (ITS), autonomy of\nvehicles is well determined with 6 levels of autonomy [3]. However, no\nsuch scale exists in the industrial context, and too little research exists in\nthis area [4, 5].",
      "size": 972,
      "sentences": 11
    },
    {
      "id": 6,
      "content": "sport System (ITS), autonomy of\nvehicles is well determined with 6 levels of autonomy [3]. However, no\nsuch scale exists in the industrial context, and too little research exists in\nthis area [4, 5]. A few articles establishing a state of the art on the\nalgorithms and techniques proposed to improve the control and relevance\nof the reactions of IAVs in the face of complex situations make it\npossible to verify the importance of this subject for Industry 4.0 [4, 6]. The study of these articles shows that more and more proposed solutions\n2\n=== 페이지 3 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nrelate to decentralized control algorithms [6-12].",
      "size": 750,
      "sentences": 5
    },
    {
      "id": 7,
      "content": "===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nrelate to decentralized control algorithms [6-12]. Among the problems to\nbe solved to make IAVs more autonomous, we can note: task allocation\n[13-16], localization and vehicles positioning estimation [17-22], path\nplanning [23, 24], motion planning [23, 25, 26] with particularly\ncentralized collision avoidance [27, 28] and decentralized collision\navoidance [24, 29, 30], deadlock avoidance [31-33], and vehicle\nresources management (battery for instance) [4, 34, 35]. The objective of our research is to improve the IAV autonomy integrated\nin a fleet based on collective intelligent strategies. The capacity to\nexchange information between the different IAVs of a fleet is necessary\nto improve this autonomy [36, 37]. Thus, the collision avoidance\nproblem can be solved by the cooperation between IAVs [2, 24, 29, 30].",
      "size": 968,
      "sentences": 6
    },
    {
      "id": 8,
      "content": "information between the different IAVs of a fleet is necessary\nto improve this autonomy [36, 37]. Thus, the collision avoidance\nproblem can be solved by the cooperation between IAVs [2, 24, 29, 30]. The study [2] proposed a cooperation strategy based on the exchange of\nmessages to determine the priority to pass an intersection between IAVs. The solution requires the vehicle to know its own position, and to be able\nto communicate with the other vehicles. The collision avoidance\nalgorithm presented in [2] allows IAVs to communicate and cooperate\nusing different types of messages. The communication between IAVs is\ndone with 3 different types of messages:\n• Hello_msg: message to indicate its presence with its position;\n• Coop_msg: message before an intersection area to determine priority;\n• Ack_msg: message to confirm receipt of a Coop_msg.",
      "size": 848,
      "sentences": 6
    },
    {
      "id": 9,
      "content": "messages:\n• Hello_msg: message to indicate its presence with its position;\n• Coop_msg: message before an intersection area to determine priority;\n• Ack_msg: message to confirm receipt of a Coop_msg. The European Institute of Telecommunications Standards (ETSI) has\npublished a standard for this kind of Cooperative Awareness Message\n(CAM) (ETSI EN 302 637-2 standard [38, 39]) and Decentralized\nEnvironmental Notification Message (DENM) (ETSI EN 302 637-3\nstandard [40]). These specifications and messages are approved and\nconstitute building blocks for the safety of future ITS [41]. The purpose\nof CAM messages is similar to Hello_msg in [2]. Under, the assumption\nthat each vehicle is able to localize itself (e.g., using GNSS), they allow\nto exchange positions, and thus activate cooperative awareness. Indeed,\nit allows the cooperative vehicles in the surrounding to be positioned in\nreal time. This is based on a strong assumption: the vehicles must be able\nto locate themselves precisely.",
      "size": 995,
      "sentences": 7
    },
    {
      "id": 10,
      "content": "awareness. Indeed,\nit allows the cooperative vehicles in the surrounding to be positioned in\nreal time. This is based on a strong assumption: the vehicles must be able\nto locate themselves precisely. Localization is generally done with GPS,\nwhich is not very precise. Moreover, GPS does not work inside\nbuildings, and so in our Industry 4.0 context, GPS is not the tool that\nIAVs will be able to locate themselves with. DENM messages are alert\n3\n=== 페이지 4 ===\nAdvances in Robotics, Book Series, Vol. 3\nmessages. They are issued at the time of an unexpected event in order to\ncooperate, warn and disseminate information in the geographical\narea concerned. ETSI has also published a standard for Cooperative Perception\nMessages (CPM) (ETSI TR 103 562 standard [42]). They allow vehicles\nto broadcast information about objects perceived in their detection area\nby their sensors to other vehicles such as obstacles, pedestrians or other\nvehicles.",
      "size": 942,
      "sentences": 10
    },
    {
      "id": 11,
      "content": "3 562 standard [42]). They allow vehicles\nto broadcast information about objects perceived in their detection area\nby their sensors to other vehicles such as obstacles, pedestrians or other\nvehicles. Another way to cooperate is to inform other vehicles of these\nintentions. In this regard, the ITS WG1 is currently working on the\ndefinition of a Maneuver Coordination Service (MCS) and its associated\nManeuver Coordination Messages (MCM) [43]. The outcome of this\nwork item is planned for end of 2023. We expect MCM messages could\nbe used or enhanced to schedule the access to crossroads. CAM, DENM and CPM messages are important messages standardized. Therefore, we will propose a model of these messages adapted to the\nindustrial context. Then, we will show their possible use to cooperate and\navoid collisions for the IAVs with the example of the Bahnes et al. algorithm [2].",
      "size": 878,
      "sentences": 10
    },
    {
      "id": 12,
      "content": "a model of these messages adapted to the\nindustrial context. Then, we will show their possible use to cooperate and\navoid collisions for the IAVs with the example of the Bahnes et al. algorithm [2]. Furthermore, we will discuss the MCM messages and their\npossible use from an experimental perspective in the results and\ndiscussion section. 1.3. Algorithm Improvement\nThe collision avoidance algorithm of [2] makes it possible to deal with\nthe priority of different vehicles when approaching an intersection. However, it does not deal with the problems of detection, communication\nand avoidance of fixed or moving obstacles (e.g., human operators). In order to address the problem of fixed and mobile obstacles in\nwarehouse aisles, we extended the algorithm of Bahnes et al. to handle\nthe presence of fixed or moving obstacles, in our prior research [44].",
      "size": 854,
      "sentences": 9
    },
    {
      "id": 13,
      "content": "r to address the problem of fixed and mobile obstacles in\nwarehouse aisles, we extended the algorithm of Bahnes et al. to handle\nthe presence of fixed or moving obstacles, in our prior research [44]. In\nthis context, we proposed two new types of messages for collaborative\nperception:\n• Obstacle_msg: a message sent by an IAV agent to other IAV agents\ncirculating in the warehouse to indicate the presence of a\nperceived obstacle;\n• Alert_msg: a message sent by an IAV agent to other IAV agents\ncirculating in the warehouse to indicate an unavoidable obstacle. 4\n=== 페이지 5 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nThen, we simulate the algorithm staying within the framework of the\nthree scenarios proposed by [2]. These simulations rely on an\nagent-based model where IAVs are agentified [45, 46].",
      "size": 904,
      "sentences": 6
    },
    {
      "id": 14,
      "content": "rative Approach\nThen, we simulate the algorithm staying within the framework of the\nthree scenarios proposed by [2]. These simulations rely on an\nagent-based model where IAVs are agentified [45, 46]. Indeed,\nagent-based simulation for IAVs is the most common in the same way\nas simulations based on discrete events or robotics software [47]. IAV\nagents have the ability to exchange messages and are equipped with\nradar. This allows them to detect vehicles in front of them. For instance,\ngiven an IAV agent a, if another IAV agent a in front of it is stopped\ni j\nor is travelling at a slower speed, the IAV agent a can detect it with its\ni\nradar and stop accordingly to avoid hitting it. To improve the collective\nautonomy of the IAVs it is essential that they have a good capacity for\nindividual autonomy. The individual autonomy of the IAVs strengthens\ntheir collective autonomy.",
      "size": 881,
      "sentences": 8
    },
    {
      "id": 15,
      "content": "g it. To improve the collective\nautonomy of the IAVs it is essential that they have a good capacity for\nindividual autonomy. The individual autonomy of the IAVs strengthens\ntheir collective autonomy. The Bahnes algorithm proposed in our previous work [44] has been\nadapted with the standard ETSI messages used for ITS, in Fig. 1.1. These\nmessages exchanged by the different IAVs remain consistent with\nBahnes’ algorithm and are adapted to the industrial context. The\nmessages used that substitute the messages defined by Bahnes et al. are\nthe CAM, MCM and ACK_MCM messages respectively to the\nHello_Msg, Coop_Msg and Ack_Msg messages. Finally, the two types\nof message proposed for collaborative perception in our previous work\n[44], Obstacle_msg and Alert_msg, are replaced by CPM and DENM\nmessages respectively. The algorithm presented in Fig. 1.1 does not take into account the priority\nof passage in the case where 2 IAVs request passage at the same time at\nan intersection.",
      "size": 978,
      "sentences": 11
    },
    {
      "id": 16,
      "content": "PM and DENM\nmessages respectively. The algorithm presented in Fig. 1.1 does not take into account the priority\nof passage in the case where 2 IAVs request passage at the same time at\nan intersection. This means that it does not propose a solution in case of\na deadlock situation. We will discuss the different possibilities in the\nresults and discussion section for our future work. 1.4. Modeling\nIn order to implement the Bahnes algorithm in simulation, we have\nmodelled the different agents that will be implemented in the simulation. Fig. 1.2 shows the model agentified we have implemented in\nthe simulation. 5\n=== 페이지 6 ===\nAdvances in Robotics, Book Series, Vol. 3\nFig. 1.1. Improvement of Bahnes’s algorithm to treat the problem of collision\nand obstacles. IAVs are equipped with radar to detect pedestrians, other IAVs (dynamic\nobstacles) and goods (static obstacles) present in their activity area.",
      "size": 906,
      "sentences": 14
    },
    {
      "id": 17,
      "content": "orithm to treat the problem of collision\nand obstacles. IAVs are equipped with radar to detect pedestrians, other IAVs (dynamic\nobstacles) and goods (static obstacles) present in their activity area. Then, to move in their environment and accomplish their mission, they\nhave knowledge about their environment through their own perception\nof the environment and through the information received from other\nIAVs. Indeed, they exchange information with other IAVs or even with\nthe infrastructure thanks to different types of messages: CAM, DENM,\nCPM, MCM and ACK_MCM. This allows IAVs to build up their own\ndynamic mapping of the environment. Thus they are cooperative,\npro-active and autonomous to carry out their missions without colliding\nwith static and dynamic obstacles. Fig. 1.2. Class diagram of the simulation. 6\n=== 페이지 7 ===\nChapter 1.",
      "size": 843,
      "sentences": 10
    },
    {
      "id": 18,
      "content": "they are cooperative,\npro-active and autonomous to carry out their missions without colliding\nwith static and dynamic obstacles. Fig. 1.2. Class diagram of the simulation. 6\n=== 페이지 7 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nThe different messages presented in the Fig. 1.2 are used in our\ncooperation protocol for simulation and experiments. Their modelling\nand representation are inspired by the messages standardized in the TC\nITS (Intelligent Transportation System) of the European Institute of\nTelecommunications Standards (ETSI) standard messages. That means,\nwe transpose the messages of the Bahnes algorithm to equivalent ETSI\nmessages we adapted to the industrial context which has different\nconstraints than the road sector. The purpose of Hello_msg proposed by Bahnes correspond to the\nCooperative Awareness Message (CAM, ETSI EN 302 637-2 standard\n[38, 39]).",
      "size": 977,
      "sentences": 10
    },
    {
      "id": 19,
      "content": "l context which has different\nconstraints than the road sector. The purpose of Hello_msg proposed by Bahnes correspond to the\nCooperative Awareness Message (CAM, ETSI EN 302 637-2 standard\n[38, 39]). This is a message sent by the vehicle to indicate its position in\nreal time. We propose a model for the industrial context in Fig. 1.3 and\nits associated implementation as a message in ROS2 in Fig. 1.4. Fig. 1.3. Representation of CAM Message for the industrial context. Fig. 1.4. Modeling of CAM Message in ROS2. The alert message we proposed for the simulation of the augmented\nBahnes algorithm will be implemented using the Decentralized Event\nNotification Message (DENM, ETSI EN 302 637-3 standard [40]). This\ncan be of 3 different types: TRIGGER, UPDATE and TERMINATE\n(message_type in the modelling of the message in Fig. 1.6). TRIGGER\ncorresponds to the first alert message, UPDATE to an alert message that\n7\n=== 페이지 8 ===\nAdvances in Robotics, Book Series, Vol.",
      "size": 968,
      "sentences": 16
    },
    {
      "id": 20,
      "content": "ATE\n(message_type in the modelling of the message in Fig. 1.6). TRIGGER\ncorresponds to the first alert message, UPDATE to an alert message that\n7\n=== 페이지 8 ===\nAdvances in Robotics, Book Series, Vol. 3\nallows to update information related to the first measurement, and finally\nthe TERMINATE type that allows to inform others that the alert that has\nbeen issued is no longer active. This message contains the cause and\nsub-cause of the alert that is issued in the SituationContainer block of\nthe message (see Fig. 1.5). Several alert message codes have been\ntransposed from the standard for our experiments such as\nCollision_RISK with sub-causes associated with this code such as a\nlongitudinal, lateral, intersection-related or vulnerable user collision risk\n(modelling of SituationContainer in Fig. 1.6). Fig. 1.5. Representation of DENM Message for the industrial context. Fig. 1.6. Modeling of DENM Message in ROS2.",
      "size": 918,
      "sentences": 14
    },
    {
      "id": 21,
      "content": "lated or vulnerable user collision risk\n(modelling of SituationContainer in Fig. 1.6). Fig. 1.5. Representation of DENM Message for the industrial context. Fig. 1.6. Modeling of DENM Message in ROS2. Bahnes' augmented algorithm allows vehicles to take obstacle detection\ninto account. This augmentation has seen the arrival of a new message:\nObstacle_message in our previous work [44]. ETSI has standardized a\n8\n=== 페이지 9 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nmessage for the ITS domain for the exchange of obstacle perception or\nother information called the Cooperative Perception Message (CPM,\nETSI TR 103 562 [42]). Our CPM-inspired adaptation for the industrial\ncontext is shown in Fig. 1.7 and our ROS2 implementation is modeled\nin Fig. 1.8. Fig. 1.7. Representation of CPM Message for the industrial context. Fig. 1.8. Modeling of CPM Message in ROS2. 1.5.",
      "size": 972,
      "sentences": 22
    },
    {
      "id": 22,
      "content": "al\ncontext is shown in Fig. 1.7 and our ROS2 implementation is modeled\nin Fig. 1.8. Fig. 1.7. Representation of CPM Message for the industrial context. Fig. 1.8. Modeling of CPM Message in ROS2. 1.5. Simulation Results\nBefore moving on to real experiments, we simulate the algorithm\nproposed in Fig. 1.1 to verify that this cooperative solution is able to\nsolve the collision and obstacle avoidance problems. This allowed us to\nvalidate our model proposed in the previous section, and to verify that\n9\n=== 페이지 10 ===\nAdvances in Robotics, Book Series, Vol. 3\nother difficulties and problems do not appear before the real\nexperimentation phase. The simulation framework was taken from the Bahnes’ algorithm. Therefore, our model presented in Fig. 1.2 was simulated with the\ndifferent scenarios and the traffic plan proposed by Bahnes et al. [2]\npresented in Figs. 1.9, 1.10. Indeed, this choice is justified by our\nconviction to use it as a benchmark plan to compare results. Fig. 1.9.",
      "size": 984,
      "sentences": 22
    },
    {
      "id": 23,
      "content": "enarios and the traffic plan proposed by Bahnes et al. [2]\npresented in Figs. 1.9, 1.10. Indeed, this choice is justified by our\nconviction to use it as a benchmark plan to compare results. Fig. 1.9. Simulation of radar use: a) at the top of the picture: one blue and three\nyellow IAVs arrive near the intersection, b) while waiting for the yellow IAV\nto pass the intersection, the radar of the blue IAV and the two others yellow IAV\nallow them to stop and keep their distance to avoid colliding. Ten IAVs start from the horizontal central aisle on the left. The red IAVs\ndo the first circuit corresponding to the first loop at the top left, the blue\nones follow them but will go down the 4th aisle (3rd loop). Finally, the\nyellow ones do the big loop going clockwise just like the red and yellow\nIAVs. The upper part of this traffic plan illustrates the possibility of\nchecking the correct management of the intersection.",
      "size": 922,
      "sentences": 11
    },
    {
      "id": 24,
      "content": "yellow ones do the big loop going clockwise just like the red and yellow\nIAVs. The upper part of this traffic plan illustrates the possibility of\nchecking the correct management of the intersection. In addition, our\nsimulation allows us to place obstacles at random positions in the lanes. This makes it possible to check the correct reaction of the IAVs in\nrelation to their perception of the obstacles and the logs of their message\nexchanges. It involves different intersections, where vehicles can arrive\nfrom different sides like in a warehouse (4 intersections are shown in\nFig. 1.10). Thus, it provides the different characteristics of an industrial\nenvironment and allows us to realize simulated experimental tests in line\nwith realistic scenarios. 10\n=== 페이지 11 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nFig. 1.10.",
      "size": 928,
      "sentences": 10
    },
    {
      "id": 25,
      "content": "with realistic scenarios. 10\n=== 페이지 11 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nFig. 1.10. Simulation of the scenarios: a) in the center of the picture: a blue\nand yellow IAV arrive at an intersection, b) the yellow IAV passed\nthe intersection after communicating with other IAVs, c) on the left side\nof the picture: a red IAV perceives a fixed obstacle in front of him, d) a red IAV\navoided the obstacle. We notice in the simulation that the avoidance is well respected, and the\nobstacles are perceived by the IAVs. Therefore, the simulation validates\nthe extended Bahnes’s algorithm with collision avoidance and fixed or\ndynamic obstacle detection processing. 1.6. Experimentations\n1.6.1. Context\nAfter having carried out simulations, the objective is to move on to the\nstage of real experiments to test cooperation algorithms.",
      "size": 937,
      "sentences": 10
    },
    {
      "id": 26,
      "content": "obstacle detection processing. 1.6. Experimentations\n1.6.1. Context\nAfter having carried out simulations, the objective is to move on to the\nstage of real experiments to test cooperation algorithms. As a first step,\n11\n=== 페이지 12 ===\nAdvances in Robotics, Book Series, Vol. 3\nwe want to verify that the augmented Bahnes algorithm presented in\nFig. 1.1 does indeed allow industrial vehicles to avoid collisions with\nobstacles and to manage decision making at intersections. The main\nobjective is to validate our hypothesis that collective intelligence\nstrategies between vehicles will increase their individual and collective\nautonomy to perform their tasks efficiently. In the Industry 4.0 context, we use Turtlebot3 ‘burger’ robot as our\nrepresentation of autonomous industrial vehicles. These robots are\nequipped with different components as described in Fig. 1.11 and use a\nRaspberry Pi and the Robot Operating System (ROS).",
      "size": 927,
      "sentences": 11
    },
    {
      "id": 27,
      "content": "bot as our\nrepresentation of autonomous industrial vehicles. These robots are\nequipped with different components as described in Fig. 1.11 and use a\nRaspberry Pi and the Robot Operating System (ROS). Indeed, ROS is an\nopen-source framework for the development of robotics applications and\nis the tool favored by researchers and even industrialists today. For our\nresearch we use ROS2 because it provides real-time control systems and\nlarge-scale distributed architectures [48]. Compared to ROS, there is no\nmaster entity, and ROS2 utilized Data Distribution Service (DDS). Thus,\nas we are working on distributed robotic systems to evaluate our\ncooperation algorithms, the choice focused on ROS2 naturally for our\nrobot fleets. To facilitate real experiments, we first used the Gazebo\nsimulation environment which is easily integrated with ROS2 and where\nTurtlebot3 can be simulated.",
      "size": 882,
      "sentences": 8
    },
    {
      "id": 28,
      "content": "sed on ROS2 naturally for our\nrobot fleets. To facilitate real experiments, we first used the Gazebo\nsimulation environment which is easily integrated with ROS2 and where\nTurtlebot3 can be simulated. This part of the simulation in the Gazebo\nenvironment makes it possible to check the correct operation of message\nexchanges and the cooperation algorithm and thus avoid collisions in\nexperiments with physical robots. In this simulation environment, we\nfirst created a world representing an intersection where we deployed\n4 Turtlebot3 ‘burger’ equipped with their LIDAR (see Fig. 1.11). Fig. 1.11. Simulation environment for experimentations. 12\n=== 페이지 13 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\n1.6.2.",
      "size": 810,
      "sentences": 10
    },
    {
      "id": 29,
      "content": "ironment for experimentations. 12\n=== 페이지 13 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\n1.6.2. Collective Cooperation Strategy\nBefore simulating the Bahnes algorithm or other cooperative algorithms\nwith standardized messages with the ROS2 framework and Gazebo, we\nworked on the task assignment for autonomous vehicles to implement\nrobot control and movement utility related to the notion of\ntasks/missions. We have assumed that the tasks are known and therefore configured in a\nfile with the destination of each robot for each task. The destinations\nwhere the robots must perform tasks are represented by PositionAction\nwhich is (x, y) coordinates relative to the 2D world simulated in Gazebo. Our robotic architecture is similar to that used by Choirbot [49], a ROS2\ntoolbox for cooperative robotics. That is, we have a layer to guide and a layer to plan the destinations of\nthe robots.",
      "size": 992,
      "sentences": 8
    },
    {
      "id": 30,
      "content": "zebo. Our robotic architecture is similar to that used by Choirbot [49], a ROS2\ntoolbox for cooperative robotics. That is, we have a layer to guide and a layer to plan the destinations of\nthe robots. Indeed, each robot is associated to a planner_client node\nwhich sends the PositionGoal related to the destination of the task\nassociated to the robot. Then, the planner_server node which allows us\nto standardize this destination point which it publishes to the goal topic\nassociated to the robot. Afterwards, the guidance layer will subscribe to\nthis topic to control the robot until it reaches its mission position. Once\nthe robot has reached its destination, the odometry server sends feedback\nto the planner_client, which can reply the next PositionAction to the\nplanner_server. The communication between the different nodes for the control of\nrobot 1 for example is shown in Fig. 1.12. Fig. 1.12. Nodes and topics representation for robot1 for path planning.",
      "size": 962,
      "sentences": 12
    },
    {
      "id": 31,
      "content": "he\nplanner_server. The communication between the different nodes for the control of\nrobot 1 for example is shown in Fig. 1.12. Fig. 1.12. Nodes and topics representation for robot1 for path planning. 13\n=== 페이지 14 ===\nAdvances in Robotics, Book Series, Vol. 3\nOnce the tasks have been assigned and the robots have been controlled,\nthe robots must be able to communicate. This will allow the exchange of\ninformation on their positions, their vision of the environment, or their\ntrajectory intention in order not to collide with each other or\nwith obstacles. 1.6.3. Communication\nIn order to implement algorithms for collective cooperation between\nautonomous vehicles, we have implemented the different standardized\nmessages presented in Section 1.4. The implementation of those\nmessages in ROS2 will allow robots to exchange these types of messages\nthrough topics.",
      "size": 863,
      "sentences": 12
    },
    {
      "id": 32,
      "content": "s, we have implemented the different standardized\nmessages presented in Section 1.4. The implementation of those\nmessages in ROS2 will allow robots to exchange these types of messages\nthrough topics. The turtlebot3_position_control node of a robot allows it to control its\nspeed and orientation towards its destination point defined by the /goal\ntopic as explained in Subsection 1.6.2. This node will also allow to\nexchange messages related to its observations of the environment thanks\nto its LIDAR. We have defined an observation distance and a safety\ndistance. When the LIDAR detects something corresponding to the\nobservation distance or less it publishes a CPM message in the topic\ncorresponding to the robot with the related information. Similarly, if it\ndetects something at a distance less than its safety distance, it sends an\nalert message, i.e., a DENM message with the information associated\nwith the DENM topic.",
      "size": 924,
      "sentences": 7
    },
    {
      "id": 33,
      "content": "lated information. Similarly, if it\ndetects something at a distance less than its safety distance, it sends an\nalert message, i.e., a DENM message with the information associated\nwith the DENM topic. This process of subscribing and publishing\nmessages similar to all robots is modelled in Fig. 1.13 using robot 1 as\nan example. Fig. 1.13. Process of publishing/subscribing topics for position_control node\nof each robot. 14\n=== 페이지 15 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nCAM messages are published in CAM topics similar to CPM and DENM\nmessages. They are standardized using information from the robot's\nodometry sensor. This information published by one robot is retrieved\nby all other robots in the manner of a broadcast exchange.",
      "size": 843,
      "sentences": 11
    },
    {
      "id": 34,
      "content": "ENM\nmessages. They are standardized using information from the robot's\nodometry sensor. This information published by one robot is retrieved\nby all other robots in the manner of a broadcast exchange. The\narchitecture has been implemented so that each robot has an\nexchange_messages node which allows it to subscribe to all the message\ntopics of the other robots, i.e., CAM, CPM and DENM messages in our\ncurrent experiment. These exchanges are modelled in Fig. 1.14 for\n2 robots, but the process is similar regardless of the number of robots. Fig. 1.14. Nodes and topics representation for exchanging messages. 1.7. Results and Discussion\nBefore actually experimenting with the strategic cooperation of the\nrobots to avoid real collisions, we tested a simple scenario in a gazebo\nsimulation. Each robot was given the task of crossing the intersection\nshown in Fig. 1.11, and they were asked to go to the PositionGoal in\nfront of them. We will take Fig. 1.15 as an example scenario.",
      "size": 980,
      "sentences": 15
    },
    {
      "id": 35,
      "content": "mulation. Each robot was given the task of crossing the intersection\nshown in Fig. 1.11, and they were asked to go to the PositionGoal in\nfront of them. We will take Fig. 1.15 as an example scenario. The robots broadcast their\npositions using CAM messages while moving towards the intersection. The LIDAR of robot2 detects an obstacle and sends a CPM message to\nshare its information. But as we have not implemented obstacle\navoidance control, it will stop at the safety distance of the LIDAR and\nsend a DENM message with a risk of longitudinal collision. Similarly,\nrobot3 and robot4 did not encounter any problems on their paths but\nwhen crossing the intersection, their LIDAR detects at the safe distance\n15\n=== 페이지 16 ===\nAdvances in Robotics, Book Series, Vol. 3\nthe other robot with an angle of less than 45°. They will immediately\nsend a DENM message of risk of longitudinal collision as well. Fig. 1.15. Scenarios of message exchanging in experiments.",
      "size": 959,
      "sentences": 14
    },
    {
      "id": 36,
      "content": "Vol. 3\nthe other robot with an angle of less than 45°. They will immediately\nsend a DENM message of risk of longitudinal collision as well. Fig. 1.15. Scenarios of message exchanging in experiments. It can be noted that unlike robot2, robot3 and robot4 did not send a CPM\nmessage before, because at the moment of the intersection they were\nalready too close. Robot3 and robot4 stop to avoid collision. Our goal\nwas to find a cooperative solution for VIAs to avoid collisions and\nobstacles, but also to avoid unnecessary braking and stopping to optimise\nenergy and speed. As a first step, these results show that our cooperative\nstrategy allows the robots not to collide with each other or with obstacles. Our results of communication between the different robots are therefore\nvalidated in the Gazebo simulation environment.",
      "size": 824,
      "sentences": 11
    },
    {
      "id": 37,
      "content": "ve\nstrategy allows the robots not to collide with each other or with obstacles. Our results of communication between the different robots are therefore\nvalidated in the Gazebo simulation environment. Nevertheless, in order\nto be able to find a cooperation to cross the intersection it would be\nnecessary to implement the cooperative messages presented by the\nBahnes algorithm. For this purpose, a service not yet implemented by\nITS WG1 and ETSI is discussed: Maneuver Coordination Service\n(MCS) and its associated Maneuver Coordination Messages (MCM)\n[43]. We then propose in the same way a representation for the industrial\ncontext in Fig. 1.16 and a modelling of the message for ROS2 in\nFig. 1.17. This message would share the information that one wishes to\ncross an intersection by indicating ManeuverContainer information, that\nis id of the intersection, as well as the direction one would take. 16\n=== 페이지 17 ===\nChapter 1.",
      "size": 928,
      "sentences": 9
    },
    {
      "id": 38,
      "content": "information that one wishes to\ncross an intersection by indicating ManeuverContainer information, that\nis id of the intersection, as well as the direction one would take. 16\n=== 페이지 17 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nFig. 1.16. Representation of MCM Message for the industrial context. Fig. 1.17. Modeling of MCM Message in ROS2. Thus, in a future work, we would assume that the vehicles know the\npositions of the different intersections, or are able to locate them, and\nsend an MCM message to the other robots indicating their planned\ntrajectory in the intersection. The robots concerned by the request will\nbe able to respond to an ACK_Message indicating their agreement or\ndisagreement with the request. The industrial representation of this\nmessage and the ROS2 modelling we propose are detailed in\nFigs. 1.18, 1.19.",
      "size": 936,
      "sentences": 12
    },
    {
      "id": 39,
      "content": "espond to an ACK_Message indicating their agreement or\ndisagreement with the request. The industrial representation of this\nmessage and the ROS2 modelling we propose are detailed in\nFigs. 1.18, 1.19. This discussion around MCM messages to enable vehicle cooperation\nwhen approaching an intersection raises an issue: if several vehicles\nrequest to cross the same intersection at the same time, or if one vehicle\nindicates that it does not agree to the request of another vehicle, a\n17\n=== 페이지 18 ===\nAdvances in Robotics, Book Series, Vol. 3\ndeadlock situation arises. There are 3 possibilities to manage this\nconcern. The first is the idea of strong cooperation, i.e., all vehicles\nalways agree. The second is to set up a supervisor who can arbitrate the\nsituation and therefore choose which vehicle should pass. This case takes\nus out of a distributed architecture.",
      "size": 866,
      "sentences": 9
    },
    {
      "id": 40,
      "content": ", all vehicles\nalways agree. The second is to set up a supervisor who can arbitrate the\nsituation and therefore choose which vehicle should pass. This case takes\nus out of a distributed architecture. Finally, the last solution is to add an\nalgorithmic layer that is known to all the robots, and which therefore\nserves as a decisive judgment. All robots should take the same decision\nin a given situation. For example, if one robot disagrees with the crossing\nof another, it is then the level of priority and urgency of the task between\nthe two robots that will decide who will be the first to cross. This solution\nwould make it possible to always remain in the idea of strong\ncollaboration, cooperation between the different agents in the situation. Fig. 1.18. Representation of ACK_MCM Message for the industrial context. 18\n=== 페이지 19 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nFig. 1.19.",
      "size": 995,
      "sentences": 13
    },
    {
      "id": 41,
      "content": "or the industrial context. 18\n=== 페이지 19 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nFig. 1.19. Modeling of ACK_MCM Message in ROS2. 1.8. Conclusions and Future Work\nIn an Industry 4.0 context, many actors cross paths in different areas of\na warehouse or a factory: vehicles, operators, obstacles (objects that fall\nor left in the aisles may appear). A specific state of the art on the used a message-based communication\nprotocol between vehicles to prioritise the passage through an\nintersection allowed us to identify the Bahne’s algorithm [2], well\nrepresentative of the cooperative strategies developed in the field. As a\nfirst step, we carried out an algorithmic work to extend this algorithm in\norder to have the possibility to manage the detection of fixed and mobile\nobstacles (Fig. 1.1).",
      "size": 900,
      "sentences": 10
    },
    {
      "id": 42,
      "content": "developed in the field. As a\nfirst step, we carried out an algorithmic work to extend this algorithm in\norder to have the possibility to manage the detection of fixed and mobile\nobstacles (Fig. 1.1). Then, we proposed an agent model as well as a\nmodel adapted for the Industry 4.0 context of the ETSI standard\nmessages for ITS. This proposed cooperation protocol is implemented\nfor the exchange of information on location, perception of the\nenvironment, and notification of dangerous events. 19\n=== 페이지 20 ===\nAdvances in Robotics, Book Series, Vol. 3\nWe validated the extended algorithm by a simulation approach with a\ntraffic plan presented in the literature. Finally, we emulated these\ndifferent exchanges of awareness and perception messages in a virtual\nworld of Turtlebot3 ‘burger’ robots with ROS2 and Gazebo. As an extension of this work and in order to perform real experiments,\nwe discussed these results as well as a cooperation message named\nManeuver Coordination Messages (MCM).",
      "size": 991,
      "sentences": 9
    },
    {
      "id": 43,
      "content": "ts with ROS2 and Gazebo. As an extension of this work and in order to perform real experiments,\nwe discussed these results as well as a cooperation message named\nManeuver Coordination Messages (MCM). This implementation\nperspective would allow us to validate the Bahnes algorithm augmented\nwith the exchange of cooperation messages to describe one's intention to\ncross an intersection. In a second step, we aim at implementing an\nalgorithmic layer for decision making in case of deadlock situation as\ndiscussed in Section 1.7. Finally, we also plan to involve the intersection proximity infrastructure\nin the exchange of communication through camera information in order\nto help the VIAs to cooperate in crossing the intersection by avoiding\nunnecessary braking and stopping. This would optimize the energy and\nefficiency with which the VIAs carry out their missions.",
      "size": 867,
      "sentences": 6
    },
    {
      "id": 44,
      "content": "er\nto help the VIAs to cooperate in crossing the intersection by avoiding\nunnecessary braking and stopping. This would optimize the energy and\nefficiency with which the VIAs carry out their missions. Acknowledgements\nThe authors would like to thank the region Bretagne-France for funding\nthe VIASIC project as part of the ARED-2021-2024 call for projects\nconcerning the strategic innovation area: Economics of industry for\nintelligent production. References\n[1]. H. Andreasson, A. Bouguerra, M. Cirillo, D. Nikolaev Dimitrov,\nD. Driankov, L. Karlsson, A. J. Lilienthal, F. Pecora, J. Pekka Saarinen,\nA. Sherikov, T. Stoyanov, Autonomous Transport Vehicles: Where We\nAre and What Is Missing, IEEE Robotics & Automation Magazine,\nVol. 22, Issue 1, 2015, pp. 64-75. [2]. N. Bahnes, B. Kechar, H. Haffaf, Cooperation Intelligent Autonomous\nVehicles to enhance container terminal operations, Journal of Innovation\nin Digital Ecosystems, Vol. 3, Issue 1, 2016, pp. 22-29. [3].",
      "size": 970,
      "sentences": 12
    },
    {
      "id": 45,
      "content": "Bahnes, B. Kechar, H. Haffaf, Cooperation Intelligent Autonomous\nVehicles to enhance container terminal operations, Journal of Innovation\nin Digital Ecosystems, Vol. 3, Issue 1, 2016, pp. 22-29. [3]. H. Khayyam, B. Javadi, M. Jalili, R. N. Jazar, Artificial Intelligence and\nInternet of Things for autonomous vehicles, in Nonlinear Approaches in\nEngineering Applications: Automotive Applications of Engineering\n20\n=== 페이지 21 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\nProblems (R. N. Jazar, L. Dai, Eds. ), Springer International Publishing,\n2020, pp. 39-68. [4]. I. F. A. Vis, Survey of research in the design and control of automated\nguided vehicle systems, Eur. J. Oper. Res., Vol. 170, Issue 3, 2006,\npp. 677-709. [5]. B. Esmaeilian, S. Behdad, B. Wang, The evolution and future of\nmanufacturing: a review, Journal of Manufacturing Systems, Vol. 39,\n2016, pp. 79-100. [6].",
      "size": 981,
      "sentences": 19
    },
    {
      "id": 46,
      "content": "., Vol. 170, Issue 3, 2006,\npp. 677-709. [5]. B. Esmaeilian, S. Behdad, B. Wang, The evolution and future of\nmanufacturing: a review, Journal of Manufacturing Systems, Vol. 39,\n2016, pp. 79-100. [6]. M. De Ryck, M. Versteyhe, F. Debrouwere, Automated guided vehicle\nsystems, state-of-the-art control algorithms and techniques, Journal of\nManufacturing Systems, Vol. 54, 2020, pp.152-173. [7]. L. Monostori, P. Valckenaers, A. Dolgui, H. Panetto, M. Brdys,\nB. C. Csáji, Cooperative Control in Production and Logistics, IFAC\nProceeding Volumes (IFACPapersOnline), Vol. 19, 2014, pp. 4246-4265. [8]. C. Blesing, D. Luensch, B. Korth, Concept of a Multi-agent Based\nDecentralized Production System for the Automotive Industry, Lecture\nNotes in Computer Science, Vol. 10349, 2018, pp. 19-30. [9]. M. P. Fanti, A. M. Mangini, G. Pedroncelli, W. Ukovich, A decentralized\ncontrol strategy for the coordination of AGV systems, Control Eng. Pract.,\nVol. 70, 2018, pp. 86-97. [10].",
      "size": 970,
      "sentences": 24
    },
    {
      "id": 47,
      "content": "018, pp. 19-30. [9]. M. P. Fanti, A. M. Mangini, G. Pedroncelli, W. Ukovich, A decentralized\ncontrol strategy for the coordination of AGV systems, Control Eng. Pract.,\nVol. 70, 2018, pp. 86-97. [10]. I. Draganjac, D. Miklic, Z. Kovacic, G. Vasiljevic, S. Bogdan,\nDecentralized Control of Multi-AGV Systems in Autonomous\nWarehousing Applications, IEEE Trans. Autom. Sci. Eng., Vol. 13,\nIssue 4, 2016, pp. 1433-1447. [11]. J. Xie, C. C. Liu, Multi-agent systems and their applications, J. Int. Council. Electr. Eng., Vol. 7, Issue 1, 2017, pp. 188-197. [12]. H. Meissner, R. Ilsen, J. C. Aurich, Analysis of Control Architectures in\nthe Context of Industry 4.0, Proc. CIRP, 2017, Vol. 62, pp.165-169. [13]. X. Jia, M. Q. Meng, A survey and analysis of task allocation algorithms in\nmulti-robot systems, in Proceedings of the IEEE International Conference\non Robotics and Biomimetics (ROBIO’13), 2013, pp. 2280-2305. [14].",
      "size": 919,
      "sentences": 29
    },
    {
      "id": 48,
      "content": "eng, A survey and analysis of task allocation algorithms in\nmulti-robot systems, in Proceedings of the IEEE International Conference\non Robotics and Biomimetics (ROBIO’13), 2013, pp. 2280-2305. [14]. A. R. Mosteo, L. Montano, A survey of multi-robot task allocation, Report\nAMI-009-10-TEC, Instituto de Investigación en Ingeniería de Aragón,\n2010, pp. 1-27. [15]. B. P. Gerkey, M. J. Mataric, A formal analysis and taxonomy of task\nallocation in multi-robot systems, Int. J. Robot. Res., Vol. 23, Issue 9,\n2004, pp. 939-954. [16]. A. Khamis, A. Hussein, A. Elmogy, Multi-robot Task Allocation: A\nReview of the State-of-the-Art, Coop. Robots Sensor. Netw., Vol. 2, 2015,\npp. 31-51. [17]. G. J. Cawood, I. A. Gorlach, Navigation and locomotion of a low-cost\nAutomated Guided Cart, in Proceedings of the Pattern Recognition\nAssociation of South Africa and Robotics and Mechatronics International\nConference (PRASA-RobMech’15), 2015, pp. 83-88. 21\n=== 페이지 22 ===\nAdvances in Robotics, Book Series, Vol.",
      "size": 998,
      "sentences": 23
    },
    {
      "id": 49,
      "content": "e Pattern Recognition\nAssociation of South Africa and Robotics and Mechatronics International\nConference (PRASA-RobMech’15), 2015, pp. 83-88. 21\n=== 페이지 22 ===\nAdvances in Robotics, Book Series, Vol. 3\n[18]. H. M. Barbera, J. P. C. Quinonero, M. A. Z. Izquierdo, A. G. Skarmeta,\ni-Fork: a flexible AGV system using topological and grid maps, in\nProceedings of the IEEE International Conference on Robotics &\nAutomation (ROBOT’03), Vol. 2, 2003, pp. 2147-2152. [19]. S. Lu, C. Xu, R. Y. Zhong, L. Wang, A RFID-enabled positioning system\nin automated guided vehicle for smart factories, J. Manuf. Syst., Vol. 44,\n2017, pp. 179-190. [20]. C. Feledy, S. Luttenberger, A state of the art map of the AGVS technology\nand a guideline for how and where to use it, Tech. Rep., University of Lund,\n2017. [21]. S. W. Yoon, S. B. Park, J. S. Kim, Kalman Filter Sensor Fusion for\nMecanum Wheeled Automated Guided Vehicle Localization, J. Sensors,\nVol. 2015, 2015, 347379. [22]. A. Ndao, M. Djoko-Kouam, A.-J.",
      "size": 994,
      "sentences": 23
    },
    {
      "id": 50,
      "content": "1]. S. W. Yoon, S. B. Park, J. S. Kim, Kalman Filter Sensor Fusion for\nMecanum Wheeled Automated Guided Vehicle Localization, J. Sensors,\nVol. 2015, 2015, 347379. [22]. A. Ndao, M. Djoko-Kouam, A.-J. Fougères, Matrix Beaconing for the\nLocation of Autonomous Industrial Vehicles on a Simulation Platform, in\nProceedings of the Third Int. Conference on Advances in Signal\nProcessing and Artificial Intelligence (ASPAI’21), Porto, Portugal,\nNov. 17-19, 2021, pp. 80-86. [23]. V. Kunchev, L. Jain, V. Ivancevic, A. Finn, Path planning and obstacle\navoidance for autonomous mobile robots: a review, in Proceedings of the\n10th International Conference on Knowledge-Based & Intelligent\nInformation & Engineering Systems (KES’06), 2006, pp. 537-544. [24]. D. H. Kim, N. T. Hai, W. Y. Joe, A Guide to Selecting Path Planning\nAlgorithm for Automated Guided Vehicle (AGV), Lect. Notes Electr. Eng., Vol. 465, 2018, pp. 587-96. [25].",
      "size": 921,
      "sentences": 20
    },
    {
      "id": 51,
      "content": "2006, pp. 537-544. [24]. D. H. Kim, N. T. Hai, W. Y. Joe, A Guide to Selecting Path Planning\nAlgorithm for Automated Guided Vehicle (AGV), Lect. Notes Electr. Eng., Vol. 465, 2018, pp. 587-96. [25]. E. Cardarelli, V. Digani, L. Sabattini, C. Secchi, C. Fantuzzi, Cooperative\ncloud robotics architecture for the coordination of multi-AGV systems in\nindustrial warehouses, Mechatronics, Vol. 45, 2017, pp. 1-13. [26]. A. M. Nascimento, L. F. Vismari, C. B. S. T. Molina, P. S. Cugnasca,\nJ. B. Camargo, J. R. de Almeida, A. Y. Hata, A Systematic Literature\nReview About the Impact of Artificial Intelligence on Autonomous\nVehicle Safety, IEEE Transactions on Intelligent Transportation Systems,\nVol. 21, Issue 12, 2019, pp. 4928-4946. [27]. S. C. Srivastava, A. K. Choudhary, Development of an intelligent\nagent-based AGV controller for a flexible manufacturing system, Int. J.\nAdv. Manuf. Technol., Vol. 36, 2008, pp. 780-797. [28].",
      "size": 930,
      "sentences": 25
    },
    {
      "id": 52,
      "content": "[27]. S. C. Srivastava, A. K. Choudhary, Development of an intelligent\nagent-based AGV controller for a flexible manufacturing system, Int. J.\nAdv. Manuf. Technol., Vol. 36, 2008, pp. 780-797. [28]. K. Jose, D. K. Pratihar, Task allocation and collision-free path planning of\ncentralized multi-robots system for industrial plant inspection using\nheuristic methods, Robot. Autonom. Syst., Vol. 80, 2016, pp. 34-42. [29]. V. Digani, F. Caramaschi, L. Sabattini, C. Secchi, C. Fantuzzi, Obstacle\navoidance for industrial AGVs, in Proceedings of the IEEE 10th\nInternational Conference on Intelligent Computer Communication and\nProcessing (ICCP’14), 2014, pp. 227-232. [30]. A. Winkler, J. Suchý, Dynamic Collision Avoidance of Industrial\nCooperating Robots Using Virtual Force Fields, IFAC Proceedings\nVolumes, Vol. 45, 2012, pp. 265-270. 22\n=== 페이지 23 ===\nChapter 1.",
      "size": 863,
      "sentences": 21
    },
    {
      "id": 53,
      "content": "[30]. A. Winkler, J. Suchý, Dynamic Collision Avoidance of Industrial\nCooperating Robots Using Virtual Force Fields, IFAC Proceedings\nVolumes, Vol. 45, 2012, pp. 265-270. 22\n=== 페이지 23 ===\nChapter 1. Collision and Obstacle Avoidance for Industrial Autonomous Vehicles –\nSimulation and Experimentation Based on a Cooperative Approach\n[31]. M. Jäger, B. Nebel, Decentralized collision avoidance, deadlock detection,\nand deadlock resolution for multiple mobile robots, in Proceedings of the\nIEEE/RSJ International Conference on Intelligent Robots and Systems. Expanding the Societal Role of Robotics in the Next Millennium\n(IROS’01), Vol. 3, 2001, pp. 1213-1219. [32]. D. Marino, A. Fagiolini, L. Pallottino, Distributed collision-free protocol\nfor AGVs in industrial environments, arXiv Preprint, 2011,\narXiv:1101.2270. [33]. G. Demesure, M. Defoort, A. Bekrar, D. Trentesaux, M. Djemai,\nDecentralized Motion Planning and Scheduling of AGVs in an FMS, IEEE\nTrans. Industrial Informatics, Vol.",
      "size": 990,
      "sentences": 15
    },
    {
      "id": 54,
      "content": "nt, 2011,\narXiv:1101.2270. [33]. G. Demesure, M. Defoort, A. Bekrar, D. Trentesaux, M. Djemai,\nDecentralized Motion Planning and Scheduling of AGVs in an FMS, IEEE\nTrans. Industrial Informatics, Vol. 14, Issue 4, 2018, pp. 1744-1752. [34]. Q. S. Kabir, Y. Suzuki, Comparative analysis of different routing heuristics\nfor the battery management of automated guided vehicles, Int. J. Prod. Res., Vol. 57, Issue 2, 2018, pp. 624-641. [35]. M. De Ryck, M. Versteyhe, K. Shariatmadar, Resource management in\ndecentralized industrial Automated Guided Vehicle systems, J. Manuf. Syst., Vol. 54, January 2020, pp. 204-214. [36]. C. Medrano-Berumen, M. İlhan Akbaş, Validation of decision-making in\nartificial intelligence-based autonomous vehicles, Journal of Information\nand Telecommunication, Vol. 5, Issue 1, 2021, pp. 83-103. [37].",
      "size": 827,
      "sentences": 23
    },
    {
      "id": 55,
      "content": "ano-Berumen, M. İlhan Akbaş, Validation of decision-making in\nartificial intelligence-based autonomous vehicles, Journal of Information\nand Telecommunication, Vol. 5, Issue 1, 2021, pp. 83-103. [37]. A. Daniel, K. Subburathinam, B. Muthu, N. Rajkumar, S. Pandian,\nProcuring Cooperative Intelligence in Autonomous Vehicles for Object\nDetection through Data Fusion Approach, IET Intel. Transport. Syst.,\nVol. 14, Issue 11, 2020, pp. 1410-1417. [38]. Intelligent Transport Systems (ITS), Vehicular Communications, Basic set\nof Applications, Part 2: Specification of Cooperative Awareness Basic\nService, ETSI EN 302 637-2 V1.3.2, ETSI, 2014. [39]. N. Lyamin, A. Vinel, M. Jonsson, B. Bellalta, Cooperative Awareness in\nVANETs: On ETSI EN 302 637-2 Performance, IEEE Transactions on\nVehicular Technology, Vol. 67, Issue 1, 2017, pp. 17-28. [40].",
      "size": 840,
      "sentences": 16
    },
    {
      "id": 56,
      "content": "]. N. Lyamin, A. Vinel, M. Jonsson, B. Bellalta, Cooperative Awareness in\nVANETs: On ETSI EN 302 637-2 Performance, IEEE Transactions on\nVehicular Technology, Vol. 67, Issue 1, 2017, pp. 17-28. [40]. Intelligent Transport Systems (ITS), Vehicular Communications, Basic set\nof Applications, Part 3: Specification of Decentralized Environmental\nNotification Basic Service, ETSI EN 302 637-3 V1.2.1, ETSI, 2014. [41]. J. Santa, F. Pereniguez-Garcia, A. Moragón, A. Skarmeta, Experimental\nevaluation of CAM and DENM messaging services in vehicular\ncommunications, Transportation Research Part C: Emerging\nTechnologies, Vol. 46, 2014, pp. 98-120. [42]. Intelligent Transport Systems (ITS), Vehicular Communications, Basic set\nof Applications, Analysis of the Collective Perception Service (CPS),\nRelease 2, ETSI TR 103 562 V2.1.1, ETSI, 2019. [43].",
      "size": 843,
      "sentences": 13
    },
    {
      "id": 57,
      "content": "2]. Intelligent Transport Systems (ITS), Vehicular Communications, Basic set\nof Applications, Analysis of the Collective Perception Service (CPS),\nRelease 2, ETSI TR 103 562 V2.1.1, ETSI, 2019. [43]. A. Correa, et al., On the Impact of V2X-based Maneuver Coordination on\nthe Traffic, in Proceedings of the IEEE 93rd Vehicular Technology\nConference (VTC2021-Spring’21), 25 April – 19 May, 2021, pp. 1-5. [44]. J. Grosset, A.-J. Fougères, M. Djoko-Kouam, C. Couturier, J.-M. Bonnin,\nSimulation of a collision and obstacle avoidance algorithm for cooperative\n23\n=== 페이지 24 ===\nAdvances in Robotics, Book Series, Vol. 3\nindustrial autonomous vehicles, in Proceedings of the 2nd IFSA Winter\nConf. on Automation, Robotics & Communications for Industry 4.0\n(ARCI’22), Andorra la Vella, Andorra, February 2-4, 2022, pp. 88-91. [45]. A.-J. Fougères, A Modelling Approach Based on Fuzzy Agents, Int. J. of\nComputer Science Issues, Vol. 9, Issue 6, 2013, pp. 19-28. [46].",
      "size": 960,
      "sentences": 18
    },
    {
      "id": 58,
      "content": "Andorra la Vella, Andorra, February 2-4, 2022, pp. 88-91. [45]. A.-J. Fougères, A Modelling Approach Based on Fuzzy Agents, Int. J. of\nComputer Science Issues, Vol. 9, Issue 6, 2013, pp. 19-28. [46]. C. M. Macal, Everything you need to know about agent-based modelling\nand simulation, Journal of Simulation, Vol. 10, Issue 2, 2016, pp. 144-156. [47]. D. Bechtsis, N. Tsolakis, D. Vlachos, J. S. Srai, Intelligent autonomous\nvehicles in digital supply chains: a framework for integrating innovations\ntowards sustainable value networks, Journal of Cleaner Production,\nVol. 181, 2020, pp. 60-71. [48]. Y. Maruyama, S. Kato, T. Azumi, Exploring the performance of ROS2, in\nProceedings of the 13th International Conference on Embedded Software\n(EMSOFT'16), 2016, pp. 1-10. [49]. A. Testa, A. Camisa., G. Notarstefano, ChoiRbot: A ROS 2 Toolbox for\nCooperative Robotics, arXiv Preprint, 2020, arXiv:2010.13431. 24",
      "size": 907,
      "sentences": 23
    }
  ]
}