{
  "source": "ArXiv",
  "filename": "011_HetSwarm__Cooperative_Navigation_of_Heterogeneous_.pdf",
  "total_chars": 26839,
  "total_chunks": 39,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nHetSwarm: Cooperative Navigation of Heterogeneous Swarm in\nDynamic and Dense Environments through Impedance-based Guidance\nMalaika Zafar1, Roohan Ahmed Khan1, Aleksey Fedoseev1, Kumar Katyayan Jaiswal2, and Dzmitry Tsetserukou1\nAbstract—With the growing demand for efficient logistics\nand warehouse management, unmanned aerial vehicles (UAVs)\nare emerging as a valuable complement to automated guided\nvehicles (AGVs). UAVs enhance efficiency by navigating dense\nenvironments and operating at varying altitudes. However,\ntheir limited flight time, battery life, and payload capacity\nnecessitate a supporting ground station. To address these\nchallenges,weproposeHetSwarm,aheterogeneousmulti-robot\nsystem that combines a UAV and a mobile ground robot for\ncollaborative navigation in cluttered and dynamic conditions.",
      "size": 827,
      "sentences": 4
    },
    {
      "id": 2,
      "content": "station. To address these\nchallenges,weproposeHetSwarm,aheterogeneousmulti-robot\nsystem that combines a UAV and a mobile ground robot for\ncollaborative navigation in cluttered and dynamic conditions. Ourapproachemploysanartificialpotentialfield(APF)-based\npath planner for the UAV, allowing it to dynamically adjust its\ntrajectoryinrealtime.Thegroundrobotfollowsthispathwhile\nmaintaining connectivity through impedance links, ensuring\nstable coordination. Additionally, the ground robot establishes Fig. 1: HetSwarm generates paths in a dense environment\ntemporal impedance links with low-height ground obstacles to where the UAV (black line) navigates towards the goal and\navoid local collisions, as these obstacles do not interfere with the mobile robot (blue dashed line) follows the UAV by\nthe UAV’s flight. maintaininganimpedancelinkconnection(reddashedline). Experimental validation of HetSwarm in diverse environ-\nmental conditions demonstrated a 90% success rate across 30\ntest cases.",
      "size": 992,
      "sentences": 7
    },
    {
      "id": 3,
      "content": "the UAV’s flight. maintaininganimpedancelinkconnection(reddashedline). Experimental validation of HetSwarm in diverse environ-\nmental conditions demonstrated a 90% success rate across 30\ntest cases. The ground robot exhibited an average deviation of However, UAVs have received wide attention in logistics\n45 cm near obstacles, confirming effective collision avoidance. due to their advantages of fast speed and efficient vertical\nCompared to the Conflict-Based Search (CBS) algorithm, our\nnavigation. For example, an inventory management system\napproach enables agents to navigate within 25 cm of obstacles,\nincorporating a swarm of mini-drones proposed by Cristiani\nwhereas CBS maintains a minimum clearance of 73 cm,\nhighlighting our method’s efficiency in utilizing space in real- etal. [4]withagenericarchitectureforUAV-basedinventory\ntime. Extensive simulations in the Gym PyBullet environment management.",
      "size": 911,
      "sentences": 8
    },
    {
      "id": 4,
      "content": "73 cm,\nhighlighting our method’s efficiency in utilizing space in real- etal. [4]withagenericarchitectureforUAV-basedinventory\ntime. Extensive simulations in the Gym PyBullet environment management. The segmentation model for precise position\nfurther validated the robustness of our system for real-world estimation of objects in inventory was proposed by Yoon et\napplications,demonstratingitspotentialfordynamic,real-time\nal. [5].Morerecently,heterogeneoussystemswereproposed\ntask execution in cluttered environments. to leverage the benefits of UAV mobility and the precise\nKeywords: Heterogeneous Robots, Leader-Follower Con-\npositioningofgroundrobots.Forexample,ateamofmobile\nnectivity, Dynamic Environments, Path Planning, Artificial\nandaerialrobotswasproposedbyKalinovetal. [6]forreal-\nPotentialFields,AdaptiveSystems,ImpedanceControl,For-\ntime barcode detection and scanning using Convolutional\nmation Control\nNeural Networks (CNN). The designed approach improved\nI.",
      "size": 973,
      "sentences": 8
    },
    {
      "id": 5,
      "content": "etal. [6]forreal-\nPotentialFields,AdaptiveSystems,ImpedanceControl,For-\ntime barcode detection and scanning using Convolutional\nmation Control\nNeural Networks (CNN). The designed approach improved\nI. INTRODUCTION the UAV’s localization using scanned barcodes and ground\nWith the development of automation and artificial intel- stations as landmarks in a real warehouse with low-light\nligence, the logistics and warehouse management sectors conditions. have experienced a significant shift toward more efficient While heterogeneous may improve both the precision and\nand automated solutions capable of decreasing the detection time of logistics, their navigation suffers from the additional\nerrorsduringinventory[1].Thetasksofindoorandlast-mile density of the swarm morphology. This paper introduces a\ndelivery commonly relied on AGVs and mobile robots, for HetSwarm setup that combines a drone and a ground robot\nexample,systemsproposedbyPaolantietal.",
      "size": 951,
      "sentences": 6
    },
    {
      "id": 6,
      "content": "of the swarm morphology. This paper introduces a\ndelivery commonly relied on AGVs and mobile robots, for HetSwarm setup that combines a drone and a ground robot\nexample,systemsproposedbyPaolantietal. [2]andMotroni in a leader-follower configuration, with the drone acting as\net al. [3], due to their high payload capacity and localization the leader while the ground robot follows them through\nprecision. impedance link [7] connectivity. In HetSwarm, the drone uses an APF path planner to\n1The authors are with the Intelligent Space Robotics Laboratory,\nnavigate to target positions while avoiding obstacles in a\nCenter for Digital Engineering, Skolkovo Institute of Science and\nTechnology, Moscow, Russia. {malaika.zafar, roohan.khan, highlydenseenvironment.Moreover,thegroundrobotmain-\naleksey.fedoseev, d.tsetserukou}@skoltech.ru tainsitsconnectionwiththedroneusingimpedancelinkages.",
      "size": 886,
      "sentences": 7
    },
    {
      "id": 7,
      "content": "gy, Moscow, Russia. {malaika.zafar, roohan.khan, highlydenseenvironment.Moreover,thegroundrobotmain-\naleksey.fedoseev, d.tsetserukou}@skoltech.ru tainsitsconnectionwiththedroneusingimpedancelinkages. 2The author is with the Multi-Robot Autonomy Laboratory,\nAdditionally, the ground robot makes additional impedance\nCenter for Digital Engineering, IISER Bhopal, Bhopal, India. kumar20@iiserb.ac.in links with low-height obstacles that are out of the range of\n5202\nbeF\n01\n]OR.sc[\n1v22760.2052:viXra\n=== 페이지 2 ===\nthe drone in order to work effectively in an obstacle-dense The HetSwarm system, inspired by the previous work of\nenvironment. The custom PID Path Follower was made for SwarmPath[14]andSwarmGear[16],introducesanewagile\nthe ground robot so that itcan follow the intended path with and safe path for heterogeneous systems in dynamic and\nfewer deviations. This collaborative system is also capable cluttered environments. of functioning in dynamic environments. III.",
      "size": 974,
      "sentences": 8
    },
    {
      "id": 8,
      "content": "ended path with and safe path for heterogeneous systems in dynamic and\nfewer deviations. This collaborative system is also capable cluttered environments. of functioning in dynamic environments. III. HETEROGENEOUSSWARMTECHNOLOGY\nFurthermore, the heterogeneous setup significantly en-\nhances efficiency for logistics tasks. A drone has the ability A. System Overview\nto carry only a limited payload due to its size and battery The HetSwarm system in Fig. 2 consists of a drone and\nconstraints whereas the ground robot can carry heavier pay- a ground robot working together in a dynamic environment. loads, thereby improving overall performance. Additionally, The drone generates and continuously updates its path using\nif the drone’s battery is depleted, it can land on the ground an APF planner, while the ground robot follows the drone’s\nrobot for recharging, ensuring uninterrupted operation. path via impedance links.",
      "size": 920,
      "sentences": 11
    },
    {
      "id": 9,
      "content": "the drone’s battery is depleted, it can land on the ground an APF planner, while the ground robot follows the drone’s\nrobot for recharging, ensuring uninterrupted operation. path via impedance links. Additionally, these links also help\nthe ground robot to navigate around smaller obstacles since\nII. RELATEDWORKS these obstacles are not in the range of a drone. The drone\nhandles navigation while globally avoiding obstacles, while\nLogisticsandwarehousemanagementhavebecomecrucial\nthe robot ensures obstacle-free movement while providing\ncomponents of the supply chain, with businesses demanding\na landing platform to the drone in case of reloading or\nmore efficient delivery solutions. In recent years, swarms of\nrecharging. States of both the agents are controlled by\nheterogeneousandhomogeneousagentshavebeenemployed\ntheir custom PID controller for accurate path following. for this purpose. This approach enables efficient collaboration in real-time,\nBatinovic et al.",
      "size": 971,
      "sentences": 9
    },
    {
      "id": 10,
      "content": "terogeneousandhomogeneousagentshavebeenemployed\ntheir custom PID controller for accurate path following. for this purpose. This approach enables efficient collaboration in real-time,\nBatinovic et al. [8] utilized the APF method to address especially in densely packed dynamic environments. the path planning challenge for aerial robots operating in an\nunknown environment, focusing on ensuring safe trajectory B. Artificial Potential Fields for Global Path Generation\nexecution and avoiding intricate obstacles using a LiDAR Inorderfortheleaderdronetonavigateefficientlyaround\nsensor.Inasimilarvein,Yuetal. [9]proposedaninnovative the obstacles while setting the path toward the goal, we\ndistributed control algorithm that integrates the APF tech- appliedtheAPFplanningalgorithm[17].Thealgorithmgen-\nniquewithinavirtualleaderformationscheme,coupledwith eratesavirtualforcethatattractsthedronetowardsthetarget\na switching communication network. Malopolski et al.",
      "size": 961,
      "sentences": 8
    },
    {
      "id": 11,
      "content": "lanningalgorithm[17].Thealgorithmgen-\nniquewithinavirtualleaderformationscheme,coupledwith eratesavirtualforcethatattractsthedronetowardsthetarget\na switching communication network. Malopolski et al. [10] and a repulsive force that pushes it away from obstacles. presented an autonomous mobile robot for transport tasks An optimized trajectory is generated using the combination\nin warehouses; a drive mechanism was proposed for surface of these two forces. The equations for APF planner are as\nand rail navigation and an elevator for vertical movement. follows [14]:\nHowever, the lack of aerial capabilities limits its ability to\nF =F +F (1)\naccess hard-to-reach areas and navigate dense environments, total attraction repulsion\nreducing adaptability in multi-level spaces. Zhura et al. [11] where\ninvestigated the impact of UAV in heterogeneous mapping\nand the navigation of a quadrupled robot. Sales et al.",
      "size": 909,
      "sentences": 9
    },
    {
      "id": 12,
      "content": "ttraction repulsion\nreducing adaptability in multi-level spaces. Zhura et al. [11] where\ninvestigated the impact of UAV in heterogeneous mapping\nand the navigation of a quadrupled robot. Sales et al. [12] F attraction (d g )=k att ·d g ,\ndeveloped a highly-scalable and low-cost multirobot system (cid:40) 0 if d >d\no safe\nfor inventory management composed of pairs with a micro- F repulsion (d o )= k · (cid:16) 1 − 1 (cid:17) if d ≤d\nUAV and a ground mobile robot. Castro et al. [13] proposed rep do dsafe o safe\nthestrategytoassistthecooperationofaheterogeneousrobot where d and d are the distances from drone to goal and\ng o\nteam that involves two UGVs and one UAV. The robots to obstacle, respectively, k and k are the attraction and\natt rep\noperate in a partially known dynamic environment where repulsion coefficients, respectively. they exchange information among themselves and perform\ntheir task of aerial and ground inspections. C. Impedance Controller\nKhanetal.",
      "size": 973,
      "sentences": 10
    },
    {
      "id": 13,
      "content": "n dynamic environment where repulsion coefficients, respectively. they exchange information among themselves and perform\ntheir task of aerial and ground inspections. C. Impedance Controller\nKhanetal. [14]proposedaleader-followerapproachusing Once the path of the drone was planned, to ensure\nan APF path planner and impedance controller for a multi- a smooth connecting mechanism, its connection with the\ndrone homogeneous system, allowing agents to plan the ground robot was establishedusing an impedance controller. path and navigate to the target in an unknown yet static These impedance links help the ground robot to stay con-\nenvironment. However, this approach could not work in nected with the leader drone and follow its path toward the\ndynamic environment scenarios. Additionally, this research target location. lacks the ability to operate over extended periods due to the 1) ConnectivityofMobileRobotwithDrone: Inthiscon-\nlimited battery life and flight time of the drones.",
      "size": 985,
      "sentences": 8
    },
    {
      "id": 14,
      "content": "lly, this research target location. lacks the ability to operate over extended periods due to the 1) ConnectivityofMobileRobotwithDrone: Inthiscon-\nlimited battery life and flight time of the drones. To over- figuration,thefollowergroundrobotpositioniscoupledwith\ncome the individual limitations of aerial and ground robots, the leader-drone APF trajectory, which serves as the leading\nheterogeneous swarm systems have been used. Chen et al. trajectory, through a mass-spring-damper system. Thereby,\n[15]targetsearchandnavigationanddesignaheterogeneous creating virtual impedance links among the drone and the\nrobotsystemconsistingofaUAVandaUGVforsearchand ground robot. These impedance links provide a smooth\nrescue missions in unknown environments. connectionamongtheagents.Thelinksareestablishedusing\n=== 페이지 3 ===\nFig. 2: Figure shows the overall system architecture and the pipeline of HetSwarm. a second-order differential equation of mass-spring-damper, IV.",
      "size": 964,
      "sentences": 10
    },
    {
      "id": 15,
      "content": "gtheagents.Thelinksareestablishedusing\n=== 페이지 3 ===\nFig. 2: Figure shows the overall system architecture and the pipeline of HetSwarm. a second-order differential equation of mass-spring-damper, IV. EXPERIMENTALEVALUATION\nwhich is given as:\nA. Experimental Setup in GymPybullet Environment\nA custom simulation environment has been developed in\nm∆x¨+d∆x˙ +k∆x=F (t) (2)\next\ntheGymPyBulletenvironment3,incorporatingthedynamics\nwhere ∆x is the difference between the current and desired of both a drone and a mobile robot. The environment allows\nmobilerobotpositionandF (t)isthevirtualexternalforce the visualization of multiple obstacles, and the obstacles can\next\napplied as an input from the leader drone. m is the virtual be moved dynamically. A custom PID controller has been\nmass of a link, d is the damping coefficient of the virtual implemented for the mobile robot that helps it to follow the\ndamper, and k is the virtual spring constant.",
      "size": 945,
      "sentences": 8
    },
    {
      "id": 16,
      "content": "A custom PID controller has been\nmass of a link, d is the damping coefficient of the virtual implemented for the mobile robot that helps it to follow the\ndamper, and k is the virtual spring constant. path by adjusting its velocity and steering angles, while the\n2) Connectivity of Mobile Robot with Ground Obstacles: drone’s PID controller ensures stable and controlled drone\nThe APF trajectory generated by the leader drone does not flight. This setup creates realistic interactions among the\naccount for smaller obstacles. To avoid collisions between drone and mobile robot in dynamic environments, making\nthe mobile robot and obstacles, we enabled the ground itsuitablefortestingheterogeneousrobotsinreal-world-like\nrobot to establish additional links with the obstacles while conditions.",
      "size": 791,
      "sentences": 4
    },
    {
      "id": 17,
      "content": "onments, making\nthe mobile robot and obstacles, we enabled the ground itsuitablefortestingheterogeneousrobotsinreal-world-like\nrobot to establish additional links with the obstacles while conditions. The drone utilizes the APF planner to generate\nsimultaneously disconnecting from the drone, ensuring a and adjust its path in real-time; simultaneously, the mobile\ncollision-free path: robot maintains the connectivity with the drone and ground\nobstaclesusingimpedancelinks.Toevaluatetheadaptability\nand robustness of the system, experiments were performed\n∆x =k ·r (3)\nrobot,n impF imp\non multiple cases. In a dynamic environment, three cases\nwherer istheradiusofthelocaldeflectionregionaround were performed from sparse to dense scenarios; cases were\nimp\nthe obstacle, k is the force coefficient adjusted to the run thirty times to check the algorithm’s robustness and\nimpF\nground robot’s average velocity, and n is the number of repeatability of performance.",
      "size": 960,
      "sentences": 3
    },
    {
      "id": 18,
      "content": "bstacle, k is the force coefficient adjusted to the run thirty times to check the algorithm’s robustness and\nimpF\nground robot’s average velocity, and n is the number of repeatability of performance. Similarly, in static environ-\nmobile robots. ments, experiments were run under varying conditions to do\na detailed analysis. D. Dynamic Environment\nB. Results\nHetSwarm introduces a novel approach to path planning\nand coordination using a heterogeneous robot team with a 1) Results in static environment: As the leader, the drone\nUAVandamobilerobot.Thesystemadjustsdynamicallyby generates its path using the APF planner, while the mobile\ncontinuously updating the drone’s APF path based on real- robot follows this path by maintaining impedance links,\ntime environmental changes. As obstacles shift, the drone resulting in a distinct trajectory shown in Fig.",
      "size": 857,
      "sentences": 6
    },
    {
      "id": 19,
      "content": "the drone’s APF path based on real- robot follows this path by maintaining impedance links,\ntime environmental changes. As obstacles shift, the drone resulting in a distinct trajectory shown in Fig. 4.\nadjusts its trajectory, and the setup allows the mobile robot Furthermore, the mobile robot avoids obstacles encoun-\nto adapt to the changes. Additionally, the mobile robot can tered along its path, leading to impedance deflections that\nalso dynamically react to obstacles in its path, ensuring are also illustrated in the figure. The green circles represent\nit can navigate through unpredictable or cluttered spaces. ground-level obstacles, and the graph demonstrates that the\nThis adaptability allows HetSwarm to operate efficiently in drone’s trajectory remains straight, passing over these ob-\ndynamic environments, ensuring both agents can respond to stacles while the mobile robot effectively navigates around\nnew challenges as they arise. them. Fig. 4a, Fig. 4b, and Fig.",
      "size": 980,
      "sentences": 10
    },
    {
      "id": 20,
      "content": "ing over these ob-\ndynamic environments, ensuring both agents can respond to stacles while the mobile robot effectively navigates around\nnew challenges as they arise. them. Fig. 4a, Fig. 4b, and Fig. 4c represent three cases\n=== 페이지 4 ===\ndensely packed obstacles. 4) VelocityDistributionalongthetrajectory: Fig.6shows\nthe distribution of velocities along the trajectory path for\ndroneFig.6a,andgroundrobotFig.6b.Theplotshowshow\nsignificantly the velocities of each of the agents change over\ntime, providing insights into their acceleration and deceler-\nation corresponding to changing applied forces. Simulation\nshows that agents move faster with greater velocity near the\nregion of obstacles. This behavior could be indicative of a\nstrategy where the agent adjusts its velocity due to applied\nrepulsive and impedance forces within the obstacle’s close\nFig.",
      "size": 858,
      "sentences": 9
    },
    {
      "id": 21,
      "content": "ocity near the\nregion of obstacles. This behavior could be indicative of a\nstrategy where the agent adjusts its velocity due to applied\nrepulsive and impedance forces within the obstacle’s close\nFig. 3: Experimental setup in Gym Pybullet environment proximity to avoid collisions while maintaining a shortest\nshowingthetrajectoryofdroneandmobilerobotunderdense and time-optimal trajectory. environment. 5) Time efficiency in task completion for multiple agents:\nTo check the robustness and system adaptability under vary-\ning conditions, we conducted experiments on two different\nwith the same starting and goal positions of the agent,\nenvironments, shown in Fig. 4c, and Fig. 4d, with varying\ndemonstrating how the algorithm effectively handles both\nstarting and goal positions, both in a static and dynamic\nsparse and dense scenarios. Furthermore, by changing the\nenvironment.",
      "size": 878,
      "sentences": 8
    },
    {
      "id": 22,
      "content": ", with varying\ndemonstrating how the algorithm effectively handles both\nstarting and goal positions, both in a static and dynamic\nsparse and dense scenarios. Furthermore, by changing the\nenvironment. Table II shows how the trajectory lengths and\ninitial and target positions, different path planning scenarios\nmissiontimechangeundervaryingenvironmentalconditions. can be tested, as shown in Fig. 4d. 2) Results in dynamic environment: Real-time simulation\nTABLE II: Swarm Behavior in Varying Conditions\nwas also performed on dynamic environments involving\nthe continuous movement of one ground obstacle and one TimeEfficiencyalongwithlengthoftrajectoriesofLeader-Drone\nobstacle that was deflected by both the drone and mobile Case StaticEnvironment DynamicEnvironment\nrobot.Fig.5showstheteststhatwereperformedintwomain Trajectory Completion Trajectory Completion\ncaseswithsparse(Fig.5a)anddense(Fig.5b)environments.",
      "size": 915,
      "sentences": 6
    },
    {
      "id": 23,
      "content": "nd mobile Case StaticEnvironment DynamicEnvironment\nrobot.Fig.5showstheteststhatwereperformedintwomain Trajectory Completion Trajectory Completion\ncaseswithsparse(Fig.5a)anddense(Fig.5b)environments. length(m) time(s) length(m) time(s)\nThe change of path can be observed in the region where the 1 8.18 25.05 8.02 25.03\nmovement of the obstacle takes place. The same behavior 2 9.11 25.42 9.25 25.87\nis observed in a cluttered environment, shown in Fig.5c and\nFig.5d. The results revealed the deficient adaptable behav- The trajectory length along with completion time may\nior of heterogeneous swarm under multiple environmental increase or decrease depending on whether the agents en-\nconditions.",
      "size": 696,
      "sentences": 4
    },
    {
      "id": 24,
      "content": "ient adaptable behav- The trajectory length along with completion time may\nior of heterogeneous swarm under multiple environmental increase or decrease depending on whether the agents en-\nconditions. countertheobstacles.Theseresultsdemonstratethesystem’s\n3) Error between path planning and ground truth in ability to handle real-time tasks and quickly and effectively\nsimulation environment: Since the planning is conducted adapt to environmental changes, making it suitable for real-\nin a real-time environment, the drone’s position exhibits world applications in logistics and warehouse management. negligible errors. However, deviations are observed in the 6) Success Rate: Simulations on the heterogeneous\nmobile robot’s impedance path due to its additional respon- swarm were conducted under multiple environmental con-\nsibility of avoiding ground-level obstacles. These deviations ditions.",
      "size": 895,
      "sentences": 5
    },
    {
      "id": 25,
      "content": "heterogeneous\nmobile robot’s impedance path due to its additional respon- swarm were conducted under multiple environmental con-\nsibility of avoiding ground-level obstacles. These deviations ditions. A total of 30 experiments were performed, out of\nareparticularlynoticeableinregionswheregroundobstacles which 27 were successful. Failures occurred when either\nare present, as the mobile robot must adjust its trajectory to of the two agents collided with an obstacle in the dynamic\nnavigate around them. This behavior is consistent with the environment,particularlywhentheobstacle’sspeedexceeded\nsystem’s design, where the mobile robot prioritizes obstacle that of the agents, causing it to suddenly block the agent’s\navoidance while maintaining connectivity with the drone. planned path. Therefore, the success rate, calculated as:\nTableIshowsthedeviationsofactualmobilerobotpositions\n(cid:18) (cid:19)\nSuccessful Experiments\nfrom the planned positions.",
      "size": 954,
      "sentences": 7
    },
    {
      "id": 26,
      "content": "ity with the drone. planned path. Therefore, the success rate, calculated as:\nTableIshowsthedeviationsofactualmobilerobotpositions\n(cid:18) (cid:19)\nSuccessful Experiments\nfrom the planned positions. Success Rate= ×100 (4)\nTotal Experiments\nTABLE I: Error between Path Planning and Actual Perfor-\nwas computed to be 90%. The success rate shows that the\nmance in Simulation Environment\nsystem is relatively robust, with a strong ability to navigate\nCASENO. : I II III IV and adapt to different dynamic conditions. GroundRobotDeviations(m) 0.45 0.45 0.45 0.43\nC. ComparisonwithConflict-BasedSearch(CBS)Algorithm\nFig.",
      "size": 614,
      "sentences": 7
    },
    {
      "id": 27,
      "content": "ith a strong ability to navigate\nCASENO. : I II III IV and adapt to different dynamic conditions. GroundRobotDeviations(m) 0.45 0.45 0.45 0.43\nC. ComparisonwithConflict-BasedSearch(CBS)Algorithm\nFig. 4 shows that mobile robot deviations are higher The CBS path planning algorithm can operate in both 2D\naround the ground obstacles; however, they are still main- and3Denvironments.ThedronetrajectorygeneratedbyAPF\ntained in the safe operating region, which shows the reli- wascomparedwiththe3DsetupoftheCBSalgorithm,while\nability of the path planning system and the robot’s ability the mobile robot trajectory was compared with the 2D setup\nto handle environmental challenges, despite the presence of of the CBS algorithm (Table III). [표 데이터 감지됨]\n\n=== 페이지 5 ===\nFig. 4: Simulation results of two different cases: sparse (a,b) to dense (c,d). Each case is formed with two different initial\nand target positions.",
      "size": 909,
      "sentences": 7
    },
    {
      "id": 28,
      "content": "algorithm (Table III). [표 데이터 감지됨]\n\n=== 페이지 5 ===\nFig. 4: Simulation results of two different cases: sparse (a,b) to dense (c,d). Each case is formed with two different initial\nand target positions. Black dots are the obstacles for both drones and mobile robots, green dots are the ground obstacles\ndeflected only by the mobile robot. Gray and light green-colored circles show the safe deflection regions for both agents. TABLE III: Trajectory Length and Minimum Obstacle Dis-\nmove between obstacles, encountering multiple deflections,\ntance Comparison with Classic CBS Algorithm\nwhichincreasetheirpathlength.Despitethis,APFexcelsin\nterms of minimum obstacle distance; agents maintain a very\nTrajectoryLength\nclose distance to obstacles while still avoiding collisions. In\nCase 2DEnvironment 3DEnvironment\ncomparison,CBSagentsmaintainaminimumdistanceof72\nCBS mobilerobot CBS Drone\ncm, reflecting a more cautious but less flexible path.",
      "size": 935,
      "sentences": 8
    },
    {
      "id": 29,
      "content": "while still avoiding collisions. In\nCase 2DEnvironment 3DEnvironment\ncomparison,CBSagentsmaintainaminimumdistanceof72\nCBS mobilerobot CBS Drone\ncm, reflecting a more cautious but less flexible path. 1 10.39 9.02 7.5 7.86\n2 10.39 12.36 7.5 8.18 D. Conclusion and Future Work\nMinimumObstacleDistance The research presents a heterogeneous swarm system\nCase 2DEnvironment 3DEnvironment comprising of a drone and the mobile robot, designed\n1 0.73 0.25 0.75 0.38 to collaborate in dynamic environments for logistics and\n2 0.72 0.25 0.75 0.37 warehouse management tasks.",
      "size": 563,
      "sentences": 3
    },
    {
      "id": 30,
      "content": "ent 3DEnvironment comprising of a drone and the mobile robot, designed\n1 0.73 0.25 0.75 0.38 to collaborate in dynamic environments for logistics and\n2 0.72 0.25 0.75 0.37 warehouse management tasks. This research works on a\nleader-followerapproachwhereadrone,beingaleader,uses\nan APF path planner to navigate to goal positions while\nWithsimilarenvironmentalconfigurations,theCBStrajec- avoidingobstacles.Additionally,themobilerobotfollowsthe\ntory in Case 1, where there are fewer obstacles, shows that drone using impedance links that connect the drone with the\nagents tend to move around obstacles, resulting in a longer mobilerobot.Moreover,themobilerobotdevelopsadditional\npath. In contrast, APF agents navigate within obstacles, impedance links with the ground obstacles to ensure smooth\nleading to more efficient paths. However, in Case 2, where navigation toward the goal.",
      "size": 879,
      "sentences": 4
    },
    {
      "id": 31,
      "content": "h. In contrast, APF agents navigate within obstacles, impedance links with the ground obstacles to ensure smooth\nleading to more efficient paths. However, in Case 2, where navigation toward the goal. theenvironmentismoredenselypackedwithobstacles,CBS Thesystemalsoprovidesefficientnavigationoftheswarm\nagents ignore the inner regions and move around obstacles in dynamic and cluttered environments, thereby enhancing\nto complete the trajectory. On the other hand, APF agents the adaptability and performance of the system in real-time\n[표 데이터 감지됨]\n\n=== 페이지 6 ===\nFig. 5: Simulation examples of dynamic obstacle avoidance in sparse (a,b) and dense (c,d) environments. Dashed purple\nlines are the obstacle trajectories. Black dots are the obstacles for both robots, green dots are the ground obstacles deflected\nonly by the mobile robot. Gray and light green-colored circles show the safe deflection regions for both agents. scenarios.",
      "size": 932,
      "sentences": 9
    },
    {
      "id": 32,
      "content": "he obstacles for both robots, green dots are the ground obstacles deflected\nonly by the mobile robot. Gray and light green-colored circles show the safe deflection regions for both agents. scenarios. By combining the two agents, the system proves\nto have the complementary strengths of both a drone and\na mobile robot. Multiple experiments were performed on\nthissystem,achievingasuccessrateof90%.Additionally,a\nsmall deviation of about 45 cm was observed in the mobile\nrobot’s path, particularly near the ground obstacles region,\nindicating the robot is effectively avoiding them. The current approach was later compared with the\nConflict-Based Search (CBS) algorithm, which reveals that\nour approach enables agents to safely yet optimally navi-\ngate within 25 cm of obstacles, whereas CBS maintains a\nminimum distance of 73 cm. In the future, we plan to expand this system to include\nmultiple drones and mobile robots working together in more\ncomplex environments.",
      "size": 965,
      "sentences": 7
    },
    {
      "id": 33,
      "content": "obstacles, whereas CBS maintains a\nminimum distance of 73 cm. In the future, we plan to expand this system to include\nmultiple drones and mobile robots working together in more\ncomplex environments. We also aim to test the system\nFig. 6: Visualization of Velocity Variations along the Agents\nin real-world settings, ensuring its feasibility in practical\nTrajectory\nlogistics and warehouse operations. === 페이지 7 ===\nREFERENCES collision avoidance and switching communication network,” IEEE\nTransactionsonFuzzySystems,vol.32,no.3,pp.1435–1445,2024. [1] S. Lo´pez-Soriano and Rafael Pous, “Inventory robots: Performance\n[10] WaldemarMałopolskiandSebastianSkoczypiec, “Theconceptofan\nevaluationofanrfid-basednavigationstrategy,”IEEESensorsJournal,\nautonomous mobile robot for automating transport tasks in high-bay\nvol.23,no.14,pp.16210–16218,2023. warehouses,” AdvancesinScienceandTechnologyResearchJournal,\n[2] Marina Paolanti, Mirco Sturari, Adriano Mancini, Primo Zingaretti,\nvol.18,pp.1–10,042024.",
      "size": 998,
      "sentences": 7
    },
    {
      "id": 34,
      "content": "in high-bay\nvol.23,no.14,pp.16210–16218,2023. warehouses,” AdvancesinScienceandTechnologyResearchJournal,\n[2] Marina Paolanti, Mirco Sturari, Adriano Mancini, Primo Zingaretti,\nvol.18,pp.1–10,042024. and Emanuele Frontoni, “Mobile robot for retail surveying and\n[11] Iana Zhura, Denis Davletshin, Nipun Dhananjaya Weerakkodi Mu-\ninventoryusingvisualandtextualanalysisofmonocularpicturesbased\ndalige,AlekseyFedoseev,RobinroyPeter,andDzmitryTsetserukou,\non deep learning,” in 2017 European Conference on Mobile Robots\n“Neuroswarm: Multi-agent neural 3d scene reconstruction and seg-\n(ECMR),2017,pp.1–6. mentation with uav for optimal navigation of quadruped robot,” in\n[3] Andrea Motroni, Salvatore D’Avella, Alice Buffi, Paolo Tripicchio,\n2023IEEEInternationalConferenceonSystems,Man,andCybernet-\nMatteoUnetti,GlaucoCecchi,andPaoloNepa, “Advancedrfid-robot\nics(SMC),2023,pp.2525–2530.",
      "size": 883,
      "sentences": 4
    },
    {
      "id": 35,
      "content": "i, Salvatore D’Avella, Alice Buffi, Paolo Tripicchio,\n2023IEEEInternationalConferenceonSystems,Man,andCybernet-\nMatteoUnetti,GlaucoCecchi,andPaoloNepa, “Advancedrfid-robot\nics(SMC),2023,pp.2525–2530. with rotating antennas for smart inventory in high-density shelving\n[12] Augusto Sales, Pedro Mira, Ana Maria Nascimento, Alexandre\nsystems,” IEEEJournalofRadioFrequencyIdentification,vol.8,pp. Branda˜o, Martin Saska, and Tiago Nascimento, “Heterogeneous\n559–570,2024. multi-robotsystemsapproachforwarehouseinventorymanagement,”\n[4] DavideCristiani,FilippoBottonelli,AngeloTrotta,andMarcoDiFe-\nin 2023 International Conference on Unmanned Aircraft Systems\nlice, “Inventory management through mini-drones: Architecture and\n(ICUAS),2023,pp.389–394.",
      "size": 746,
      "sentences": 4
    },
    {
      "id": 36,
      "content": "i,FilippoBottonelli,AngeloTrotta,andMarcoDiFe-\nin 2023 International Conference on Unmanned Aircraft Systems\nlice, “Inventory management through mini-drones: Architecture and\n(ICUAS),2023,pp.389–394. proof-of-concept implementation,” in 2020 IEEE 21st International\n[13] Gabriel Castro, Tatiana Santos, Fabio Andrade, Jose´ Lima, Diego\nSymposium on ”A World of Wireless, Mobile and Multimedia Net-\nHaddad,LeonardoHono´rio,andMilenaFariaPinto, “Heterogeneous\nworks”(WoWMoM),2020,pp.317–322. multi-robot collaboration for coverage path planning in partially\n[5] Bohan Yoon, Hyeonha Kim, Geonsik Youn, and Jongtae Rhee, “3d\nknowndynamicenvironments,” Machines,vol.12,pp.200,032024. position estimation of objects for inventory management automation\n[14] Roohan Ahmed Khan, Malaika Zafar, Amber Batool, Aleksey Fe-\nusingdrones,” AppliedSciences,vol.13,no.19,2023.",
      "size": 859,
      "sentences": 4
    },
    {
      "id": 37,
      "content": ".12,pp.200,032024. position estimation of objects for inventory management automation\n[14] Roohan Ahmed Khan, Malaika Zafar, Amber Batool, Aleksey Fe-\nusingdrones,” AppliedSciences,vol.13,no.19,2023. doseev, and Dzmitry Tsetserukou, “Swarmpath: Drone swarm nav-\n[6] Ivan Kalinov, Alexander Petrovsky, Valeriy Ilin, Egor Pristanskiy,\nigation through cluttered environments leveraging artificial potential\nMikhail Kurenkov, Vladimir Ramzhaev, Ildar Idrisov, and Dzmitry\nfieldandimpedancecontrol,”2024. Tsetserukou,“Warevision:Cnnbarcodedetection-baseduavtrajectory\n[15] YunChenandJiapingXiao, “Targetsearchandnavigationinhetero-\noptimizationforautonomouswarehousestocktaking,” IEEERobotics\ngeneous robot systems with deep reinforcement learning,” Machine\nandAutomationLetters,vol.5,no.4,pp.6647–6653,2020. IntelligenceResearch,vol.22,no.1,pp.79–90,Jan.2025.",
      "size": 855,
      "sentences": 5
    },
    {
      "id": 38,
      "content": "housestocktaking,” IEEERobotics\ngeneous robot systems with deep reinforcement learning,” Machine\nandAutomationLetters,vol.5,no.4,pp.6647–6653,2020. IntelligenceResearch,vol.22,no.1,pp.79–90,Jan.2025. [7] Neville Hogan, “Impedance control: An approach to manipulation,”\n[16] Zhanibek Darush, Mikhail Martynov, Aleksey Fedoseev, Aleksei\nin1984AmericanControlConference,1984,pp.304–313. Shcherbak, and Dzmitry Tsetserukou, “Swarmgear: Heterogeneous\n[8] AnaBatinovic,JuricaGoricanec,LovroMarkovic,andStjepanBog-\nswarm of drones with reconfigurable leader drone and virtual\ndan, “Path planning with potential field-based obstacle avoidance in\nimpedancelinksformulti-robotinspection,”2023. a 3d environment by an unmanned aerial vehicle,” in Proc. 2022\n[17] Haoyang Li, “Robotic path planning strategy based on improved\nInternational Conference on Unmanned Aircraft Systems (ICUAS),\nartificialpotentialfield,”in2020InternationalConferenceonArtificial\n2022,pp.394–401.",
      "size": 961,
      "sentences": 6
    },
    {
      "id": 39,
      "content": ", “Robotic path planning strategy based on improved\nInternational Conference on Unmanned Aircraft Systems (ICUAS),\nartificialpotentialfield,”in2020InternationalConferenceonArtificial\n2022,pp.394–401. IntelligenceandComputerEngineering(ICAICE),2020,pp.67–71. [9] YajingYu,ChenChen,JianGuo,MohammedChadli,andZhengrong\nXiang,“Adaptiveformationcontrolforunmannedaerialvehicleswith",
      "size": 376,
      "sentences": 3
    }
  ]
}