{
  "source": "ArXiv",
  "filename": "032_An_End-To-End_Analysis_of_Deep_Learning-Based_Rema.pdf",
  "total_chars": 29456,
  "total_chunks": 44,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nAn End-To-End Analysis of Deep Learning-Based\nRemaining Useful Life Algorithms for\nSatefy-Critical 5G-Enabled IIoT Networks\nLorenzo Mario Amorosa1,2,*, Nicolo` Longhi1,2,*, Giampaolo Cuozzo2, Weronika Maria Bachan1,2, Valerio Lieti3,\nEnrico Buracchini4, and Roberto Verdone1,2\n1DEI, University of Bologna, Italy\n2WiLab, CNIT, Italy\n3Nokia Solutions and Networks Italia S.p.A., Italy\n4Telecom Italia S.p.A., Italy\n*{lorenzomario.amorosa, nicolo.longhi}@unibo.it\nAbstract—RemainingUsefulLife(RUL)predictionisacritical In particular, we consider an Industrial Internet of Things\ntaskthataimstoestimatetheamountoftimeuntilasystemfails, (IIoT) safety-critical use case [2] where the factory floor\nwhere the latter is formed by three main components, that is,\ncontains Automated Guided Vehicles (AGVs) that transport\nthe application, communication network, and RUL logic. In this\ndangerous liquids whose fall may cause injuries to workers.",
      "size": 947,
      "sentences": 2
    },
    {
      "id": 2,
      "content": "omponents, that is,\ncontains Automated Guided Vehicles (AGVs) that transport\nthe application, communication network, and RUL logic. In this\ndangerous liquids whose fall may cause injuries to workers. paper,weprovideanend-to-endanalysisofanentireRUL-based\nchain. Specifically, we consider a factory floor where Automated These failure events can be foreseen by RUL algorithms. Guided Vehicles (AGVs) transport dangerous liquids whose fall The communication infrastructure is based on 5G New Radio\nmay cause injuries to workers. Regarding the communication (5G NR),wheretheAGVsareequippedwith5GUserEquip-\ninfrastructure,theAGVsareequippedwith5GUserEquipments\nments (UEs) that collect real-time data of their movements\n(UEs) that collect real-time data of their movements and send\nand send them to an application server. The RUL logic is\nthem to an application server.",
      "size": 865,
      "sentences": 7
    },
    {
      "id": 3,
      "content": "s) that collect real-time data of their movements\n(UEs) that collect real-time data of their movements and send\nand send them to an application server. The RUL logic is\nthem to an application server. The RUL logic consists of a Deep\nLearning(DL)-basedpipelinethatassessesiftherewillbeliquid implemented at the server and consists of a Deep Learning\nfalls by analyzing the collected data, and, eventually, sending (DL)-based pipeline that analyses the collected data and as-\ncommandstotheAGVstoavoidsuchadanger.Accordingtothis sesses if there will be liquid falls. Whenever a liquid fall is\nscenario, we performed End-to-End 5G NR-compliant network\nforeseen, the server sends a command to the AGV to avoid\nsimulations to study the Round-Trip Time (RTT) as a function\nthis danger.",
      "size": 778,
      "sentences": 4
    },
    {
      "id": 4,
      "content": "id fall is\nscenario, we performed End-to-End 5G NR-compliant network\nforeseen, the server sends a command to the AGV to avoid\nsimulations to study the Round-Trip Time (RTT) as a function\nthis danger. of the overall system bandwidth, subcarrier spacing, and modu-\nlationorder.Then,viareal-worldexperiments,wecollectdatato\ntrain, test and compare 7 DL models and 1 baseline threshold-\nbased algorithm in terms of cost and average advance. Finally, For the aforementioned RUL scenario, this work provides\nweassesswhetherornottheRTTprovidedbyfourdifferent5G three main results.",
      "size": 573,
      "sentences": 3
    },
    {
      "id": 5,
      "content": "reshold-\nbased algorithm in terms of cost and average advance. Finally, For the aforementioned RUL scenario, this work provides\nweassesswhetherornottheRTTprovidedbyfourdifferent5G three main results. First, we performed End-to-End (E2E)\nNRnetworkarchitecturesiscompatiblewiththeaverageadvance 5G NR-compliant network simulations to study the Round-\nprovided by the best-performing one-Dimensional Convolutional\nTrip Time (RTT) as a function of the different system pa-\nNeuralNetwork(1D-CNN).Numericalresultsshowunderwhich\nrameters, such as the overall system bandwidth, subcarrier\nconditions the DL-based approach for RUL estimation matches\nwiththeRTTperformanceprovidedbydifferent5GNRnetwork spacing, and modulation order. Then, by means of exper-\narchitectures.",
      "size": 763,
      "sentences": 4
    },
    {
      "id": 6,
      "content": "idth, subcarrier\nconditions the DL-based approach for RUL estimation matches\nwiththeRTTperformanceprovidedbydifferent5GNRnetwork spacing, and modulation order. Then, by means of exper-\narchitectures. iments in a real-world industrial plant, we collected AGV\nmovement data to train, test and compare 7 DL models and\nIndex Terms—Deep Learning (DL), Remaining Useful Life\na baseline threshold-based algorithm in terms of cost (i.e., a\n(RUL),IndustrialInternetofThings(IIoT),5G,NR,Round-Trip\nTime (RTT), End-to-End (E2E). metric related to the number of erroneous predictions) and\naverage advance (a metric quantifying the advance time of\nI. INTRODUCTION the prediction w.r.t the liquid fall). Finally, we evaluate the\ncompatibility between the average advance provided by the\nRemaining Useful Life (RUL) estimation is a predictive\nbest-performing1DConvolutionalNeuralNetwork(1D-CNN)\ntask that determine the time until a system fails.",
      "size": 930,
      "sentences": 6
    },
    {
      "id": 7,
      "content": "tween the average advance provided by the\nRemaining Useful Life (RUL) estimation is a predictive\nbest-performing1DConvolutionalNeuralNetwork(1D-CNN)\ntask that determine the time until a system fails. Through the\nand the RTT provided by four different 5G NR network\nutilization of Artificial Intelligence (AI) algorithms, RUL pre-\narchitectures.Thesearchitecturesalignwiththoseforeseenby\ndiction provides a means to optimize maintenance strategies,\n3rd Generation Partnership Project (3GPP) and 5G Alliance\nminimize downtime, and foresee system failures, encompass-\nfor Connected Industries and Automation (5G-ACIA) [3], [4]. ing the integration of sensor data and proactive approaches\nacross diverse industrial sectors [1]. Generally speaking, a\nRUL-based chain is made of three main components, i.e., (i) The paper is thus organized as follows. Sec. II describes all\nthe application, (ii) communication network, and (iii) RUL the features of our E2E 5G NR-compliant network simulator,\nlogic.",
      "size": 992,
      "sentences": 6
    },
    {
      "id": 8,
      "content": "s, i.e., (i) The paper is thus organized as follows. Sec. II describes all\nthe application, (ii) communication network, and (iii) RUL the features of our E2E 5G NR-compliant network simulator,\nlogic. To the best of the authors’ knowledge, there is no whereas Sec. III illustrates how we created the dataset and\ncontributionthatjointlyanalyzesallthreeelements.Thispaper designed the DL-based pipeline for RUL estimation. Then,\nthen aims to fill this gap. Sec. IV provides a mathematical formulation of RTT, while\nthe corresponding numerical results are presented in Sec. V.\nNicolo` LonghiPh.D.hasbeenfundedbyTelecomItaliaS.p.A. Finally, Sec. VI summarizes the main findings of our paper. © 2023 IEEE. Personal use of this material is permitted.",
      "size": 743,
      "sentences": 13
    },
    {
      "id": 9,
      "content": "lts are presented in Sec. V.\nNicolo` LonghiPh.D.hasbeenfundedbyTelecomItaliaS.p.A. Finally, Sec. VI summarizes the main findings of our paper. © 2023 IEEE. Personal use of this material is permitted. Permission from IEEE must be obtained for all other uses, in any\ncurrent or future media, including reprinting/republishing this material for advertising or promotional purposes, creating new\ncollective works, for resale or redistribution to servers or lists, or reuse of any copyrighted component of this work in other\nworks. 3202\nguA\n13\n]IN.sc[\n2v23640.7032:viXra\n=== 페이지 2 ===\nfrom the 5G-ACIA documentations [4]. B. Traffic model\nEach UE collects information about the AGV movements\n(e.g.,positions,axialandangularaccelerations,etc. )andsends\nthem to the application server with a fixed periodicity τ .",
      "size": 806,
      "sentences": 11
    },
    {
      "id": 10,
      "content": "ions [4]. B. Traffic model\nEach UE collects information about the AGV movements\n(e.g.,positions,axialandangularaccelerations,etc. )andsends\nthem to the application server with a fixed periodicity τ . UL\nUpon receiving each uplink transmission, the server lever-\n(a) Architecture 1. ages DL to assess whether or not there will be a future fall of\nthe dangerous liquids carried by the considered AGV. With a\nprobability p , the DL algorithm will predict a future liquid\nDL\nfall. In this case, the server sends a command to the UE to\nprevent the fall, otherwise, it will not generate any downlink\ntransmission. C. Channel Model\nThe channel model is based on the Gilbert-Elliot model\n(b) Architecture 2. [5]. It is a 2-state Markov model, where the states are\nusually referred to as good (G) and bad (B). g and b are the\nprobabilitiesofcorrectreceptionwhenbeinginstateGandB,\nrespectively, such that g ≫b.",
      "size": 900,
      "sentences": 11
    },
    {
      "id": 11,
      "content": "5]. It is a 2-state Markov model, where the states are\nusually referred to as good (G) and bad (B). g and b are the\nprobabilitiesofcorrectreceptionwhenbeinginstateGandB,\nrespectively, such that g ≫b. The transition probability from\nstate G to B is u, while the transition probability from state\nB to G is v. Therefore, the reception error rate p in steady\ne\nstate is:\np =(1−g)π +(1−b)π , (1)\ne G B\n(c) Architecture 3. where π = v and π = u are the probability of being\nG u+v B u+v\nin state G and B, respectively. D. Implementation of the 5G NR framework\nInthefrequencydomain,theavailablebandwidthB issplit\nin n Resource Blocks (RBs), where each RB is composed\nRB\nof 12 Orthogonal Frequency Division Multiplexing (OFDM)\nsubcarriers, such that:\n(cid:22) (cid:23)\n(d) Architecture 4. B\nn = , (2)\nFigure 1: Pictorial representation of the considered 5G NR RB 12∆f\nnetwork architectures. where ∆f is the Subcarrier Spacing (SCS). In the time domain, OFDM symbols are grouped into slots,\nII.",
      "size": 985,
      "sentences": 8
    },
    {
      "id": 12,
      "content": ", (2)\nFigure 1: Pictorial representation of the considered 5G NR RB 12∆f\nnetwork architectures. where ∆f is the Subcarrier Spacing (SCS). In the time domain, OFDM symbols are grouped into slots,\nII. END-TO-END5GNR-COMPLIANTNETWORK\nin particular, 14 OFDM symbols form one slot. However,\nSIMULATOR\nin 5G NR, it is also possible to have communications over\nA. Network Architecture\nfractions of slots, the so-called “mini-slots”. In this regard,\nFor the scenario described in Sec. I, we foresee four we used mini-slots composed of 7 OFDM symbols each. different 5G NR network architectures which are depicted in We consider the same uplink messages defined in [6], with\nFig. 1 and described hereafter. the inclusion of the downlink ones, as summarized in the\n1) Architecture 1: both the 5G Radio Access Network following:\n(RAN) and 5G Core Network (5CN) are deployed • PhysicalUplinkControlChannel(PUCCH),usedbyUEs\noutside the factory (see Fig.",
      "size": 940,
      "sentences": 11
    },
    {
      "id": 13,
      "content": "arized in the\n1) Architecture 1: both the 5G Radio Access Network following:\n(RAN) and 5G Core Network (5CN) are deployed • PhysicalUplinkControlChannel(PUCCH),usedbyUEs\noutside the factory (see Fig. 1a); toaskthegNBforbeingscheduled.Itoccupies1RBand\n2) Architecture 2: the application server and User Plane 7 OFDM symbols. Function(UPF)functionalitiesarehostedatthenetwork • Physical Downlink Control Channel (PDCCH), used by\noperator’s premises closer to the industrial plant (see the gNB to inform the UEs about the uplink/downlink\nFig. 1b), and 5G RAN is deployed outside the factory; scheduling outcome. It occupies 1 RB and 7 OFDM\n3) Architecture 3: the 5G RAN is deployed in the indus- symbols. trialplant,whereastheapplicationserverandUPFfunc- • Physical Uplink Shared Channel (PUSCH), used by UEs\ntionalities are hosted at the public network operator’s to transmit Physical (PHY) Protocol Data Units (PDUs). premises (see Fig.",
      "size": 935,
      "sentences": 7
    },
    {
      "id": 14,
      "content": "rverandUPFfunc- • Physical Uplink Shared Channel (PUSCH), used by UEs\ntionalities are hosted at the public network operator’s to transmit Physical (PHY) Protocol Data Units (PDUs). premises (see Fig. 1c); Itoccupies1ormoreRBand4OFDMsymbolsdepend-\n4) Architecture 4: the 5G RAN, the application server, ing on the network load, scheduling policy, etc. and the UPF functionalities are deployed inside the • Physical Downlink Shared Channel (PDSCH), used by\nfactory, whereas the other 5CN elements are external the gNB to transmit PHY PDUs to UEs. It occupies 1 or\n(see Fig. 1d). more RB and 4 OFDM symbols. In all cases, the 5G RAN is composed of a single gNodeB • Hybrid Automatic Repeat reQuest (HARQ)\n(gNB).Thesearchitectures,proposedbyTIM,drawinspiration Acknowledgment (ACK), used to inform the sender\n=== 페이지 3 ===\nabout the outcome of the uplink/downlink transmission. B. Data pre-processing\nIt occupies 1 RB and 2 OFDM symbols.",
      "size": 933,
      "sentences": 10
    },
    {
      "id": 15,
      "content": "dbyTIM,drawinspiration Acknowledgment (ACK), used to inform the sender\n=== 페이지 3 ===\nabout the outcome of the uplink/downlink transmission. B. Data pre-processing\nIt occupies 1 RB and 2 OFDM symbols. The real-time data collected by the AGV has been manipu-\nIt is worth mentioning that a PUSCH/PDSCH transmission is latedviadifferentpre-processingstepsthatarelistedhereafter:\nfollowed by the corresponding HARQ ACK and the overall • Class weighting [7] to cope with the skewed distribution\nprocess has a duration of one mini-slot. Indeed, we assume where the majority of the data points correspond to the\nhalf-duplex communications, and that one OFDM symbol is normal operating conditions and a minority of the data\nneeded to switch from transmission to reception and vice- points correspond to the failed state, as usual in RUL\nversa.",
      "size": 834,
      "sentences": 5
    },
    {
      "id": 16,
      "content": "that one OFDM symbol is normal operating conditions and a minority of the data\nneeded to switch from transmission to reception and vice- points correspond to the failed state, as usual in RUL\nversa. scenarios;\nE. Implementation of the 5G NR dynamic scheduling • Feature creation to obtain a more suitable representation\nThegNBmakesschedulingdecisions,i.e.,assignsRBsand of the physical phenomenon. Specifically, we created\nOFDM symbols to UEs, both in uplink and downlink, every the mean, maximum, minimum, and standard deviation\nT . Specifically, T is formed by 8 mini-slots, where over multiple fixed-length windows [8], as well as the\nSRP SRP\nhalf are dedicated to the control plane (i.e., PUCCH, PDCCH derivative of those time series as the difference between\nand HARQ ACKs) and the other half to the data plane (i.e., subsequent data points;\nPUSCH, and PDSCH). • Differencing to remove seasonality from the time series\nThecontrolplaneresourceassignmentisfixeda-priori,i.e., data [9].",
      "size": 988,
      "sentences": 5
    },
    {
      "id": 17,
      "content": "her half to the data plane (i.e., subsequent data points;\nPUSCH, and PDSCH). • Differencing to remove seasonality from the time series\nThecontrolplaneresourceassignmentisfixeda-priori,i.e., data [9]. This was done by subtracting from each data\neach UE knows when to transmit/receive PUCCHs/PDCCHs, point the mean acceleration value for its position and\nrespectively, according to a predetermined pattern that repeats orientation;\nover time and depends on the number of resources available, • Standardizationtoensurethatallfeaturesareonasimilar\nas well as network load. On the opposite, the data plane scale and improve the performance and convergence of\nresources are scheduled based on the current traffic needs, DL models during training.",
      "size": 740,
      "sentences": 4
    },
    {
      "id": 18,
      "content": "ar\nas well as network load. On the opposite, the data plane scale and improve the performance and convergence of\nresources are scheduled based on the current traffic needs, DL models during training. according to the 5G NR scheduling mechanisms denoted as\nC. DL-based pipeline\ndynamicscheduling.Inparticular,UEswillingtotransmitdata\nTo perform RUL estimations, the server implements a DL-\nin the uplink have to first send a PUCCH before receiving\nbased pipeline that is formed by a DL model and a threshold-\nthe indications via PDCCH on how to transmit the PUSCHs.",
      "size": 564,
      "sentences": 3
    },
    {
      "id": 19,
      "content": "server implements a DL-\nin the uplink have to first send a PUCCH before receiving\nbased pipeline that is formed by a DL model and a threshold-\nthe indications via PDCCH on how to transmit the PUSCHs. basedalgorithm.Indeed,theformeristrainedonthedatacol-\nAdditionally, in the downlink, the gNB exploits the PDCCHs\nlected during the hands-on measurement campaign to predict\ntotelltheUEswhen(andhow)theywillreceivedata.Tomake\ntheRUL,andthelattertransformstheDLoutputtoeitherzero\ntheschedulingdecisions,thegNBexploitsthetwoscheduling\nor one as the RUL task is tackled as a binary classification\npolicies defined in [6], by applying them independently to the\nproblem (see Sec. III-A). uplink and downlink traffic flows. The DL-based pipeline was trained, optimized, and tested\nIII. DL-BASEDRULESTIMATIONPIPELINE\nby exploiting the manipulated dataset described in Sec. III-B.",
      "size": 869,
      "sentences": 7
    },
    {
      "id": 20,
      "content": ". III-A). uplink and downlink traffic flows. The DL-based pipeline was trained, optimized, and tested\nIII. DL-BASEDRULESTIMATIONPIPELINE\nby exploiting the manipulated dataset described in Sec. III-B. In this section, we describe (i) how we created a dataset\nSpecifically, the dataset was further partitioned into 4-folds,\nfrom experiments in a real-world industry plant, and (ii) the\ni.e., 1) a training set to train the DL model, 2) a validation\nDL-basedpipelineforRULestimation.Itisworthmentioning\nset to monitor the DL model performance at training time,\nthat some details are omitted due to confidentiality reasons. 3) another validation set to define the optimal value of the\nA. Data collection threshold, and 4) a test set to evaluate the DL-based pipeline\nWe performed an experimental campaign where we col- performance. lectedreal-timedata(accelerations,positions,etc.",
      "size": 876,
      "sentences": 10
    },
    {
      "id": 21,
      "content": "the\nA. Data collection threshold, and 4) a test set to evaluate the DL-based pipeline\nWe performed an experimental campaign where we col- performance. lectedreal-timedata(accelerations,positions,etc. )oftheAGV In particular, the validation set of step 3) is used iteratively\nmoving within the industrial pilot line of BIREX1. Several in a procedure that aims to find the optimal threshold which\nsessionswereregistered,where,duringeachsession,theAGV minimizes the cost function C, whose expression for a DL\ncarriedabottleofwaterandwasforced,atsomepointintime, model X over a set of K time series S = {S ,S ,...,S }\n1 2 K\nto perform a sudden change in its path, thereby leading to the is as follows:\nfall of the bottle. A custom script registered the fall event’s\n(cid:88)\nK\n(cid:88)\nPk\n(cid:88)\nK\n(cid:88)\nQk\ntimestamptocorrectlylabeltheclosestsensor’sdataasaFault C = C FP + C FN (s q ,S k ,m), (3)\nevent and, consequently, all the others were labeled as Non- k=1p=1 k=1q=1\nFault.",
      "size": 980,
      "sentences": 6
    },
    {
      "id": 22,
      "content": "Pk\n(cid:88)\nK\n(cid:88)\nQk\ntimestamptocorrectlylabeltheclosestsensor’sdataasaFault C = C FP + C FN (s q ,S k ,m), (3)\nevent and, consequently, all the others were labeled as Non- k=1p=1 k=1q=1\nFault. The data collected within each session constitute time where P is the number of false positive samples for the k-\nk\nseries data, as they record the AGV movement over time with th time series, Q is the number of false negative samples for\nk\nregular intervals and timestamps, resulting in a sequence of thek-thtimeseries,C isthecostforafalsepositivesample,\nFP\nordered observations. In this context, we formulate the RUL C is the cost for a false negative sample.",
      "size": 659,
      "sentences": 3
    },
    {
      "id": 23,
      "content": "timestamps, resulting in a sequence of thek-thtimeseries,C isthecostforafalsepositivesample,\nFP\nordered observations. In this context, we formulate the RUL C is the cost for a false negative sample. The expressions\nFN\nprediction problem as a binary classification task, where the for C and C are the following:\nFP FN\nobjective is to predict whether a Fault event occurs within\nC =0.2\na certain margin m. This margin defines the classification FP\n(4)\ntask since it determines the number m of time series samples C FN (s q ,S k ,m)=m−|S k |+q,\nprior to a Fault event that can be labeled as Fault and should\nwhere m is the margin, S is a time series, and q is the\nk\ntriggertheservertosendacommandtotheAGVforavoiding\nindex of s in S . We set the cost of false positives C\nq k FP\npotential failures.",
      "size": 794,
      "sentences": 4
    },
    {
      "id": 24,
      "content": "nd should\nwhere m is the margin, S is a time series, and q is the\nk\ntriggertheservertosendacommandtotheAGVforavoiding\nindex of s in S . We set the cost of false positives C\nq k FP\npotential failures. constant, regardless of their occurrence in the time series or\nthe margin, while the cost of false negatives C increases\n1BIREX is an Italian Competence Center for Industry 4.0 (see https://bi- FN\nrex.it/) the closer the sample is to the anomalous event. This design\n=== 페이지 4 ===\nFigure 2: T as a function of N, B and ∆f. We set Figure 3: T as a function of N, B, ∆f, and M. We\n5G NR 5G NR\nM =256 and T =0 ms. set T =0 ms.\nCN CN\nParameter Description Value\nchoice is inherently bounded to safety-critical applications,\nB Overallsystembandwidth {5,20,100}MHz\nwhere false negative samples are considered the major risk ∆f Subcarrierspacing {30,60,120}kHz\nto deal with.",
      "size": 867,
      "sentences": 5
    },
    {
      "id": 25,
      "content": "inherently bounded to safety-critical applications,\nB Overallsystembandwidth {5,20,100}MHz\nwhere false negative samples are considered the major risk ∆f Subcarrierspacing {30,60,120}kHz\nto deal with. M Modulationorderof {64,256}\nPUSCHs/PDSCHstransmissions\nHowever, the most important metric to assess the quality of\npe Receptionerrorrateinsteadystate 1%\ntheDL-basedpipelineistheaverageadvancefunctiona¯(D X ), PUL Uplinkpayload 32B\nwhere D\nX\n={s\n1\n,s\n2\n,...,s\nK\n} isthe setof thefirst samplesin PDL Downlinkpayload 1B\nthetimeseriesdetectedcorrectlyasfaultybyagivenmodelX\npDL Downlinkgenerationprobability 10%\nTPgNB gNBprocessingtime 7OFDMsymbols\nfor a given margin m. It indicates the amount of time before TPUE UEprocessingtime 7OFDMsymbols\nthe actual fault occurs and it is defined as follows: TCN Delayintroducedbythe5CN {1,2,7}ms\na¯(D X )= (cid:80)K i= K 1 a(s i ) , (5) T τ S T H U R S L P 5G Sc U h p S e r p o i d l m t i u o n l u c k i l n o a p g l ti e s o p r t n i e a o r c d t i k i o i m c d h i i e t e c y a it d y er 8m 1 7 0 1 in 2 0 0 i- B m s sl s ots\nwhere a(s) is the advance function which indicates the NS Numberofsimulations 20\ni\namount of time before the actual fault occurs after sample Table I: Simulation parameters\ns.\ni\nIV.",
      "size": 1255,
      "sentences": 2
    },
    {
      "id": 26,
      "content": "i- B m s sl s ots\nwhere a(s) is the advance function which indicates the NS Numberofsimulations 20\ni\namount of time before the actual fault occurs after sample Table I: Simulation parameters\ns.\ni\nIV. ROUND-TRIPTIMEANALYSIS We then introduce the term T , as well as the average\n5G NR\nWe define the RTT for a single UE as the time from which RTT R¯, both averaged among the total number of 5G UEs,\nthe movements’ data are generated at the application layer to i.e., N, and the total number of simulations N . S\nthetimeitreceivesthecorrespondingcommand.Inparticular,\nits expression is given by: V. NUMERICALRESULTS\nR=T +2·(T +T +T )+T + A. Performance of the 5G NR network\nP S P gNB P UE CN RAN UL\n+T +T = Simulations parameters, if not otherwise specified, are re-\nRAN DL A\nported in Table I.",
      "size": 790,
      "sentences": 4
    },
    {
      "id": 27,
      "content": "V. NUMERICALRESULTS\nR=T +2·(T +T +T )+T + A. Performance of the 5G NR network\nP S P gNB P UE CN RAN UL\n+T +T = Simulations parameters, if not otherwise specified, are re-\nRAN DL A\nported in Table I. However, it is important to underline that:\n=T +T +T , (6)\nP S 5G NR A\nwhere: • Weassumethatp e =1%andM ={64,256}forPUSCH\nand PDSCH communications, but PUCCH, PDCCH and\n• T P S is the processing time of the DL-based pipeline\nHARQ ACK receptions are error-free as they are trans-\ndescribed in Sec. III;\nmitted with the most conservative modulation order, i.e.,\n• T P gNB isthetimeneededbythegNBtoprocessaPHY\np =0% due to M =4;\nPDU, i.e., to eliminate all headers along the 5G protocol e\nstack; • Wesetp DL =10%tohave,onaverage,multiplePDSCH\ntransmissions per UE within the simulation time T . • T P UE is the time needed by the UE to process a PHY S\nPDU; • Among the four mini-slots per T SRP dedicated to data\nplane resources (see Sec.",
      "size": 934,
      "sentences": 5
    },
    {
      "id": 28,
      "content": "SCH\ntransmissions per UE within the simulation time T . • T P UE is the time needed by the UE to process a PHY S\nPDU; • Among the four mini-slots per T SRP dedicated to data\nplane resources (see Sec. II-E), three of them are dedi-\n• T CN is the delay introduced by the 5CN;\ncated to PUSCHs, and only one to PDSCHs, due to the\n• T RAN UL is the time needed by the UE to successfully\nuplink-orientednatureoftheconsideredtrafficmodel(see\nperform an uplink transmission;\nSec. II-B);\n• T RAN DL is the time needed by the gNB to successfully\nperform a downlink transmission; • All results will show a confidence interval with a proba-\nbility of 90%. • T A isthetimeneededtoexecutetheactuationcommand;\n• T 5G NR is the overall delay contribution caused by Westarttheanalysisbyinvestigatingtheimpactofdifferent\n5G NR. network parameters on the term T of Eq.",
      "size": 849,
      "sentences": 6
    },
    {
      "id": 29,
      "content": "isthetimeneededtoexecutetheactuationcommand;\n• T 5G NR is the overall delay contribution caused by Westarttheanalysisbyinvestigatingtheimpactofdifferent\n5G NR. network parameters on the term T of Eq. (6), where we\n5G NR\n[표 데이터 감지됨]\n\n=== 페이지 5 ===\nm=5 m=10 m=15\nModelX C a¯(DX) C a¯(DX) C a¯(DX)\nBASELINE 80.80 0.24s 306.40 0.46s 448.20 1.07s\nLR 96.00 0.32s 221.20 0.44s 679.60 0.45s\nDDNN 43.40 0.27s 142.00 0.66s 311.20 0.95s\n1D-CNN 28.80 0.27s 114.40 0.80s 197.60 1.33s\nAE 2396.40 0.39s 2666.80 0.90s 2561.80 1.40s\nLSTM 95.40 0.20s 346.40 0.34s 569.80 0.81s\nBiLSTM 61.60 0.28s 272.40 0.48s 689.40 1.08s\nGRU 85.40 0.23s 290.80 0.68s 539.80 0.92s\nTable II: Cost and average advance function of seven DL models and a baseline threshold-based approach for three different\nmargins. set T = 0 ms to be independent of the four architectures based models, such as LSTM, BiLSTM and GRU, are not\nCN\ndefined in Sec. II-A. effectiveinthisparticularRULestimationtask.Thisisbecause\nIn particular, Fig.",
      "size": 988,
      "sentences": 6
    },
    {
      "id": 30,
      "content": "s to be independent of the four architectures based models, such as LSTM, BiLSTM and GRU, are not\nCN\ndefined in Sec. II-A. effectiveinthisparticularRULestimationtask.Thisisbecause\nIn particular, Fig. 2 shows T as a function of N, only a few input samples are relevant for predicting the liquid\n5G NR\nB, ∆f, and by setting M = 256. It can be observed that a fall, whereas recurrent models are designed to capture long-\nwider bandwidth provides better performance due to a higher term dependencies and patterns in time series data. Another\nnumber of RBs (see Eq. (2)), for both the control and data notable observation is that the reconstruction error, which\nplane. Quite interestingly, there is also a benefit when ∆f autoencoders seek to minimize, may not be an effective indi-\nincreases for a fixed value of B.",
      "size": 811,
      "sentences": 8
    },
    {
      "id": 31,
      "content": "tion is that the reconstruction error, which\nplane. Quite interestingly, there is also a benefit when ∆f autoencoders seek to minimize, may not be an effective indi-\nincreases for a fixed value of B. This is because the shorter cator for predicting the RUL because these models exhibited\nT duration translates into more transmission opportunities markedly inferior performance compared to the others. SRP\nperunitoftime.Asexpected,R¯ increaseswithN butexhibits\nC. Performance of the entire RUL chain\na stepwise behavior. The reason is that, for sufficiently high\nIn this section, we finally assess whether or not the average\nvaluesofN,itisnotpossibletoserveallUEswithinoneT\nSRP RTTprovidedbythefour5G NRIIoTarchitecturesdescribed\nbecause of a shortage of control plane resources; therefore,\nin Sec.",
      "size": 797,
      "sentences": 5
    },
    {
      "id": 32,
      "content": "hether or not the average\nvaluesofN,itisnotpossibletoserveallUEswithinoneT\nSRP RTTprovidedbythefour5G NRIIoTarchitecturesdescribed\nbecause of a shortage of control plane resources; therefore,\nin Sec. II-A is sufficiently lower than the average advance\nsome UEs have to transmit/receive their PUCCHs/PDCCHs\nprovided by 1D-CNN, i.e., the best performing DL model\nin the next scheduling periodicity with a consequent non-\naccordingtotheresultspresentedinSec.V-B.Tothisaim,we\nnegligible increase in the average RTT. exploitedthe5G NRnetworksimulatordescribedinSec.IIby\nToassesstheimpactofdifferentmodulationordersforadif-\nconsideringthesamesettingsdescribedinSec.V-A.However,\nferent set of bandwidths, Fig. 3 depicts T as a function\n5G NR differentlyfromSec.V-A,thisRTTanalysisalsoconsidersthe\nof N, B, ∆f, and by considering M = 64 and M = 256.\nfirst and third terms of Eq. (6), as well as the four network\nIt can be clearly noted that, regardless of the values of N,\narchitectures described in Sec.",
      "size": 996,
      "sentences": 5
    },
    {
      "id": 33,
      "content": ", ∆f, and by considering M = 64 and M = 256.\nfirst and third terms of Eq. (6), as well as the four network\nIt can be clearly noted that, regardless of the values of N,\narchitectures described in Sec. II-A. In particular:\nboth modulation orders provide the same performance when\nB = 20 MHz. This is no longer true in the case of N ≥ 30 • T P S ranges from 1.2 ms to 119.2 ms, depending on the\nnumber of UEs. This range derives from experimental\nand B = 5 MHz, where it is preferable to have a higher\nteststhatconsider1D-CNNprocessingwhenconsidering\nmodulation order, i.e., M = 256. This is because, otherwise,\nan i9-11900K processor with 128 GB of RAM and up to\nthere is a shortage of data plane resources, and some UEs are\n50 parallel flows2;\nforced to transmit/receive their PUSCHs/PDSCHs in the next\nscheduling periodicity. • T A =200 ms and is taken from a commercial product.3\n• Due to their structure, and by leveraging real-world data\nB.",
      "size": 943,
      "sentences": 8
    },
    {
      "id": 34,
      "content": "orced to transmit/receive their PUSCHs/PDSCHs in the next\nscheduling periodicity. • T A =200 ms and is taken from a commercial product.3\n• Due to their structure, and by leveraging real-world data\nB. Performance of the DL-based RUL estimation pipeline coming from the TIM infrastructure, we consider that\nInthissection,wepresenttheperformanceoftheDL-based Architecture 1 and 2 work with B = 5 MHz, ∆f = 30\nRUL estimation pipeline that has been constructed, trained, kHz, M = 256, and are characterized by T CN = 7 ms,\nand tested as described in Sec. III. and T CN = 2 ms, respectively. Conversely, Architecture\nSpecifically, Table II illustrates the cost C and average 3 and 4 operate with B = 100 MHz, ∆f = 120 kHz,\nadvance function a¯(D X ) (see Eqs. (3) and (5)) provided by M = 64, and are characterized by T CN = 2 ms, and\nseven different DL models, including Logistic Regression T CN =1 ms, respectively. (LR), Deep Dense Neural Networks (DDNN), Autoencoders As a result, Fig.",
      "size": 982,
      "sentences": 8
    },
    {
      "id": 35,
      "content": "4, and are characterized by T CN = 2 ms, and\nseven different DL models, including Logistic Regression T CN =1 ms, respectively. (LR), Deep Dense Neural Networks (DDNN), Autoencoders As a result, Fig. 4 shows the average RTT, R¯, as a\n(AE), 1D Convolutional Neural Network (1D-CNN), Long function of N, and the four network architectures described\nShortTermMemory(LSTM),Bi-directionalLongShortTerm in Sec. II-A. Average advance values a¯(D ) for m=5\n1D CNN\nMemory (BiLSTM), Gated Recurrent Unit (GRU) [10]–[12], and m = 10 are represented with dashed horizontal lines. and a baseline threshold-based approach which works over The different colors of each bar represent a diverse delay\nthe raw data. Three margins have been considered, that is, contribution,thatis,T ,T ,andT (seeEq. (6)),while\n5G NR P S A\nm = {5,10,15}. It can be clearly seen that a trade-off differentarchitecturesarerepresentedbydifferentbarpatterns.",
      "size": 919,
      "sentences": 9
    },
    {
      "id": 36,
      "content": "n considered, that is, contribution,thatis,T ,T ,andT (seeEq. (6)),while\n5G NR P S A\nm = {5,10,15}. It can be clearly seen that a trade-off differentarchitecturesarerepresentedbydifferentbarpatterns. exists for all the considered models, as low margins (i.e., Notably,whenN ≤10,allarchitecturesprovideanR¯ lower\nm = 5) correspond to low average advance and cost, while than the average advance margin with m = 5. As expected,\nhigh margins (i.e., m = 15) correspond to higher average Architecture 3 and 4 are the best-performing ones, as they\nadvance and cost. However, 1D-CNN is the best-performing model when\n2Additionaltestsweremadeusingi5-6200Uprocessorand16GBofRAM,\nbuttheyledtounsuitableperformance(i.e.,processingtimeabove1second\nconsidering both metrics because it better captures the local\nfor30AGVs). temporal patterns presentin the data.",
      "size": 847,
      "sentences": 7
    },
    {
      "id": 37,
      "content": "rocessorand16GBofRAM,\nbuttheyledtounsuitableperformance(i.e.,processingtimeabove1second\nconsidering both metrics because it better captures the local\nfor30AGVs). temporal patterns presentin the data. More complex memory- 3See:https://www.hitbotrobot.com/product/z-efg-12-robotic-gripper/\n[표 데이터 감지됨]\n\n=== 페이지 6 ===\nFigure 4: Average RTT R¯, as a function of N, and the four network architectures described in Sec. II-A, when considering\n1D-CNN as DL model, and two average advance values a¯(D ) for m=5 and m=10. 1D CNN\nare characterized by higher bandwidths, SCS, and smaller performing architecture, using the set up with m=10 is\ncore network delays; indeed, they still yield sufficiently lower required;\naverage RTTs for N = 15 and N = 20.",
      "size": 742,
      "sentences": 5
    },
    {
      "id": 38,
      "content": "gher bandwidths, SCS, and smaller performing architecture, using the set up with m=10 is\ncore network delays; indeed, they still yield sufficiently lower required;\naverage RTTs for N = 15 and N = 20. Nevertheless, when • The average RTT is mainly affected by application-\nN ≥ 25, it is necessary to change the RUL task by increas- specific parameters, i.e., T and T , rather than\nP S A\ning m up to 10, independently of the considered network 5G NR-related optimizations. architectures. However, as described in Sec. V-B, a higher Infutureworks,weaimtoaddressmorerealistic,andtherefore\nmargin leads to an increase in the cost C, i.e., the number of complex,scenariosbyconsideringmultiplegNBsanddifferent\nerroneousfallpredictions,whichcouldcompromisethesafety channelmodels.Ourfutureresearchwillalsotargetreliability\nconditions within the factory. Finally, it is worth highlighting assessment for safety critical RUL-based chains.",
      "size": 928,
      "sentences": 6
    },
    {
      "id": 39,
      "content": "hichcouldcompromisethesafety channelmodels.Ourfutureresearchwillalsotargetreliability\nconditions within the factory. Finally, it is worth highlighting assessment for safety critical RUL-based chains. thattheaverageRTTismainlyaffectedbyapplication-specific\nACKNOWLEDGEMENT\nparameters,i.e.,T andT ,andoptimizationsof5G NRare\nP S A\nThis work was partially supported by the European Union\nnotreallyneededfortheconsideredIIoTscenarioandsettings. under the Italian National Recovery and Resilience Plan\nVI. CONCLUSIONS\n(NRRP)ofNextGenerationEU,partnershipon“Telecommuni-\nIn this paper, we performed an E2E analysis of a RUL cations of the Future” (PE00000001 - program “RESTART”). estimationproblem,whereallitsthreemainelements,namely\napplication,communicationsystem,andRULlogic,havebeen\nREFERENCES\nstudied.",
      "size": 801,
      "sentences": 6
    },
    {
      "id": 40,
      "content": "alysis of a RUL cations of the Future” (PE00000001 - program “RESTART”). estimationproblem,whereallitsthreemainelements,namely\napplication,communicationsystem,andRULlogic,havebeen\nREFERENCES\nstudied. In particular, we considered a safety-critical IIoT [1] C. Ferreira and G. Gonc¸alves, “Remaining useful life prediction and\nchallenges:Aliteraturereviewontheuseofmachinelearningmethods,”\napplication where 5G NR is used to collect movements data\nJournalofManufacturingSystems,vol.63,pp.550–562,2022. from AGVs carrying dangerous liquids, while DL algorithms [2] 3GPP,TR22.804-StudyonCommunicationforAutomationinVertical\nare trained to foresee the potential liquid falls. domains(CAV),72020. Rel16.3.0. [3] 3GPP,TR23.501-Systemarchitectureforthe5GSystem(5GS),42023. The problem is analyzed by considering 4 different 5G NR\nRel18.1.0. architectures, 7 DL-based and 1 threshold-based algorithm, as [4] 5GACIA,5GNon-PublicNetworksforIndustrialScenarios,92021. a function of different system parameters.",
      "size": 998,
      "sentences": 10
    },
    {
      "id": 41,
      "content": "ring 4 different 5G NR\nRel18.1.0. architectures, 7 DL-based and 1 threshold-based algorithm, as [4] 5GACIA,5GNon-PublicNetworksforIndustrialScenarios,92021. a function of different system parameters. The main findings [5] G. Hasslinger and O. Hohlfeld, “The Gilbert-Elliott Model for Packet\nLossinRealTimeServicesontheInternet,”in14thGI/ITGConference\nof this analysis are reported hereafter:\n- Measurement, Modelling and Evalutation of Computer and Commu-\n• Wider bandwidths and/or subcarrier spacings lead to nicationSystems,pp.1–15,Mar.2008. lower RTTs, whereas employing higher modulation or- [6] G. Cuozzo, S. Cavallero, et al., “Enabling URLLC in 5G NR IIoT\nNetworks: A Full-Stack End-to-End Analysis,” in 2022 Joint Euro-\nders is beneficial only when the data plane resources\npean Conference on Networks and Communications & 6G Summit\nsaturate; (EuCNC/6GSummit),pp.333–338,2022. ISSN:2575-4912.",
      "size": 900,
      "sentences": 6
    },
    {
      "id": 42,
      "content": "ysis,” in 2022 Joint Euro-\nders is beneficial only when the data plane resources\npean Conference on Networks and Communications & 6G Summit\nsaturate; (EuCNC/6GSummit),pp.333–338,2022. ISSN:2575-4912. • 1D-CNN is the best-performing DL model for RUL [7] G. Haixiang, L. Yijing, et al., “Learning from class-imbalanced data:\nReviewofmethodsandapplications,”ExpertSystemswithApplications,\nestimation as it shows the best trade-off between cost\nvol.73,pp.220–239,2017. and average advance for all the considered margins; [8] J. Brownlee, Introduction to Time Series Forecasting With Python. • The use of dedicated RAN and 5CN resources, as in MachineLearningMastery,2018. [9] R.ManucaandR.Savit,“Stationarityandnonstationarityintimeseries\nArchitecture3and4,togetherwiththeirnetworksettings\nanalysis,” Physica D: Nonlinear Phenomena, vol. 99, no. 2, pp.",
      "size": 848,
      "sentences": 8
    },
    {
      "id": 43,
      "content": "rningMastery,2018. [9] R.ManucaandR.Savit,“Stationarityandnonstationarityintimeseries\nArchitecture3and4,togetherwiththeirnetworksettings\nanalysis,” Physica D: Nonlinear Phenomena, vol. 99, no. 2, pp. 134–\nresult in a reduction of the average RTT w.r.t other 161,1996.\nsolutions, like Architecture 2 and 1; [10] H. I. Fawaz, G. Forestier, et al., “Deep learning for time series clas-\nsification: a review,” Data Mining and Knowledge Discovery, vol. 33,\n• The training of 1D-CNN for RUL estimation needs a pp.917–963,mar2019. margin m ≥ 10 to provide an average advance time [11] A.Borghesi,A.Bartolini,etal.,“Anomalydetectionusingautoencoders\ncompatible with the average RTT performance provided in high performance computing systems,” Proceedings of the AAAI\nConferenceonArtificialIntelligence,vol.33,pp.9428–9433,jul2019.",
      "size": 822,
      "sentences": 7
    },
    {
      "id": 44,
      "content": "nusingautoencoders\ncompatible with the average RTT performance provided in high performance computing systems,” Proceedings of the AAAI\nConferenceonArtificialIntelligence,vol.33,pp.9428–9433,jul2019. by all the considered network architectures;\n[12] Y.Wu,M.Yuan,etal.,“Remainingusefullifeestimationofengineered\n• Thetrainingof1D-CNNforRULestimationcanleverage systemsusingvanillalstmneuralnetworks,”Neurocomputing,vol.275,\na margin m = 5, which features lower costs, for certain pp.167–179,2018. architectures and number of AGVs N. However, if the\nRTT increases, due to an increase of N or to a less",
      "size": 599,
      "sentences": 3
    }
  ]
}