{
  "source": "ArXiv",
  "filename": "013_A_History-Guided_Regional_Partitioning_Evolutionar.pdf",
  "total_chars": 62645,
  "total_chunks": 89,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nA History-Guided Regional Partitioning\nEvolutionary Optimization for Solving the\nFlexible Job Shop Problem with Limited Multi-\nload Automated Guided Vehicles\nFeigeLiu,ChaoLu,XinLi\nAbstract—Inaflexiblejobshopenvironment,usingAutomated initially used for express logistics and the transportation of\nGuidedVehicles(AGVs)totransportjobsandprocessmaterialsis warehouse goods[2]. Due to the flexibility and efficiency of\nan important way to promote the intelligence of the workshop. AGV, it has gradually become the basic equipment for\nCompared with single-load AGVs, multi-load AGVs can improve\nworkshop logistics in recent years[3]. Especially with the\nAGV utilization, reduce path conflicts, etc.",
      "size": 708,
      "sentences": 4
    },
    {
      "id": 2,
      "content": "ally become the basic equipment for\nCompared with single-load AGVs, multi-load AGVs can improve\nworkshop logistics in recent years[3]. Especially with the\nAGV utilization, reduce path conflicts, etc. Therefore, this study\nincreasing competition in the manufacturing industry, in order\nproposes a history-guided regional partitioning algorithm\nto meet the diverse needs of customers, the production model\n(HRPEO) for the flexible job shop scheduling problem with\nhasgradually shifted toaflexible jobshopscheduling problem\nlimited multi-load AGVs (FJSPMA). First, the encoding and\n(FJSP) with multiple varieties and small batches[4]. This\ndecoding rules are designed according to the characteristics of\nmulti-load AGVs, and then the initialization rule based on the production model is widely used in solid-state capacitor\nbranch and bound method is used to generate the initial production[5], automobile production (chassis, engine and\npopulation.",
      "size": 946,
      "sentences": 5
    },
    {
      "id": 3,
      "content": "ule based on the production model is widely used in solid-state capacitor\nbranch and bound method is used to generate the initial production[5], automobile production (chassis, engine and\npopulation. Second, to prevent the algorithm from falling into a other parts production and assembly)[6], etc. Using AGVs for\nlocal optimum, the algorithm adopts a regional partitioning transportation can not only perform transportation tasks\nstrategy. This strategy divides the solution space into multiple flexibly,butalsoachieveuninterruptedproductionandimprove\nregions and measures the potential of the regions. After that,\nproductionefficiency. cluster the regions into multiple clusters in each iteration, and\nThe FJSP with transportation resource constraints is an NP-\nselects individuals for evolutionary search based on the set of\nhard problem[7]. Different from the problem of directly\nclusters.",
      "size": 893,
      "sentences": 7
    },
    {
      "id": 4,
      "content": "tion, and\nThe FJSP with transportation resource constraints is an NP-\nselects individuals for evolutionary search based on the set of\nhard problem[7]. Different from the problem of directly\nclusters. Third, alocal search strategyisdesigned to improve the\nproviding jobs transportation schedule, the problem of\nexploitation ability of the algorithm, which uses a greedy\napproach to optimize machines selection and transportation considering AGVs to transport jobs is more complicated\nsequence according to the characteristics of FJSPMA. Finally, a because AGVs are resources that need to be allocated and\nlarge number of experiments are carried out on the benchmarks arranged in scheduling. The transportation path planning\ntotesttheperformanceofthealgorithm.Comparedwithmultiple problem of AGVs is embedded in FJSP, that is, the\nadvanced algorithms, the results show that the HRPEO has a\ntransportation tasks on AGVs and the processing tasks on\nbetteradvantageinsolvingFJSPMA.",
      "size": 976,
      "sentences": 5
    },
    {
      "id": 5,
      "content": "e problem of AGVs is embedded in FJSP, that is, the\nadvanced algorithms, the results show that the HRPEO has a\ntransportation tasks on AGVs and the processing tasks on\nbetteradvantageinsolvingFJSPMA. processingmachinesarecoupled.Therefore,whenstudyingthe\nFJSPwiththetransportationresource,itismoreinlinewiththe\nIndexTerms—FlexibleJobShop Problem, AutomatedGuided\nactual production environment to consider AGVs as a\nVehicles, Niching Strategy, Evolutionary Algorithm, Space\nresource[8]. In manufacturing systems, AGVs as a resource\nPartitioning. that needs to be allocated and scheduled, are often limited. To\nimprove the utilization rate of AGVs, it is possible to consider\nI.INTRODUCTION further upgrading the AGV from being able to load only one\njob to being able to load multiple jobs. We call this type of\nWith the development of production automation, traditional\nAGV a multi-load AGV.",
      "size": 890,
      "sentences": 6
    },
    {
      "id": 6,
      "content": "rther upgrading the AGV from being able to load only one\njob to being able to load multiple jobs. We call this type of\nWith the development of production automation, traditional\nAGV a multi-load AGV. At present, the application field of\nmanufacturing has gradually transformed and upgraded to\nmulti-load AGVs is mainly in automatic storage and retrieval\nintelligent manufacturing[1]. Among them, the automated\nsystems (AS/RS)[9]. Compared with single-load AGVs, multi-\nlogistics and transportation of the workshop has largely\nload AGV systems can simultaneously meet the goals of\npromoted the optimization and upgrading of the production\nreducing the number of occupied AGVs and minimizing\nsystem.",
      "size": 697,
      "sentences": 5
    },
    {
      "id": 7,
      "content": "of the workshop has largely\nload AGV systems can simultaneously meet the goals of\npromoted the optimization and upgrading of the production\nreducing the number of occupied AGVs and minimizing\nsystem. Thanks to the development of technologies such as\nconflicts[10].Basedontheadvantagesofmulti-loadAGVsand\nartificial intelligence, automatic guided vehicles (AGVs) were\ntheir application in warehousing systems, we find that multi-\nload AGVs also have great potential in optimizing intelligent\nproductionsystems. Therefore, this paperstudiesa flexible job\nThisworkwassupportedbyNationalNaturalScienceFoundationofChina\nunderGrantNos.52175490and51805495.(Correspondingauthor:ChaoLu). shop schedulingproblem consideringlimited multi-loadAGVs\nFeige Liu and Chao Lu are with School of Computer Science, China (FJSPMA). University of Geosciences, Wuhan, China. (E-mail: liufeige3@163.com; To solve FJSPMA, this study proposed a history-guided\nluchao@cug.edu.cn). region partitioning algorithm (HRPEO).",
      "size": 993,
      "sentences": 7
    },
    {
      "id": 8,
      "content": ", China (FJSPMA). University of Geosciences, Wuhan, China. (E-mail: liufeige3@163.com; To solve FJSPMA, this study proposed a history-guided\nluchao@cug.edu.cn). region partitioning algorithm (HRPEO). The goal is to\nXin Li is with Department of Mathematics and Information Technology,\nThe Education University of Hong Kong, HongKong, China. (E-mail: minimize the maximum completion time. The main\nstephenli@eduhk.hk)\n=== 페이지 2 ===\ncontributions are as follows: (1) An optimization model of scheduling problem with limited AGVs under abnormal\nFJSPMA is established, and encoding and decoding rules are disturbances. designed. (2) An initialization strategy based on branch and The above studies all consider the use of single-load AGVs\nbound and heuristic rules is designed. (3) An evolutionary for the transportation of jobs or processing materials in FJSP.",
      "size": 856,
      "sentences": 10
    },
    {
      "id": 9,
      "content": "sed on branch and The above studies all consider the use of single-load AGVs\nbound and heuristic rules is designed. (3) An evolutionary for the transportation of jobs or processing materials in FJSP. framework for search region partitioning is adopted to guide However, the scheduling problem of multi-load AGVs is\nthe subsequent search process based on the information of the mainly about path planning, task scheduling, etc. Hu et al. [19]\nhistorical solutions. (4) A local search strategy is designed studied the multi-load AGV scheduling problem in network\nbasedonthecharacteristicsofmulti-loadAGVscheduling. logistics systems and considered the situation of transportation\nTherestofthispaperisorganizedasfollows:SectionIIisan path conflicts. They developed an appointment schedule that\noverview of literature review. Section III introduces the can be used to prevent AGV collisions and deadlocks. Lin et\nproblem. Section IV provides a detailed description of the al.",
      "size": 971,
      "sentences": 11
    },
    {
      "id": 10,
      "content": "ment schedule that\noverview of literature review. Section III introduces the can be used to prevent AGV collisions and deadlocks. Lin et\nproblem. Section IV provides a detailed description of the al. [10] proposed a task scheduling optimization method for\nHRPEO. Section V tests the influence of parameters and the multi-load AGVs-based systems, and they considered\neffectiveness of various strategies in the HRPEO. Section VI incremental task sizes, changeable maximum load of AGVs\nsummarizes the conclusions of this article and discusses future andthe number ofavailable AGVs. Dang etal. [20]studiedthe\ndevelopmentdirections. scheduling of heterogeneous multi-load AGVs with battery\nconstraints. They proposed a large neighborhood search\nII.LITERATUREREVIEW method to generate AGV scheduling solutions with low\nlateness cost and low AGV transportation cost. Yan et al.",
      "size": 870,
      "sentences": 12
    },
    {
      "id": 11,
      "content": "with battery\nconstraints. They proposed a large neighborhood search\nII.LITERATUREREVIEW method to generate AGV scheduling solutions with low\nlateness cost and low AGV transportation cost. Yan et al. [21]\nA.FJSPMA\nused an advanced form of Petri Nets to develop a model of a\nAt present, the AGVs in FJSP can be roughly divided into\nmulti-loadAGVsystem.Thispaperfoundthattheefficiencyof\nunlimited AGVs and limited AGVs according to the number\nthe AGV system can be improved by increasing the load\ntransportationresources.Thatis,theformerconsidersthatthere\ncapacity of AGV, but the effectiveness of such an approach\nare countless AGVs available for transportation tasks in the\nwill decrease when the load capacity increases above a certain\nproduction environment. Sufficient transportation resources\nvalue. The above studies show that multi-load AGVs with\nwill not lead to the situation that the operation waits for AGV\nappropriate load limits can improve the transportation\nafter it is completed.",
      "size": 993,
      "sentences": 6
    },
    {
      "id": 12,
      "content": "s\nvalue. The above studies show that multi-load AGVs with\nwill not lead to the situation that the operation waits for AGV\nappropriate load limits can improve the transportation\nafter it is completed. The makepsan of this type of problem is efficiency of AGVs, and numerical verification has been\noften not affected by the selection of AGVs and the sequence\ncarried out on logistics scheduling examples. However, in the\nof transportation tasks on AGV. Jiang et al. [11] studied an\nfieldofproductionscheduling,therearefewcaseswheremulti-\nenergy-conscious flexible job shop scheduling problem\nload AGV scheduling is embedded in FJSP, so it is necessary\nconsidering transportation time and deterioration effect. They\ntostudyFJSPMA. only considered the transportation time, without considering\nthe allocation oftransportation resources and the scheduling of\ntransportationtasks.However,intheactualproductionprocess, B.HRPEO\nthe available AGVs are often limited.",
      "size": 956,
      "sentences": 8
    },
    {
      "id": 13,
      "content": "ation time, without considering\nthe allocation oftransportation resources and the scheduling of\ntransportationtasks.However,intheactualproductionprocess, B.HRPEO\nthe available AGVs are often limited. Andy[12] proposed two For general evolutionary algorithms, since the algorithm\ndifferentconstraintprogrammingformulationsforthefirsttime always prefers to converge in a region that is easy to search, it\nfor a FJSP with limited transport robot. Arash et al. [13] is difficult to find the global optimum by regenerating the\ndeveloped a Mixed Integer Linear Programming (MILP) and a initialsolutionsandrepeatingtheevolutionwhenconvergingto\nparallelheuristic (PTSDBH)for FJSPconsidering conflict-free the local optimum. Therefore, in order to change the\nAGV routing. PTSDBH first forms multiple incomplete convergence preference of the algorithm, some algorithms will\nsolutionsandthenrefineseachsolutionbasedonthebestvalue. record the current optimal solution, and after reinitialization,\nLi et al.",
      "size": 994,
      "sentences": 7
    },
    {
      "id": 14,
      "content": "mplete convergence preference of the algorithm, some algorithms will\nsolutionsandthenrefineseachsolutionbasedonthebestvalue. record the current optimal solution, and after reinitialization,\nLi et al. [14] proposed an efficient optimization algorithm to the evolution process tends to move away from the local\nsolve the flexible job shop scheduling problem with crane optimal solution that has been found. This approach implicitly\ntransportation processes (CFJSP). The crane can be used as a dividesthewholeintotwodifferentsearchregions.Itissimilar\nsingle-load AGV with a fixed transport route. In addition to to the niching technique. The current representative niching\noptimizing makespan, Yao et al. [15] considered the energy- methods include preselection[22], cropping[23] and\nsaving and designed a DQN-based memetic algorithm to solve sharing[24]. These methods all search by implicitly or\nthis problem. Dalila et al.",
      "size": 922,
      "sentences": 10
    },
    {
      "id": 15,
      "content": "nergy- methods include preselection[22], cropping[23] and\nsaving and designed a DQN-based memetic algorithm to solve sharing[24]. These methods all search by implicitly or\nthis problem. Dalila et al. [16] also studied an energy-efficient explicitlydividingthepopulationintomultiplesub-populations. job shop scheduling problem with transport resources Wang et al. [25] developed a penalty-based differential\nconsidering speed adjustable resources. They developed a bi- evolution algorithm and constructed a dynamic penalty radius. objective mixed-integer linear programming model for the During selection, the region within the penalty radius of the\nproblem. Further, Li et al. [17] developed a hybrid deep Q- recorded elite solution will be penalized. Wang et al. [26]\nnetwork for dynamic multi-objective flexible job shop proposed an automatic niching technique based on the affinity\nscheduling problem with insufficient transportation resources. propagation clustering.",
      "size": 971,
      "sentences": 13
    },
    {
      "id": 16,
      "content": "work for dynamic multi-objective flexible job shop proposed an automatic niching technique based on the affinity\nscheduling problem with insufficient transportation resources. propagation clustering. This strategy can automatically divide\nThe DQN maked agent learn to select the appropriate rule at the clusters. Xia et al. [27] proposed an evolutionary algorithm\neach decision point. Gao et al. [18] propose a cloud-edge basedonreinforcementlearning,andusedQ-learningtosearch\ncombined digital twin (DT) flexible job shop scheduling (CE- the position and clustering subspace. Liu et al. [28] proposed a\nDTFJSS) framework to address the flexible job shop two-layer clustering morphological differential evolution\n=== 페이지 3 ===\n(DLCSDE) algorithm.",
      "size": 745,
      "sentences": 9
    },
    {
      "id": 17,
      "content": "tion and clustering subspace. Liu et al. [28] proposed a\nDTFJSS) framework to address the flexible job shop two-layer clustering morphological differential evolution\n=== 페이지 3 ===\n(DLCSDE) algorithm. The first layer of clustering divides the 3)SelectaAGVmachineforeachoperation\npopulation into multiple sub-populations for positioning, and 4)Determinethesequenceofloadingandunloadingtasksof\nthe second layer searches for local and global optimality alljobsoneachAGV. missed by the first layer during clustering. Wang et al.",
      "size": 523,
      "sentences": 6
    },
    {
      "id": 18,
      "content": "ositioning, and 4)Determinethesequenceofloadingandunloadingtasksof\nthe second layer searches for local and global optimality alljobsoneachAGV. missed by the first layer during clustering. Wang et al. [29] Each operation of the job has two transportation processes\ntested several advanced niche-based evolutionary algorithms before starting processing, namely, the AGV goes to the\nand found that although these algorithms avoid repeating current location of the job to load the job, the AGV transports\nsimilar evolutionary processes, they cannot avoid the thejobtothemachinewhere thenextoperationislocatedorto\nindividuals in the region that has already converged solution PW,asshowninFig2.Fig2illustratesapartialtransportroute\nneed to being ignored. Therefore, they proposed a history- of an AGV with the capacity of 2, where the green squares\nguided hill search to avoid searching for previously obtained correspond to loading tasks, the purple squares correspond to\nsolutions.",
      "size": 977,
      "sentences": 5
    },
    {
      "id": 19,
      "content": "story- of an AGV with the capacity of 2, where the green squares\nguided hill search to avoid searching for previously obtained correspond to loading tasks, the purple squares correspond to\nsolutions. unloading tasks, and the circular nodes correspond to\nThis search strategy is widely used in solving multimodal processingtasksofoperations.Fora single-loadAGV, loading\nproblems. Although the goal of solving FJSPMA with and unloading tasks are performed alternately, while for a\nevolutionaryalgorithmsistofindtheglobaloptimalscheduling multi-load AGV, loading or unloading tasks can be performed\nsolution,itisnotnecessarytofindalltheoptimalsolutions,but continuously. this strategy based on niching technology helps prevent the\nalgorithm from falling into the local optimum. Therefore, it is\nB. MathematicalModelofFJSPMA\nworth studying the use of niching technology to optimize the\nevolutionaryalgorithmforsolvingFJSPMA. Yao et al.",
      "size": 931,
      "sentences": 6
    },
    {
      "id": 20,
      "content": "rithm from falling into the local optimum. Therefore, it is\nB. MathematicalModelofFJSPMA\nworth studying the use of niching technology to optimize the\nevolutionaryalgorithmforsolvingFJSPMA. Yao et al. [30] proposed a novel mixed integer linear\nprogramming (MILP) model for the flexible job-shop\nIII.PROBLEMDESCRIPTION scheduling problem with limited single-load AGVs. This study\nconsiders multi-load AGVs, so for an operation, the loading\nA. Problemstatement andunloadingtasksontheAGVarenotnecessarilycontinuous. Fig 1 shows a workshop layout with multi-load AGVs. In This section mainly introduces the constraints on multi-load\nsimple terms, FJSPMA is a combination of FJSP and Vehicle AGVs:\nRouting Problem (VRP). In more detail, the FJSPMA can be\ndescribedas jobsneedtobeprocessedon machines, and\neachjob ( istheindexofthejobs)contains operations.",
      "size": 849,
      "sentences": 8
    },
    {
      "id": 21,
      "content": "s a combination of FJSP and Vehicle AGVs:\nRouting Problem (VRP). In more detail, the FJSPMA can be\ndescribedas jobsneedtobeprocessedon machines, and\neachjob ( istheindexofthejobs)contains operations. Eachoperation ( istheindexoftheoperationsofjob )\n\ncanbeprocessedonatleastonemachine.Inaddition,thereisa\n\nraw material warehouse (MW) for storing initial processing\nraw material, and a product warehouse (PW) for storing\ncompleted processing jobs. There are multi-load AGVs Fig.1.Workshoplayoutwithmulti-loadAGVs. used for transport jobs between processing machines and\n\nwarehouses. is the upper limit of the capacityofmulti-load\nAGVs,andthesizeofeachjobis1.Thegoal ofFJSPMAisto\nminimizethe  maximumcompletiontime.FJSPMAsatisfiesthe\nconstraints of FJSP and also needs to satisfy the following\nconstraints:\nFig.2.ApartialtransportrouteofanAGV. 1)AlljobsandAGVsarereadyattheMWfromtimezero. 2) The maximum load of each AGV during transportation\nIndices:\nshallnotexceedtheuppercapacityoftheAGV.",
      "size": 988,
      "sentences": 8
    },
    {
      "id": 22,
      "content": "g\nconstraints:\nFig.2.ApartialtransportrouteofanAGV. 1)AlljobsandAGVsarereadyattheMWfromtimezero. 2) The maximum load of each AGV during transportation\nIndices:\nshallnotexceedtheuppercapacityoftheAGV. : indices for operations, and include the last operation\n3) It is assumed that the loading and unloading time of the\n(the p'rocessing time is 0) of each jobwhich isthe operation in\nAGVistakenintoaccountintheprocessingtime. , \nPW. 1, 2, 3, , , where is the total number of\n4) The buffer of each machine is infinite, and if many jobs\noperation's. arrive in the buffer of a machine, the order of process on the\n,  = ⋯  \n:todistinguishthetypeoftransporttask, representsa\nmachineisnotconstrainedbytheorderinwhichthejobsarrive. loadingtask,and representsanunloadingtask. 5) When starting processing, jobs need to be transported\n=1\n:indexofAGVs, 1,2,\nfrom MW to the machine, and after completing processing,\n=0\n;indexofmachine, 0,2, 0meansMW. jobsneedtobetransportedtoPW. = ⋯,  .",
      "size": 972,
      "sentences": 11
    },
    {
      "id": 23,
      "content": "starting processing, jobs need to be transported\n=1\n:indexofAGVs, 1,2,\nfrom MW to the machine, and after completing processing,\n=0\n;indexofmachine, 0,2, 0meansMW. jobsneedtobetransportedtoPW. = ⋯,  . Parameters:\n6) The path conflicts caused by AGVs transporting jobs are\n= ⋯,,  ,  =\n:setofthefirstoperationofalljobs. notconsidered. In brief, the FJSPMA can be subdivided into four sub-  :  averylargepositivenumber. problems: :Theupperlimitofthecapacityofmulti-loadAGVs. 1) Determine the processing order of all operations for all :thestarttimeoftransporttaskforoperation ,thetype\n\njobs. oftaskis . 2)Selectprocessingmachinesforeachoperation. :thetransporttimefrommachine tomachine . 1  2  1  2\n=== 페이지 4 ===\nFig.3.ThegeneralprocessoftheHRPEO. :thestarttimeofprocessingtaskforoperation .\n' ' ≥     + 1−  ∙           +  ∙     ''       −  ∙ 8−\n:theprocessingtimeofoperation .",
      "size": 873,
      "sentences": 14
    },
    {
      "id": 24,
      "content": "machine . 1  2  1  2\n=== 페이지 4 ===\nFig.3.ThegeneralprocessoftheHRPEO. :thestarttimeofprocessingtaskforoperation .\n' ' ≥     + 1−  ∙           +  ∙     ''       −  ∙ 8−\n:theprocessingtimeofoperation . D  ec  isionvariables:      '  '  −   ''  ''    −     −   '   ' − ,   ''   '' −       −   −1     −  '' ∙\n: if AGV is selected to proce  ss the loading task of '' '' '' '' ''\n− 1−  ∙   −1    \noperation or the unloading task of operation , ; ' '' '' ' (4)\n∀    ,∀  ,  ,   0,1 ,∀  ,    ,∀    −\notherwise, ; '' '' '' '' ' '\n=1   ,∀     ,     ,     ,       ,   ≠   ≠  \n: if operation is processed on machine . : if\n=0    '  ' ≥     + 1−  ∙           +  ∙   0     −  ∙ 8 , −\noperation havetransporttasks.",
      "size": 698,
      "sentences": 6
    },
    {
      "id": 25,
      "content": "e, ; '' '' '' '' ' '\n=1   ,∀     ,     ,     ,       ,   ≠   ≠  \n: if operation is processed on machine . : if\n=0    '  ' ≥     + 1−  ∙           +  ∙   0     −  ∙ 8 , −\noperation havetransporttasks. : if operation  be processed after operatio  n   on     '  '  −   ''     −     −   '   ' −   ''   −       −   −1    \n' '' ' (5)\nmach'ine ; ' ∀    ,∀  ,   0,1 ,∀  ,    ,∀     ,\n'' ' '\n: if the transport task of operation is performed ∀     ,       ,   ≠   ≠  \n' ' ' ' (6)\npreced'e's the transport task of operation on AGV ,       +       =1,\n' ' ' '\n;otherwise, ' ; '\n∀    ,∀  ,   0,1 ,∀  ,    ,   ≠  \n'' '' (7)\nM''inimize : ' '       +       =1,\n=1       =0 (8) to (10) relate the'' transfer tas''k to''th''e processing task. (1)\nEspecially fo∀r   t  h,e∀  u,n  lo  ad0i,1ng,∀t  a,s  k,   th,  e  st≠art   time of the\n(2) Constrain that an operation with transport tasks must\n≥    +    ,∀    unloading task is affected by the completion time of the\nhavetwotransporttasks:loadingandunloading.",
      "size": 991,
      "sentences": 4
    },
    {
      "id": 26,
      "content": "e  st≠art   time of the\n(2) Constrain that an operation with transport tasks must\n≥    +    ,∀    unloading task is affected by the completion time of the\nhavetwotransporttasks:loadingandunloading. previousstageoperationofthejob. , (2)\nFor multi-load AGVs, continuous loading and unloading\n\u0000t     =2∗   ∀    ,∀   \ntasksareallowedwithoutexceedingthecapacitylimitofAGV. ≥    1+           −  ∙ 3−   −       − (8)\nThefollowingconstraintsareaboutsubproblems3and4. (9)\n(3)indicatesthatforanytransporttaskonamulti-loadAGV,   −1     ,∀    −   ,∀     ,      \n(10)\nstarting from any tasks, in the sequential transport    ≥    −1+    −1−  ∙   ,∀    −  \n(11) to (13) are common constraints of the FJSP problem,\ntasks,thenumbero  f  l  o  adingandunloadingtasks 2 i ∗ s  . regardi  n  g  s 1 u + bp  ro ∙ bl 1 em − s  1  an ≥ d  2  .",
      "size": 820,
      "sentences": 6
    },
    {
      "id": 27,
      "content": "−1−  ∙   ,∀    −  \n(11) to (13) are common constraints of the FJSP problem,\ntasks,thenumbero  f  l  o  adingandunloadingtasks 2 i ∗ s  . regardi  n  g  s 1 u + bp  ro ∙ bl 1 em − s  1  an ≥ d  2  . −1+    −1,∀    −  \n(11)\n,\n1  1  2  2  +   2  2  3  3  +⋯+   2  −1  2  −1  2   2   −2  ∙  + (12)\n\u0000     =1,∀   \n1   1+   2   2+⋯+   2    2  ≤2  (3)    '  +   '   ≤1,∀  ,  '   ,∀    ,  ≠  '\n∀    ,∀  1   2   0,1 ,\n(4) to (7 ∀ )  1 c   o 2 n  s  tr  ai , n  1  t 1 he ≠  A 2  G 2 V ≠⋯ to ≠ o  n 2 l  y  2  perform one    ' ≥    +    −  ∙ 3−    −   '  −    '  , (13)\ntransportationtaskatatime.Fortheloadingtaskofoperation ,\n' '\nthe machine corresponding to this task is the machine where IV.∀A  ,\nL\n\nG\n\nO\n\nR\n,\nIT\n∀\nH\n\nM\nD, \nES\n≠\nCR\n\nIPTION\nthe previous processing stage of the job is located, denoted as \nA.TheframeworkoftheHRPEO\n.",
      "size": 823,
      "sentences": 3
    },
    {
      "id": 28,
      "content": "machine corresponding to this task is the machine where IV.∀A  ,\nL\n\nG\n\nO\n\nR\n,\nIT\n∀\nH\n\nM\nD, \nES\n≠\nCR\n\nIPTION\nthe previous processing stage of the job is located, denoted as \nA.TheframeworkoftheHRPEO\n. For the unloading task of operation , the machine\ncorresponding to this task is the processing machine arranged Before introducing the algorithm, we will introduce region,\nby   o  peration ,denotedas . cluster and subpopulationwhich will beusedlater. Region isa\n\n=== 페이지 5 ===\nmultidimensionalintervalspecifiedbytheproblemencoding.If\na solution is in the region, then the value of each dimension is\nwithin the interval of the corresponding dimension. Cluster\nrefers to the collection of regions, which is a larger\nmultidimensional interval. Subpopulation corresponds to each\ncluster one by one, and the solutions of subpopulation are all\nwithintherangeofthecorrespondingcluster. To minimize the completion time, this paper proposes an\nHRPEO.",
      "size": 941,
      "sentences": 7
    },
    {
      "id": 29,
      "content": "ubpopulation corresponds to each\ncluster one by one, and the solutions of subpopulation are all\nwithintherangeofthecorrespondingcluster. To minimize the completion time, this paper proposes an\nHRPEO. In HRPEO, a global k-d Tree is used to record the\nregions divided during the iteration process. And the historical\nFig.4.encodingoftheFJSPMA. solutions of each region also will be recorded. The core of\nHRPEO is to select appropriate individuals for optimization\nbased on the metrics of different regions, and balance the\nexploitation and exploration capabilities of the algorithm. The\ncontents of HRPEO are as follows: 1) The decoding method\ncombined with heuristic rules is used to calculate the fitness. And to generate an initial population with uniform distribution\nand better individuals, we borrowed the branch and bound\nFig.5.PartofthetransportpathontheAGV. method to generate the initial population.",
      "size": 907,
      "sentences": 9
    },
    {
      "id": 30,
      "content": "d to generate an initial population with uniform distribution\nand better individuals, we borrowed the branch and bound\nFig.5.PartofthetransportpathontheAGV. method to generate the initial population. 2) To determine the\nfuturesearchtrends,aregionaldivisionstrategyisdesigned.In Algorithm1.HRPEO\neach iteration, update the set of clusters, identify the seed\n1. Input: size of initial population , number of\nsolutions,andthen dividethe regions.After that,cluster allthe\nexploratory solutions , to determine the range\nregions to form a new set of clusters. 3) Carry out exploitation  ∙  1\noftheinterval;\nand exploration. Exploitation is to generate subpopulations  2 \n2. Output:thebestsolution\ncorresponding to clusters and perform evolution operations on\n3. //Initialization\nindividuals in a same subpopulation. Exploration is to select     \n4.",
      "size": 842,
      "sentences": 9
    },
    {
      "id": 31,
      "content": "te subpopulations  2 \n2. Output:thebestsolution\ncorresponding to clusters and perform evolution operations on\n3. //Initialization\nindividuals in a same subpopulation. Exploration is to select     \n4. Initializethepopulation( );\ntwo different clusters based on roulette and evolve the\n5. a collection of clusters , subpopulations\nindividualsintheirregions.4)Tomentionthesearchefficiency,  ←  ∙  1\n;\na local search strategy is designed. According to the metric of   ←∅\n6. Determine the value range of each bit of the solution\neachregion, that is, theaverage fitnessvalue ofall solutionsin  ve  ct←or,∅then obtain the range of the initial solution\npeopleand,selectappropriateindividualsforlocalsearch. space\nThe general process of the HRPEO is shown in Fig 3. Each\n7. acollectionofregions ;\npoint represents a searched solution. The darker the color, the  ;\n8. While do\nbetterthesolution.Theyellowandredareasrepresentdifferent   ←∅   ←   ∪ \n9.",
      "size": 940,
      "sentences": 11
    },
    {
      "id": 32,
      "content": "shown in Fig 3. Each\n7. acollectionofregions ;\npoint represents a searched solution. The darker the color, the  ;\n8. While do\nbetterthesolution.Theyellowandredareasrepresentdifferent   ←∅   ←   ∪ \n9. //Exploitation\nclusters.Eachclustergeneratesacorrespondingsub-population. <                \n10. Generatesubpopulation( );\nAfter a series of search operations, the new solutions are\n11. Each subpopulation performs crossover\nrepresented by a green point. Then the seed solutions are   ←   ,   ,  \nmutationandlocalsearch( );\ndetermined in each cluster, and the region is divided. The   ,   ←\n12. //Exploration\nsearch potential of the region can be evaluated by the average   ,  \n13. For do\nfitness of all solutions in the region. The grayer the region, the\n14. If then\nmore likely it is to find a local optimal solution. Then the\n=1    2\n15. Selecttwoclusters and ;\nneighboring regions are aggregated into a cluster based on the\n> \n16.",
      "size": 932,
      "sentences": 16
    },
    {
      "id": 33,
      "content": "ayer the region, the\n14. If then\nmore likely it is to find a local optimal solution. Then the\n=1    2\n15. Selecttwoclusters and ;\nneighboring regions are aggregated into a cluster based on the\n> \n16. =Generateasolution( , );\npotentialoftheregion.Formoredetails,seeAlgorithm1. 17. Update the solution set corresponding\n\ntotheregion( );\nB.EncodingandDecoding 18. E  ls , e   ←\n,   ,    \nAccording to the four sub-problems of the problem, this 19. =Generateasolutionrandomly;\npaper adopts a three-layer encoding with a transport tasks list. 20. End\nThe decoding method is combined with a certain loading and 21. End    \nunloading sequence to obtain a scheduling solution for 22. //Update and\nFJSPMA. 23. For do\n\n24. Identify seed solutions (the solution set of\n=1   |   |\n);\n←\n25. Update ;\n\n26. Divideregions( );\n\n27. End\n←   , \n28. GroupClusters( );\n29. End\n←  \n=== 페이지 6 ===\nbefore is used asthe start processing time of .",
      "size": 921,
      "sentences": 21
    },
    {
      "id": 34,
      "content": "seed solutions (the solution set of\n=1   |   |\n);\n←\n25. Update ;\n\n26. Divideregions( );\n\n27. End\n←   , \n28. GroupClusters( );\n29. End\n←  \n=== 페이지 6 ===\nbefore is used asthe start processing time of . Easy to\nAs shown in Fig 4, the first layer is the coding of all getthecompletiontimeof . operationprocessingsequences,andtheblueboxrepresentsthe      \nStep5: If the last operation in the operation list is traversed,\noperation processing task. It is worth noting that, for the   \nthemaximumcompletiontimeisoutput,otherwisegotoStep1. convenienceofdecoding,itisassumedthattheoperationinthe\nBasedontheabovedecodingstrategy,Fig6showstheGantt\nyellow box is performed in the PW, the processing time is set\nchart corresponding to the encoding in Fig 4, where boxes of\nto 0, and the processing machine is marked as -1. The second\nthesame colorrepresent processingtasksortransportationtask\nlayer is the coding of the machine, which corresponds to the\nof the same job.",
      "size": 957,
      "sentences": 11
    },
    {
      "id": 35,
      "content": "f\nto 0, and the processing machine is marked as -1. The second\nthesame colorrepresent processingtasksortransportationtask\nlayer is the coding of the machine, which corresponds to the\nof the same job. Boxes with two colors on the AGV represent\noperation coding and indicates the processing machine where\ntwojobsontheAGVduringthecurrenttransportationprocess. the operation is located. The third layer is the coding of the\nAGVs,whichissimilartothemachinecodingandindicatesthe\nindexoftheAGVselectedfortheoperation.Thetransporttask\nlistrecordstheorderoftransporttasksoneachAGV.Whenthe\ntasknumberis ,it isaloadingtask,and whenit is ,itisan\nunloadingtask. When decod+ing, a container with a capacity equ−al to the\nAGVs capacity is required. According to the correspondence\nbetween AGV and operation in the code, the transportation\ntasks on each AGV are listed in the processing order of the\noperations. Each operation has two transportation tasks, the Fig.6.TheGanttchartforasolution.",
      "size": 977,
      "sentences": 8
    },
    {
      "id": 36,
      "content": "and operation in the code, the transportation\ntasks on each AGV are listed in the processing order of the\noperations. Each operation has two transportation tasks, the Fig.6.TheGanttchartforasolution. loading task is , and the unloading task is . In\nparticular, if two + co  n  s  ecutive operations of a job are p − ro  c   essed C. Theseedsolutions\non the same machine, the transport tasks of the latter are not\nThe purpose of dividing the solution space into multiple\ntaken into account. If it is a loading task, a job block is stored\nregionsistocontinuouslysearchforunsearchedregionsduring\nin the container, and if it is an unloading task, the\nthe search process. At the same time, local searches can be\ncorresponding job block is removed from the container. performed in the searched regions for in-depth search.",
      "size": 816,
      "sentences": 7
    },
    {
      "id": 37,
      "content": "it is an unloading task, the\nthe search process. At the same time, local searches can be\ncorresponding job block is removed from the container. performed in the searched regions for in-depth search. Initially, if the container is not full, the loading task is\nCompared with the classic evolutionary algorithm, this search\nprocessed, and if the container is full, all the jobs in the\nstrategy divides similar solutions into a region and explores\ncontainer are unloaded one by one. Fig 5 gives an example of\nunknown regions at the same time, which can effectively\nanAGVwithacapacityof2,andgivesthetransportationroute\nimprovetheexplorationabilityofthealgorithm. of job 3 in the red box in Fig 4 on the AGV. According to the\nThe principle of dividing regions in this paper is to divide\naboverules,the orderoftransportationtasksoneachAGV can\nthelocaloptimalsolutionswithlargesimilaritydifferencesinto\nbe obtained. After that, you can decode them one by one\ndifferent regions.",
      "size": 970,
      "sentences": 8
    },
    {
      "id": 38,
      "content": "to divide\naboverules,the orderoftransportationtasksoneachAGV can\nthelocaloptimalsolutionswithlargesimilaritydifferencesinto\nbe obtained. After that, you can decode them one by one\ndifferent regions. Such local optimal solutions are called seed\naccording to the processing order of the operations. The\nsolutions. Therefore, the update of clusters in the iterative\nspecificstepsareasfollows:\nprocess is to first identify the seed solutions within the cluster\nStep1: According to the operation processing order, get the\nrange, divide the regions according to the seed solutions, and\noperation . Then, determine the assigned processing\nthen perform clustering to generate multiple clusters. When\nmachineandAGV,thecurrentpositionofthejob. clustering,make surethat any two seedsolutions arenot inthe\nStep2: According to the order of transportation tasks on\nsame cluster. In order to implement the above method, this\nAGV, get the position of AGV. Process the load task of .",
      "size": 966,
      "sentences": 10
    },
    {
      "id": 39,
      "content": "seedsolutions arenot inthe\nStep2: According to the order of transportation tasks on\nsame cluster. In order to implement the above method, this\nAGV, get the position of AGV. Process the load task of . paper adopts the metric NBD mentioned in Preuss's clustering\nThe start time of is the completion time of the previ  ou   s method[31]. This metric is based on the similarity of solutions\ntask in the AGV. The end time is the start time plus the inasetandtherankingofthefitnessofthesolutionsintheset. +   \ntransportationtimefromthecurrentlocationoftheAGVtothe Thecalculationformulaofthismetricisasfollows:\ncurrentlocationofthejob. Step3: Continue to traverse the AGV task list. If the next\ntask is , calculate the start time of the task .",
      "size": 736,
      "sentences": 9
    },
    {
      "id": 40,
      "content": "ocationoftheAGVtothe Thecalculationformulaofthismetricisasfollows:\ncurrentlocationofthejob. Step3: Continue to traverse the AGV task list. If the next\ntask is , calculate the start time of the task . At this ∞ ,      ,  =∅\ntime, compare the end time of the previous task of the AGV      ,  =   m∈  in   ,  |   −   |,   ℎ       , (10)\n−    −    is the set of solutions that are better than in the\nwith the completion time of the operation (if the\no cu p r e r r e a n ti t o m n a is ch th in e e, fir a s n t d op se e l r e a c ti t o t n h , e th la e rg c e o r m o p n le e ti a o s n t t h i  m e   e s − ta 1 is rt 0 t ) im on e i o ts f s b o e l t  u w t  i e  o , e  n ns s o et lutio , n a s nd and . denotes the Euclidean   distance\n|   −   |\n.",
      "size": 755,
      "sentences": 5
    },
    {
      "id": 41,
      "content": "c e o r m o p n le e ti a o s n t t h i  m e   e s − ta 1 is rt 0 t ) im on e i o ts f s b o e l t  u w t  i e  o , e  n ns s o et lutio , n a s nd and . denotes the Euclidean   distance\n|   −   |\n. The completion time is the start time plus the According to the calculation formula of NBD, it can be\ninferred that if the  s  olution  s  in the set are evenly distributed,\ntransportation time from the current machine of the job to the\n−    most solutions can find better solutions in the closer\nmachineassignedto .OtherwiseturntoStep1. neighborhood,so the smaller the value ofNBD. Ifthe value of\nStep4:Determine whentostart processinganoperation.The\nNBD is large, it means that the fitness of the corresponding\nlarger of the completion time of in AGV and the\nsolution is better and the difference with other better solutions\ncompletiontime ofanoperationonthe scheduledmachine that\n−   \n=== 페이지 7 ===\nis greater.",
      "size": 912,
      "sentences": 5
    },
    {
      "id": 42,
      "content": "arger of the completion time of in AGV and the\nsolution is better and the difference with other better solutions\ncompletiontime ofanoperationonthe scheduledmachine that\n−   \n=== 페이지 7 ===\nis greater. In order to verify that the relationship between the D. DividetheRegionandConstructclusters\nsolutions to this problem conforms to the above inference, we The solution to the problem studied in this paper can be\nconducted two experiments. Experiment 1 randomly generates representedbyahigh-dimensionalvector.Therefore,theregion\n1000solutionsandcalculatestheNBDvalue.Thehistogramof can be defined as a subspace parallel to the axis. In short, the\nNBDofallsolutionsisshown inFig7(a).Experiment2isthe region is to give a value range to each dimension of the high-\nhistogram of NBD of all solutions in a cluster during the dimensional vector. The cluster is a collection of regions. The\niteration process of HRPEO, see Fig 7 (b).",
      "size": 924,
      "sentences": 6
    },
    {
      "id": 43,
      "content": "nge to each dimension of the high-\nhistogram of NBD of all solutions in a cluster during the dimensional vector. The cluster is a collection of regions. The\niteration process of HRPEO, see Fig 7 (b). In Fig 7, each k-d Tree is a suitable data structure that can be used for the\noutlier in the distribution is a local optimal solution, so these storage and searchof high-dimensional data.A hyperplane can\noutliers can be regarded as seed solutions. In order to detect be used to divide a region into two half-regions. For example,\noutliers in the distribution, this paper defines solutions with an according to the k-th dimension division, the k-th dimension\nNBD value greater than as the seed solutions of the values of the points on the left side of the tree are all less than\ndistribution.Where isthemeanofthedistributionand is the specified value, and the nodes on the right are all greater\n+  ∙ \nthe standard deviation.",
      "size": 923,
      "sentences": 6
    },
    {
      "id": 44,
      "content": "points on the left side of the tree are all less than\ndistribution.Where isthemeanofthedistributionand is the specified value, and the nodes on the right are all greater\n+  ∙ \nthe standard deviation. In addition, it is necessary to filter out thanthespecifiedvalue.Basedonthestructureofk-dTree,we\nsimilar solutions, so  that the seed solutions correspondin  g to cancontinuouslydecomposethespaceintomultiplesubspaces. theclustercanbeobtained. First, find the dimension with the largest variance among all\nAlgorithm2.Divideregions( ) seed solutions, and then divide the space into two regions\nInput:acollectionofregions ,seedsolutionset ; according to this dimension. At the same time, distribute the\nOutput:updated ;   ,  original solutions to the two regions. The above method is\nshowninFig8. 1. //Initialization\nBased on this region half-division method, the solutions in\n2.",
      "size": 876,
      "sentences": 8
    },
    {
      "id": 45,
      "content": "e time, distribute the\nOutput:updated ;   ,  original solutions to the two regions. The above method is\nshowninFig8. 1. //Initialization\nBased on this region half-division method, the solutions in\n2. For do\nthe cluster will be divided into different regions, so the seed\n3. sign true;\n=1   |  | solutions will also be assigned to different regions. When any\n4. For do\n← twoseedsolutionsintheclusterarenotinadjacentregions,the\n5. If then\n=1   |  | region division can be stopped. Since the region is divided in\n6. Identify the dimensions with the greatest\n≠   half each time, the reference vector and region range of the\ndifference ;\nnodes at the same height and position in the k-d tree are the\n7. Find the region where is located in\nsame. Not only that, considering that the regions must be\n;\n←   divided in each iteration and for each cluster, we construct a\n8.",
      "size": 863,
      "sentences": 12
    },
    {
      "id": 46,
      "content": "sition in the k-d tree are the\n7. Find the region where is located in\nsame. Not only that, considering that the regions must be\n;\n←   divided in each iteration and for each cluster, we construct a\n8. Find the region where is located in\nglobal k-d tree to record the regions divided during the entire\n\n;\n←   iterationprocess.Thesolutionssearchedineachgenerationcan\n9. If and overlap in the range of the th\nalsofindthecorrespondingregioninthek-dtreeandcopyitto\n\ndimension  th  en    the solution set of the region. The mean fitness of solution set\n10. //Halftheregion intheregioncanbeusedasastandardtomeasurethepotential\n11. halve( ); of the region. See Algorithm 2 for details. In the subsequent\n12. ; iteration process, when it is necessary to locate the region for\n1,   2 ←  \n13. EndIf the seed solution in the global k-d Tree, if the traversed node\n14. End ( If   −   )∪   1∪   2 has left and right subtrees, there is no need to repeatedly build\n15. End the leaf node of the node.",
      "size": 982,
      "sentences": 12
    },
    {
      "id": 47,
      "content": "dIf the seed solution in the global k-d Tree, if the traversed node\n14. End ( If   −   )∪   1∪   2 has left and right subtrees, there is no need to repeatedly build\n15. End the leaf node of the node. At this time, you only need to\n16. End continue searching downward. When the termination condition\nismet,the regioncorresponding tothe nodewherethe indexis\nAlgorithm3.GroupClusters( ) located is the divided subregion. And during the traversal\nprocess, if the index traverses to the left subtree, the region\nInput:acollectionofregions\ncorrespondingtotherightsubtreeneedstobeaddedtothe . Output:acollectionofclusters\nSimilarly, if the index is in the right subtree, the region on the\n1. ; ;\n\nleftsubtreeneedstobeaddedtothe . 2. Filter the area that must not have a corresponding\n←∅    ←∅\nsolution( ); Algorithm4.FindtheNeighborhoodregions\n\n3. Sort all regions in ascending order according Input:\n\ntotheirmeanfitness( ); Output:acollectionofclusters\n4. ← 1.    ,    ,     ;\n5. While do   2. 6. ←0; ; 3.",
      "size": 999,
      "sentences": 15
    },
    {
      "id": 48,
      "content": "lgorithm4.FindtheNeighborhoodregions\n\n3. Sort all regions in ascending order according Input:\n\ntotheirmeanfitness( ); Output:acollectionofclusters\n4. ← 1.    ,    ,     ;\n5. While do   2. 6. ←0; ; 3. Fo   r     ← Ad  ja  c  e  n  t  r  eg ∪ io  ns  o  f  do\n7. > Fi 0 nd the Neighborhood regions 4. I  f ←  i  s  no ∪ t  be  tt  er  than and\n(        ←∅ ); then  ∈    \n8. ← ; 5. Find the  Ne  ig  h  borhood  ∉ reg  i  on  s\n,    ,    \n9. End ( );\n←   ∪               ←\n6. EndIf\n7. E  nd   ,    , \n=== 페이지 8 ===\nrelatively promising initial solution while ensuring that the\ninitial population distribution is relatively uniform. The\ndecision tree is shown in Fig 9. The root node is the starting\nnode, from which the decision tree is generated. The nodes in\nthe second layer are the first operation of each job. The nodes\ninthe third layer arethe operation that canbe selected after its\nparent node.",
      "size": 899,
      "sentences": 18
    },
    {
      "id": 49,
      "content": ", from which the decision tree is generated. The nodes in\nthe second layer are the first operation of each job. The nodes\ninthe third layer arethe operation that canbe selected after its\nparent node. Therefore, the processing order of the operations\ncanbeobtainedbasedonthe decisiontree.Forthe selection of\nmachines and AGVs, First Come First Served heuristic rule is\nused to determine. However, the solution space of the problem\nislarge,soitisimpossibletolistallsolutionsandcalculatethe\nfitness of them. Therefore, pruning is performed when the\ndecisiontreegeneratesthe operationsequence.Thatis,thesize\nof the initial population is set to , and the subtree\ncorrespondingtoeachsecond-levelrootnodeultimatelyretains\n∙  1\nonly branches. When constructing a certain layer of each\nsubtree,iftheleafnodeisgreaterthan ,thefitnessvalueof\nFig.7.AhistogramofNBDofarandomsolutionset(a)and  1\nsome solutions is calculated, and the branches with larger\nAhistogramofNBDofasolutionsetinacluster(b).",
      "size": 984,
      "sentences": 7
    },
    {
      "id": 50,
      "content": "iftheleafnodeisgreaterthan ,thefitnessvalueof\nFig.7.AhistogramofNBDofarandomsolutionset(a)and  1\nsome solutions is calculated, and the branches with larger\nAhistogramofNBDofasolutionsetinacluster(b). fitnessvaluesaresubtracted. 1\nIn addition, in the subsequent iteration process, the size of\nAfter all the regions in the clusters are redivided, all the\neach subpopulation is also . Therefore, the size of the\nregions are stored in , and the cluster set is updated using\npopulation is related to the instance. The larger the instance\nthe clustering method. As mentioned above, whenever the size, the larger the solution s  pa∙c  e1and the larger the population\nnumber of solutions i  n  a region increases, the value of the\nsize of the algorithm. This strategy can, to a certain extent,\nregion, that is, the mean of the solution set fitness, will be\nreducetheimpactofinstancesizeonalgorithmperformance. updated. Therefore, clusters can be constructed based on the\nmeanfitnessofeachregion.",
      "size": 987,
      "sentences": 9
    },
    {
      "id": 51,
      "content": "gion, that is, the mean of the solution set fitness, will be\nreducetheimpactofinstancesizeonalgorithmperformance. updated. Therefore, clusters can be constructed based on the\nmeanfitnessofeachregion. Theclusteringmethodisshownin\nAlgorithm3. It should be explained that the purpose of filtering the\nregions in RS is to exclude the situation where the solutions in\nthe region are definitely infeasible solutions. For example,\nthere may be a dimension where High-Low=0, and there is no\nsolutioninthisregion.Inaddition,duetotheconstraintsofthe\njob sequence processing in the problem, the solutions in the\nregion may be definitely infeasible solutions. Finding adjacent\nregionsinAlgorithm 3isarecursive process,andAED isused Fig.9.Thedecisiontreeforgeneratinginitialpopulation. to record the regions that have been assigned to a cluster. The\nprocessoffindingadjacentregionstobuildclustersisshownin\nF. EvolutionaryOperators\nAlgorithm4.",
      "size": 929,
      "sentences": 9
    },
    {
      "id": 52,
      "content": "ecisiontreeforgeneratinginitialpopulation. to record the regions that have been assigned to a cluster. The\nprocessoffindingadjacentregionstobuildclustersisshownin\nF. EvolutionaryOperators\nAlgorithm4. Crossover and mutation operators are used in both\nExploitationandExploration.InExploitation,theparentscome\nfrom the same cluster, while in Exploration, the children are\nselectedfromdifferentclusters. As the iterative proceeds, the number of solutions in each\nregion may increase, and accordingly, the number of solutions\nineachclustermayalsoincrease.Intheexploitation,wecannot\nuse evolutionary operations on every solution, so we should\ngive priority to solutions with greater potential. This paper\nconsidersselecting betterindividualsforeachclusteras\nselected individuals to construct the subpopulation of this\nFig. 8. The process of partitioning with hyperplanes in k-d cluster. If the numb  er∙o  f1solutions in a cluster is greater than\nTree.",
      "size": 946,
      "sentences": 9
    },
    {
      "id": 53,
      "content": "eras\nselected individuals to construct the subpopulation of this\nFig. 8. The process of partitioning with hyperplanes in k-d cluster. If the numb  er∙o  f1solutions in a cluster is greater than\nTree. , the first bestsolutions inthe cluster arecopied\nto the subpopulation. If the number of solutions in a cluster is\n∙  1  ∙  1\nE. InitializethePopulation less than , all the solutions in the cluster are copied to\nthe subpopulation. Then randomly generated solutions within\nInspired by the parallel heuristic mentioned in Arash, this\nthe range  c∙o  rr1esponding to the cluster and add into the\npaper designs an initialization rule[13]. The process of\nsubpopulation until the number of individuals in the\ngenerating solutions based on a decision tree to obtain a\n=== 페이지 9 ===\nsubpopulation is met. In Exploration, two clusters are selected loadingand unloadingtasksonmulti-load AGVs.",
      "size": 882,
      "sentences": 9
    },
    {
      "id": 54,
      "content": "individuals in the\ngenerating solutions based on a decision tree to obtain a\n=== 페이지 9 ===\nsubpopulation is met. In Exploration, two clusters are selected loadingand unloadingtasksonmulti-load AGVs. Asshown in\nby roulette according to the mean of fitness for each cluster, Fig10,weexemplifytheorderofpartialloadingandunloading\nand two solutions are randomly selected from the clusters for tasks on an AGV when the AGV capacity limit is 3. Assume\nevolution. The above process is repeated to generate a total of that the loading task is represented by , the unloading task is\nsolutions. represented by , and the code shows the jobs that each AGV\nTheaboveexplainshow toselect parentsinexploitationand needs to transport. Therefore, as long + as the order of loading\nex2ploration respectively.",
      "size": 789,
      "sentences": 7
    },
    {
      "id": 55,
      "content": "sented by , and the code shows the jobs that each AGV\nTheaboveexplainshow toselect parentsinexploitationand needs to transport. Therefore, as long + as the order of loading\nex2ploration respectively. After selection, the operation and unloading t−asks oneach AGV is known, the transportation\nencoding is performed to POX crossover and mutation pathoftheAGVcanbeknown.InFig10,0representsthestart,\noperations[32, 33]. The machine and AGV encodings are L0 represents the number of jobs on the current AGV is 0, L1\nsubjected to PMX crossover and mutation operations[34]. In represents the number of jobs on the AGV is 1, and so on. As\naddition, the machine encoding may produce unworkable can be seen from Fig 10 (a), when it is a loading node, the\nsolutions after the change, so it needs to be corrected.",
      "size": 801,
      "sentences": 6
    },
    {
      "id": 56,
      "content": "the AGV is 1, and so on. As\naddition, the machine encoding may produce unworkable can be seen from Fig 10 (a), when it is a loading node, the\nsolutions after the change, so it needs to be corrected. The number of layers where the node is located will increase\ncorrection strategy is to randomly select a machine that is relative to the previous node, otherwise, if it is an unloading\nsuitablefortheoperation. node,itwilldecrease. In addition, all solutions generated by evolutionary DuetothecapacityconstraintoftheAGV,thepositionofall\noperationsmustbestoredintheglobalk-dtree. nodes will not exceed the given number of layers. Therefore,\nnot all loading nodes can be changed to unloading nodes, and\nvice versa. Combining the above, we can find that for AGV\nwith capacity 3, only the loading nodes at L2 and L3 can be\ntransformed into unloading nodes, and the unloading nodes at\nL0 and L1 can be transformed into loading nodes. The\ntransformation method is shown in Figure 10 (b).",
      "size": 979,
      "sentences": 9
    },
    {
      "id": 57,
      "content": "he loading nodes at L2 and L3 can be\ntransformed into unloading nodes, and the unloading nodes at\nL0 and L1 can be transformed into loading nodes. The\ntransformation method is shown in Figure 10 (b). Node\ntransformationisachievedbymovingthenodeupordownone\nlevel. When a node is transformed, the subsequent nodes will\nalso change accordingly. If the difference in the number of\nlayersbetweenachangednodeandthenodebehinditisgreater\nthan 1, the node behind it must also move accordingly. Similarly, we can infer that for AGV with capacity 2, only the\nloading node at L2 and the unloading stage at L0 can be\nFig. 10. The order of partial loading and unloading tasks on\ntransformed.The rulesofAGVsofothercapacitiescanalsobe\nanAGV. inferred in this way. It is worth noting that it is necessary to\nensurethatthelastunloadingnodemustbeinL0. G. LocalSearch Combined with the above rules, this paper uses local search\nfor transportation tasks on AGV.",
      "size": 940,
      "sentences": 11
    },
    {
      "id": 58,
      "content": "s way. It is worth noting that it is necessary to\nensurethatthelastunloadingnodemustbeinL0. G. LocalSearch Combined with the above rules, this paper uses local search\nfor transportation tasks on AGV. It tries to transform each\nInexploitation,the crossoverandmutationoperatorareused\ntransformable node, and if the transformed solution is better,\nto let the offspring inherit the dominant gene fragments of the\nreplacetheoriginalsolution. parent while randomly changing other fragments. This\nevolutionary operation may obtain a better solution, but it is\nrandom. Therefore, to improve the search efficiency of the\nV.EXPERIMENTALRESULTSANDANALYSIS\nexploitation,weuseasearchoperatorinspiredbythefeatureof A.Instancesetting\nthe problem. Inthis part,we use agreedy method,which has a\nThispaperusestwobenchmarks:FJSPTandEX[36],butthe\nstrong local search ability, but takes more time[35]. To\ndatasets do not consider the upper limit of the AGV capacity.",
      "size": 945,
      "sentences": 9
    },
    {
      "id": 59,
      "content": "use agreedy method,which has a\nThispaperusestwobenchmarks:FJSPTandEX[36],butthe\nstrong local search ability, but takes more time[35]. To\ndatasets do not consider the upper limit of the AGV capacity. overcome this shortcoming, the local search strategy will only\nTherefore, this paper sets the upper limit of the AGV capacity\nbe executed when the fitness value of the solution is less than\nto 2 or 3. All compared algorithms are coded in Java. All\nthemeanfitnessoftheregiontowhichitbelongs. experiments are run on a Microsoft Windows 11 operating\nThegreedysearchstrategyisusedtoperformlocalsearchon\nsystem with 20 GB RAM of memory and a 3.20 GHz Intel(R)\nmachinecodesandAGVcodes.Thatis,themachinecodesand\nCore (TM) i5-10505 CPU. The iteration termination criterion\nAGV codes are traversed sequentially, and all optional\nof all the algorithms in all experiments is CPU time, and the\nmachines and AGVs are tried.",
      "size": 909,
      "sentences": 7
    },
    {
      "id": 60,
      "content": "TM) i5-10505 CPU. The iteration termination criterion\nAGV codes are traversed sequentially, and all optional\nof all the algorithms in all experiments is CPU time, and the\nmachines and AGVs are tried. If the fitness of the solution is\nrunning time of each algorithm is ms ( is\nsmaller after changing the machine and AGV, the original\nthe number of jobs, is the number of machines, is the\nsolutionisreplaced. ×  ×  ×10 \nnumber of the multi-load AGVs). In all experiments, each\nHowever, the search for the list of transport tasks on the algorithmisrunindep  endentlyfor20times,andthispa  peruses\nAGV is more complicated. This is because the order of\nas an indicator to evaluate the performance of the\ntransporttasksontheAGVisaffectedbytheupperlimitofthe\nalgorithm. AGV capacity. Forexample, when the upper limit ofthe AGV    \n(11)\ncapacity is 2, the 3 consecutive transport tasks on the AGV\n1    −     \ncannot all be loading tasks.",
      "size": 928,
      "sentences": 8
    },
    {
      "id": 61,
      "content": "dbytheupperlimitofthe\nalgorithm. AGV capacity. Forexample, when the upper limit ofthe AGV    \n(11)\ncapacity is 2, the 3 consecutive transport tasks on the AGV\n1    −     \ncannot all be loading tasks. Therefore, we studied the order of\n=  \u0000  =1     \n=== 페이지 10 ===\nwhere is the makespan of solution found by current approach in -th trial. is makespan of the current best\nsolutionin all trialtimesfor instance. isthe number oftrial\nTABLEI\n\ntimes.",
      "size": 444,
      "sentences": 6
    },
    {
      "id": 62,
      "content": "=== 페이지 10 ===\nwhere is the makespan of solution found by current approach in -th trial. is makespan of the current best\nsolutionin all trialtimesfor instance. isthe number oftrial\nTABLEI\n\ntimes. THEARPDOFHRPEOANDTHEVARIANTSOFITOF\n\nALLINSTANCES\nHRPEO HRPEO HRPEO\nInstance HRPEO HRPEO3\n1 2 4\n1 1.22414 1.96552 1.94828 7.24138 3.82759\n2 2.43103 2.74138 2.32759 5.20690 3.44828\n3 1.21429 1.30357 1.69643 9.33929 3.73214\n4 0.72059 0.75000 1.05882 7.64706 3.72059\n5 0.87302 0.88889 1.01587 5.71429 2.20635\n6 1.28125 1.40625 1.25000 4.71875 2.00000\n7 1.59677 1.58065 1.66129 6.85484 3.35484 Fig.11.Themaineffectplotfor\n8 1.41892 1.52703 1.51351 5.89189 2.45946\nB.ExperimentalParameters\n\n9 2.25862 2.55172 2.63793 10.51724 3.79310\nTheparametersettingshaveanimpactontheperformanceof\n10 2.12069 2.58621 2.65517 10.81034 3.74138\nthe algorithm.",
      "size": 833,
      "sentences": 4
    },
    {
      "id": 63,
      "content": "1351 5.89189 2.45946\nB.ExperimentalParameters\n\n9 2.25862 2.55172 2.63793 10.51724 3.79310\nTheparametersettingshaveanimpactontheperformanceof\n10 2.12069 2.58621 2.65517 10.81034 3.74138\nthe algorithm. There are three parameters involved in the\n11 1.90909 2.30909 2.27273 9.89091 3.81818\nHRPEO,andTaguchi'sexperimentalmethodisusedtofindthe\n12 1.46377 1.57971 1.75362 8.11594 4.46377 optimal combination of parameters in this section[37]. The\n13 1.79167 2.45833 2.25000 8.22917 3.62500 levels of each parameter are as follows: ,\n14 1.52000 1.46000 1.68000 7.30000 2.54000 , . The main\n1= 4,5,6,7,8\n15 1.93478 2.30435 2.58696 12.78261 4.13043 effect plot for is shown in the Fig. 11. has the\n2={8,9,10,11,12}  ={1.5,2.0,2.5,3.0,3.5}\n16 2.00000 2.21667 2.01667 7.33333 3.35000 greatest impact on the algorithm performance, followed by ,\n1\n17 1.60563 1.91549 2.18310 11.87324 4.47887 and has the least impact on the algorithm.",
      "size": 920,
      "sentences": 5
    },
    {
      "id": 64,
      "content": ".0,3.5}\n16 2.00000 2.21667 2.01667 7.33333 3.35000 greatest impact on the algorithm performance, followed by ,\n1\n17 1.60563 1.91549 2.18310 11.87324 4.47887 and has the least impact on the algorithm. affects the\n\n18 1.60870 2.21739 2.65217 11.84058 4.92754 searchofHRPEOduringthedevelopmentprocess.If istoo\n2  1\nlarge, there may be too many solutions that need to be\n19 3.03030 3.28788 3.16667 11.43939 5.68182\noptimizedin the subpopulation, which will take toom  uc1h time\n20 2.45679 2.95062 3.16049 12.76543 5.65432\nin the exploitation. If becomes smaller, there will be a\n21 1.25882 1.61176 1.72941 6.55294 3.10588\ncertainprobabilityofforgettingpotential solutions. controls\n22 1.84524 2.02381 2.21429 6.73810 2.82143  1\nthe number of the identified seed solutions. If it is too small,\n23 2.00000 2.66667 2.56790 6.72840 4.13580 toomanyseedsolutionswill beidentified, making th  e regional\n24 1.80000 2.07368 2.56842 6.94737 4.62105 division too scattered.",
      "size": 959,
      "sentences": 5
    },
    {
      "id": 65,
      "content": "lutions. If it is too small,\n23 2.00000 2.66667 2.56790 6.72840 4.13580 toomanyseedsolutionswill beidentified, making th  e regional\n24 1.80000 2.07368 2.56842 6.94737 4.62105 division too scattered. If is too large, some seed solutions\n25 2.28169 2.61972 2.77465 10.90141 3.07042 will be missed, making it difficult to divide the region. 26 2.05556 2.33333 2.38889 6.34722 3.76389 controlsthescopeofgloba  lsearchtoacertainextent.If is\n2\n27 3.01493 3.37313 3.44776 3.76119 4.73134 toosmall,itisdifficulttofindsolutionsinunknown regions.If\n28 2.73077 2.85897 2.88462 10.78205 4.46154 it is too large, it will interfere with the exploitation abil  ity2of\n29 1.38346 1.66165 1.72180 4.61654 2.93985 thealgorithm. Basedoncomprehensiveevaluation,the optimal\nparameter configuration is asfollows: , ,\n30 2.29808 2.42308 2.31731 5.01923 3.18269\n.",
      "size": 840,
      "sentences": 5
    },
    {
      "id": 66,
      "content": "abil  ity2of\n29 1.38346 1.66165 1.72180 4.61654 2.93985 thealgorithm. Basedoncomprehensiveevaluation,the optimal\nparameter configuration is asfollows: , ,\n30 2.29808 2.42308 2.31731 5.01923 3.18269\n. 31 1.62281 1.83333 1.57018 5.05263 2.65789\n1=6  2=9  =\n32 1.42056 1.63551 1.46729 6.57009 2.98131\n3.5\n33 1.62651 1.80723 1.40964 5.13253 2.84337\n34 0.98519 1.28148 1.30370 4.82963 2.60741\n35 1.60377 1.80189 1.91509 5.77358 3.59434\n36 0.36310 0.50000 0.72024 8.80952 1.58929\n37 1.26357 1.49612 1.26357 5.13953 1.93798\n38 0.88824 1.16471 1.19412 5.61176 2.68824\nTABLEII\nFRIEDMANANALYSISOFEACHVARIANTSOF\nHRPEO\nAlgorithm mean p-value\nHRPEO/HRPEO1 3.15582 0.016\nFig.12.Theconvergencecurvesofvariants\nHRPEO/HRPEO2 3.69993 0.00216\nHRPEO/HRPEO3 10.48313 1.03266E-24\nHRPEO/HRPEO4 7.87142 3.50646E-14\n[표 데이터 감지됨]\n\n=== 페이지 11 ===\nHRPEO3:thelocalsearchstrategyisremoved;\nTABLEIII\nHRPEO4: the region division strategy is removed, and the\nTHEARPDOFHRPEOANDTHECOMPARION\nGA framework is adopted while retaining other strategies, and\nALGORITHMOFALLINSTANCES\nthe tournament selection strategy is adopted.The experimental\nDHN DQN EDA EMO LME PSOS HRPE\nInstan resultsareshowninTableI.Inaddition,we usedtheFriedman\nDE MMA_ACO_ EA O A O\nce analysis of variance method to analyze the data of each group\nLS\natthe0.05level, andtheanalysisresultsareshown inTableII.",
      "size": 1339,
      "sentences": 3
    },
    {
      "id": 67,
      "content": "resultsareshowninTableI.Inaddition,we usedtheFriedman\nDE MMA_ACO_ EA O A O\nce analysis of variance method to analyze the data of each group\nLS\natthe0.05level, andtheanalysisresultsareshown inTableII. 1 9.862 10.793 4.207 4.207 9.121 10.741 1.431\nFig. 12 illustrates the convergence curves of these variants on\n2 9.638 10.914 3.793 3.793 8.948 11.190 2.690 an example. From the experimental results, it can be seen that\n3 11.607 10.946 3.571 3.571 10.321 11.018 1.839 in most instances, HRPEO has a smaller ARPD value. Fig. 12\n4 9.618 11.412 3.426 3.426 9.647 9.809 0.765 can well reflect the role of each strategy. HRPEO1 has a\n5 10.825 10.444 3.984 3.984 9.651 10.937 1.048 slightly weaker exploration ability than HRPEO and has not\n6 9.250 10.469 4.344 4.344 8.766 10.266 1.453 converged to the optimal solution. HRPEO2 uses random\ninitialization, so the initial fitness value is relatively large.",
      "size": 899,
      "sentences": 8
    },
    {
      "id": 68,
      "content": "on ability than HRPEO and has not\n6 9.250 10.469 4.344 4.344 8.766 10.266 1.453 converged to the optimal solution. HRPEO2 uses random\ninitialization, so the initial fitness value is relatively large. 7 10.839 10.774 4.339 4.339 9.452 11.048 1.887\nHRPEO3 lacks a search strategy based on problem\n8 10.486 11.054 4.811 4.811 10.892 11.257 1.473\ncharacteristicsandintelligentrandomsearch,soitisdifficultto\n9 13.207 16.052 5.190 5.190 11.948 14.224 2.776\nfind the optimal solution. HRPEO4 lacks regional division and\n10 14.224 15.000 5.534 5.534 12.121 14.483 2.603\nis easy to condense local optimality. HRPEO has achieved\n11 14.636 16.545 6.291 6.291 13.945 15.891 2.018 goodresultson32instances.However,intheinstance7and14,\n12 15.377 16.435 5.986 5.986 15.522 15.884 1.623 itiseasiertofindabettersolutionwithoutexplorationstrategy.",
      "size": 829,
      "sentences": 5
    },
    {
      "id": 69,
      "content": "6.545 6.291 6.291 13.945 15.891 2.018 goodresultson32instances.However,intheinstance7and14,\n12 15.377 16.435 5.986 5.986 15.522 15.884 1.623 itiseasiertofindabettersolutionwithoutexplorationstrategy. 13 9.792 11.396 4.667 4.667 8.333 10.438 2.167 Thisisbecausethesolutionintheexplorationprocessmaytake\n14 8.240 11.260 3.860 3.860 7.540 9.820 1.780 more time to perform regional division, thereby reducing the\n15 10.717 12.500 5.435 5.435 9.957 11.587 2.065 search efficiency. In the instance 2, 6, 31 and 33, the\ninitialization method mentioned in this article will discard\n16 10.483 10.933 4.833 4.833 9.700 10.950 2.300\nindividuals with better potential during pruning, which causes\n17 10.803 11.042 6.141 6.141 10.465 12.634 2.282\nthealgorithmtofallintoalocaloptimalstate.",
      "size": 775,
      "sentences": 3
    },
    {
      "id": 70,
      "content": "10.483 10.933 4.833 4.833 9.700 10.950 2.300\nindividuals with better potential during pruning, which causes\n17 10.803 11.042 6.141 6.141 10.465 12.634 2.282\nthealgorithmtofallintoalocaloptimalstate. 18 11.884 11.928 6.754 6.754 10.449 12.942 2.391\nInsummary,thelocalsearchstrategyandtheregiondivision\n19 13.485 13.667 8.636 8.636 12.530 14.848 3.348\nstrategy have made the main contribution to the improvement\n20 13.568 14.951 7.198 7.198 14.086 15.025 3.333\nof the algorithm performance. The initialization strategy and\n21 10.847 11.353 6.000 6.000 10.165 12.118 1.741 theexplorationstrategyhavealsoimprovedtheperformanceof\n22 11.560 11.298 7.833 7.833 11.179 11.988 2.321 thealgorithmtoacertainextent,butduetotheinfluenceofthe\n23 13.173 13.778 8.728 8.728 11.926 13.605 2.840 instance,theydonotworkeverytime.",
      "size": 810,
      "sentences": 3
    },
    {
      "id": 71,
      "content": "performanceof\n22 11.560 11.298 7.833 7.833 11.179 11.988 2.321 thealgorithmtoacertainextent,butduetotheinfluenceofthe\n23 13.173 13.778 8.728 8.728 11.926 13.605 2.840 instance,theydonotworkeverytime. 24 12.726 13.000 7.674 7.674 13.179 13.189 2.537\n25 10.690 11.380 5.169 5.169 10.000 11.352 2.606 TABLEIV\nFRIEDMANANALYSISOFEACHCOMPARION\n26 10.222 10.833 4.556 4.556 9.778 11.264 2.417\nALGORITHM\n27 11.104 13.254 7.313 7.313 11.209 12.388 3.403\nAlgorithm mean p-value\n28 11.872 13.167 6.513 6.513 12.679 14.000 2.756\n29 8.226 7.338 5.421 5.421 3.805 9.263 1.774 DHNDE/HRPEO 8.28351 2.51153E-15\n30 8.144 6.865 6.596 6.596 3.904 8.788 2.558 DQNMMA/HRPEO 10.19509 4.3796E-23\n31 7.053 7.447 6.404 6.404 3.237 9.202 1.781 EDA_ACO_LS/ 3.50456 0.0096\nHRPEO\n32 8.673 6.308 5.991 5.991 4.710 8.972 1.701\nEMOEA/HRPEO 3.50456 0.0096\n33 7.277 6.229 5.386 5.386 3.928 8.337 1.639\nLMEO/HRPEO 5.52234 7.0248E-7\n34 6.222 6.111 4.563 4.563 2.867 6.956 1.259\nPSOSA/HRPEO 11.36328 1.33789E-28\n35 7.868 7.283 7.151 7.151 4.264 9.481 1.943\n36 4.750 4.982 3.613 3.613 2.452 6.274 0.375 C.EffectivenessComparisonstootheralgorithms\n37 5.395 5.504 1.922 1.922 2.597 6.876 1.225 To further verify the effectiveness of HRPEO, this\n38 5.835 6.035 5.059 5.059 3.353 7.759 1.135 experiment compares it with several advanced algorithms.",
      "size": 1305,
      "sentences": 2
    },
    {
      "id": 72,
      "content": "s\n37 5.395 5.504 1.922 1.922 2.597 6.876 1.225 To further verify the effectiveness of HRPEO, this\n38 5.835 6.035 5.059 5.059 3.353 7.759 1.135 experiment compares it with several advanced algorithms. The\nselected comparison algorithm and parameter settings are as\nC.EffectivenessofEachImprovementStrategyofHRPEO\nfollows:\nTo verify the effectiveness of each strategy in HRPEO, this DHNDE[38], 2022, , , ,\nsectioncomparesHRPEO withits variants. The detailsofeach ,\nvariantareasfollows:  =0.9   =0.3  =5     =\nDQNMMA[15],2024, , , ,\nHRPEO1:theexplorationinHRPEOisremoved; 0.1,     =1.0  −5,   =200      =200. , . HRPEO2: the initialization strategy is removed and random   =90 ∝=0.001  =0.9  =\nEDA_ACO_LS[39],2024, , , ,\ninitializationisadopted; 0.6   =0.2\n, ,   \n=400   =0.1  =0.8\n\n=0.4  =0.4\n[표 데이터 감지됨]\n\n=== 페이지 12 ===\nEMOEA[40], , , , .",
      "size": 837,
      "sentences": 5
    },
    {
      "id": 73,
      "content": "trategy is removed and random   =90 ∝=0.001  =0.9  =\nEDA_ACO_LS[39],2024, , , ,\ninitializationisadopted; 0.6   =0.2\n, ,   \n=400   =0.1  =0.8\n\n=0.4  =0.4\n[표 데이터 감지됨]\n\n=== 페이지 12 ===\nEMOEA[40], , , , . also continuously explore unknown regions to prevent the\nLMEO[41],2023, , algorithmfromfallingintolocaloptimality.Inaddition,alocal\nPSOSA[6], 202  3, =60   = , 0.8   =0.5  =0.2 search is designed to improve the search efficiency of the\n1=30  2=15,  3=15. HRPEO based on the transportation characteristics of multi-\nwe used the Frie  d 1 ma = n 10 an 0 aly  sis = o 5 f 0,va  ri = anc 1 e /(2 m + eth  o  d  2t)o, load AGVs. Finally, compared with multiple advanced\nan1a=lyz0e.5t+he   d  a2ta,  o2f =ea0ch.5g+ro  u  p  2a;t the 0.05 level, and the algorithms, and a large number of experiments are carried out\nanalysis results. The experimental results are shown in Table to test the performance of the HRPEO. The results show the\nIII and Table IV.",
      "size": 947,
      "sentences": 6
    },
    {
      "id": 74,
      "content": "lgorithms, and a large number of experiments are carried out\nanalysis results. The experimental results are shown in Table to test the performance of the HRPEO. The results show the\nIII and Table IV. In addition, we visualized the experimental superiorityofHRPEOinsolvingFJSPMA. data, as shown in the box plot in Fig 13. In Fig 13, the box of In the future, we will continue to study the job shop\nHRPEO is the flattest, the data distribution is denser, and the scheduling problem of coupled processing and transportation. mean of its distribution is smaller than that of some other We can introduce more realistic constraints, such as path\ncomparison algorithms. Combining the results in Table III and conflicts, AGV transportation speed and energy consumption.",
      "size": 761,
      "sentences": 8
    },
    {
      "id": 75,
      "content": "that of some other We can introduce more realistic constraints, such as path\ncomparison algorithms. Combining the results in Table III and conflicts, AGV transportation speed and energy consumption. Table IV, HRPEO performs better than other algorithms on 38 At the same time, applying multimodal problem-solving\ninstances,soweconcludethatHRPEOiseasiertofindabetter strategies to improve algorithms for solving shop scheduling\nsolution when solving the FJSPMA problem than other problemsstillhassignificantroomforimprovement,suchasin\ncomparison algorithms. Compared with HRPEO, distinguishing individual characteristics, constructing\nEDA_ACO_LS and EMOEA lack exploration capabilities and subpopulations,andoptimizingclusteringmethods. local implementation strategies for AGV transportation tasks.",
      "size": 797,
      "sentences": 5
    },
    {
      "id": 76,
      "content": "idual characteristics, constructing\nEDA_ACO_LS and EMOEA lack exploration capabilities and subpopulations,andoptimizingclusteringmethods. local implementation strategies for AGV transportation tasks. Therefore, they are better than the other four comparison REFERENCE\nalgorithms that lack search capabilities, but the experimental [1] W. Li, D. Han, L. Gao, X. Li, and Y. Li, \"Integrated\nresultsarenotasgoodasHRPEO.DQNMMAandLMEOlack production and transportation scheduling method in hybrid\nlocal search for machine selection, and the results of the flowshop,\"Chin.J.Mech.Eng.,vol.35,no.1,p.12,2022. algorithms areunevenly distributed. There aredata gapsbelow [2] W. Wang, Y. Zhang, and R. Y. Zhong, \"A proactive\nthe mean, and the algorithms are greatly affected by the material handling method for CPS enabled shop-floor,\" Robot. instance scale. Through analysis, we found that HRPEO is Comput.-Integr. Manuf., vol.",
      "size": 916,
      "sentences": 8
    },
    {
      "id": 77,
      "content": "mean, and the algorithms are greatly affected by the material handling method for CPS enabled shop-floor,\" Robot. instance scale. Through analysis, we found that HRPEO is Comput.-Integr. Manuf., vol. 61, p. 101849, 2020, doi:\nmore able to balance the exploitation and exploration https://doi.org/10.1016/j.rcim.2019.101849. capabilities of the algorithm, and performs local search based [3] A. Goli, E. B. Tirkolaee, and N. S. Aydın, \"Fuzzy\non the characteristics of the problem, making it more suitable integrated cell formation and production scheduling\nforsolvingFJSPMA. considering automated guided vehicles and human factors,\"\nIEEETrans.FuzzySyst.,vol.29,no.12,pp.3686-3695,2021. [4] F. Yu, C. Lu, J. Zhou, L. Yin, and K. Wang, \"A\nknowledge-guided bi-population evolutionary algorithm for\nenergy-efficient scheduling of distributed flexible job shop\nproblem,\" Eng. Appl. Artif. Intell., vol. 128, p. 107458, 2024,\ndoi:https://doi.org/10.1016/j.engappai.2023.107458.",
      "size": 970,
      "sentences": 12
    },
    {
      "id": 78,
      "content": "utionary algorithm for\nenergy-efficient scheduling of distributed flexible job shop\nproblem,\" Eng. Appl. Artif. Intell., vol. 128, p. 107458, 2024,\ndoi:https://doi.org/10.1016/j.engappai.2023.107458. [5] M. Tian et al., \"Joint scheduling of AGVs and parallel\nmachines in an automated electrode foil production factory,\"\nExpert Syst. Appl., vol. 238, p. 122197, 2024, doi:\nhttps://doi.org/10.1016/j.eswa.2023.122197. [6] D. B. M. M. Fontes, S. M. Homayouni, and J. F.\nGonçalves, \"A hybrid particle swarm optimization and\nsimulated annealing algorithm for the job shop scheduling\nproblemwithtransportresources,\"Eur.J.Oper.Res.,vol.306,\nno. 3, pp. 1140-1157, 2023, doi:\nFig.13.Theboxplotofcomparisonalgorithm. https://doi.org/10.1016/j.ejor.2022.09.006. [7] Y. Zheng, Y. Xiao, and Y. Seo, \"A tabu search\nVI.CONCLUSIONS\nalgorithm for simultaneous machine/AGV scheduling\nIt is a promising direction to use the strategy of solving problem,\" Int. J. Prod. Res., vol. 52, no. 19, pp.",
      "size": 975,
      "sentences": 18
    },
    {
      "id": 79,
      "content": "d Y. Seo, \"A tabu search\nVI.CONCLUSIONS\nalgorithm for simultaneous machine/AGV scheduling\nIt is a promising direction to use the strategy of solving problem,\" Int. J. Prod. Res., vol. 52, no. 19, pp. 5748-5763,\nmultimodal problems to design algorithms for solving shop 2014,doi:10.1080/00207543.2014.910628. scheduling problems. This paper proposes a novel HRPEO [8] R. Boufellouh and F. Belkaid, \"Multi-objective\nalgorithm to solve the flexible job shop scheduling problem optimizationforenergy-efficientflowshopschedulingproblem\nwith limited multi-load AGVs. This study analyzes the with blocking and collision-free transportation constraints,\"\nFJSPMA, decomposes the problem into four sub-problems, Appl. Soft. Comput., vol. 148, p. 110884, 2023, doi:\nestablishesthecouplingrelationshipbetweenthesub-problems, https://doi.org/10.1016/j.asoc.2023.110884. and designs encoding and decoding rules.",
      "size": 897,
      "sentences": 14
    },
    {
      "id": 80,
      "content": "ms, Appl. Soft. Comput., vol. 148, p. 110884, 2023, doi:\nestablishesthecouplingrelationshipbetweenthesub-problems, https://doi.org/10.1016/j.asoc.2023.110884. and designs encoding and decoding rules. A regional division [9] T. Zhou, D. Tang, H. Zhu, and Z. Zhang, \"Multi-agent\nstrategy is designed in the HRPEO, which can not only guide reinforcement learning for online scheduling in smart\nthe exploitation of HRPEO based on historical solutions, but\n=== 페이지 13 ===\nfactories,\" Robot. Comput.-Integr. Manuf., vol. 72, p. 102202, Optimization,\"Evol.Comput.,vol.10,no.3,pp.207-234,2002,\n2021,doi:https://doi.org/10.1016/j.rcim.2021.102202. doi:10.1162/106365602760234081. [10]Y. Linetal.,\"MLATSO: Amethodfortask scheduling [23]S.W.Mahfoud,\"CrowdingandPreselectionRevisited,\"\noptimization in multi-load AGVs-based systems,\" Robot. inParallelProblemSolvingfromNature,1992. Comput.-Integr. Manuf., vol.",
      "size": 898,
      "sentences": 15
    },
    {
      "id": 81,
      "content": "thodfortask scheduling [23]S.W.Mahfoud,\"CrowdingandPreselectionRevisited,\"\noptimization in multi-load AGVs-based systems,\" Robot. inParallelProblemSolvingfromNature,1992. Comput.-Integr. Manuf., vol. 79, p. 102397, 2023, doi: [24]X.YinandN.Germay,\"AFastGeneticAlgorithmwith\nhttps://doi.org/10.1016/j.rcim.2022.102397. Sharing Scheme Using Cluster Analysis Methods in\n[11] T. Jiang, H. Zhu, L. Liu, and Q. Gong, \"Energy- MultimodalFunctionOptimization,\",1993.\nconscious flexible job shop scheduling problem considering [25] W. Z., G. W., L. G., and Z. Q., \"A Penalty-Based\ntransportation time and deterioration effect simultaneously,\" Differential Evolution for Multimodal Optimization,\" IEEE T.\nSustainable Computing: Informatics and Systems, vol. 35, p. Cybern., vol. 52, no. 7, pp. 6024-6033, 2022, doi:\n100680, 2022, doi: 10.1109/TCYB.2021.3117359. https://doi.org/10.1016/j.suscom.2022.100680.",
      "size": 897,
      "sentences": 12
    },
    {
      "id": 82,
      "content": "tainable Computing: Informatics and Systems, vol. 35, p. Cybern., vol. 52, no. 7, pp. 6024-6033, 2022, doi:\n100680, 2022, doi: 10.1109/TCYB.2021.3117359. https://doi.org/10.1016/j.suscom.2022.100680. [26] J. W. Z. et al., \"Automatic Niching Differential\n[12] A. Ham, \"Transfer-robot task scheduling in flexible job Evolution With Contour Prediction Approach for Multimodal\nshop,\"J.Intell.Manuf.,no.3,2020. Optimization Problems,\" IEEE Trans. Evol. Comput., vol. 24,\n[13] A. Amirteimoori, E. B. Tirkolaee, V. Simic, and G. no.1,pp.114-128,2020,doi:10.1109/TEVC.2019.2910721. Weber, \"A parallel heuristic for hybrid job shop scheduling [27] X. H. et al., \"A Reinforcement-Learning-Based\nproblem considering conflict-free AGV routing,\" Swarm Evol. Evolutionary Algorithm Using Solution Space Clustering For\nComput., vol. 79, p. 101312, 2023, doi: Multimodal Optimization Problems,\" in 2021 IEEE Congress\nhttps://doi.org/10.1016/j.swevo.2023.101312. onEvolutionaryComputation(CEC),2021,pp.1938-1945.",
      "size": 995,
      "sentences": 16
    },
    {
      "id": 83,
      "content": "ing For\nComput., vol. 79, p. 101312, 2023, doi: Multimodal Optimization Problems,\" in 2021 IEEE Congress\nhttps://doi.org/10.1016/j.swevo.2023.101312. onEvolutionaryComputation(CEC),2021,pp.1938-1945. [14]Q.L. J.etal.,\"AHybridIteratedGreedyAlgorithmfor [28] Q. Liu, S. Du, B. J. van Wyk, and Y. Sun, \"Double-\na Crane Transportation Flexible Job Shop Problem,\" IEEE layer-clustering differential evolution multimodal optimization\nTrans. Autom. Sci. Eng., vol. 19, no. 3, pp. 2153-2170, 2022, by speciation and self-adaptive strategies,\" Inf. Sci., vol. 545,\ndoi:10.1109/TASE.2021.3062979. pp. 465-486, 2021, doi:\n[15] Y. Yao, X. Li, and L. Gao, \"A DQN-based memetic https://doi.org/10.1016/j.ins.2020.09.008. algorithm for energy-efficient job shop scheduling problem [29] J. Wang, C. Li, S. Zeng, and S. Yang, \"History-Guided\nwith integrated limited AGVs,\" Swarm Evol. Comput., vol. 87, Hill Exploration for Evolutionary Computation,\" IEEE Trans.",
      "size": 945,
      "sentences": 19
    },
    {
      "id": 84,
      "content": "scheduling problem [29] J. Wang, C. Li, S. Zeng, and S. Yang, \"History-Guided\nwith integrated limited AGVs,\" Swarm Evol. Comput., vol. 87, Hill Exploration for Evolutionary Computation,\" IEEE Trans. p. 101544, 2024, doi: Evol.Comput.,vol.27,pp.1962-1975,2023. https://doi.org/10.1016/j.swevo.2024.101544. [30] Y. Y. et al., \"A Novel Mathematical Model for the\n[16] D. B. M. M. Fontes, S. M. Homayouni, and J. C. Flexible Job-Shop Scheduling Problem With Limited\nFernandes,\"Energy-efficientjobshopschedulingproblemwith Automated Guided Vehicles,\" IEEE Trans. Autom. Sci. Eng.,\ntransportresourcesconsideringspeedadjustableresources,\"Int. pp.1-14,2024,doi:10.1109/TASE.2024.3356255. J.Prod.Res.,vol.62,pp.867-890,2023. [31] M. Preuss, \"Niching the CMA-ES via nearest-better\n[17] Y. Li, W. Gu, M. Yuan, and Y. Tang, \"Real-time data- clustering,\"inAnnualConferenceonGeneticandEvolutionary\ndriven dynamic scheduling for flexible job shop with Computation,2010.",
      "size": 954,
      "sentences": 12
    },
    {
      "id": 85,
      "content": "nearest-better\n[17] Y. Li, W. Gu, M. Yuan, and Y. Tang, \"Real-time data- clustering,\"inAnnualConferenceonGeneticandEvolutionary\ndriven dynamic scheduling for flexible job shop with Computation,2010. insufficient transportation resources using hybrid deep Q [32] G. Zhang, L. Gao, and Y. Shi, \"An effective genetic\nnetwork,\" Robot. Comput.-Integr. Manuf., vol. 74, p. 102283, algorithm for the flexible job-shop scheduling problem,\"\n2022,doi:https://doi.org/10.1016/j.rcim.2021.102283. Expert Syst. Appl., vol. 38, no. 4, pp. 3563-3573, 2011, doi:\n[18] Q. Gao, F. Gu, L. Li, and J. Guo, \"A framework of https://doi.org/10.1016/j.eswa.2010.08.145. cloud-edge collaborated digital twin for flexible job shop [33]K.L.T.,P.C.Y.,andH.C.J.,\"SolvingDistributedand\nscheduling with conflict-free routing,\" Robot. Comput.-Integr. Flexible Job-Shop Scheduling Problems for a Real-World\nManuf., vol. 86, p. 102672, 2024, doi: Fastener Manufacturer,\" IEEE Access, vol. 2, pp.",
      "size": 961,
      "sentences": 15
    },
    {
      "id": 86,
      "content": "ling with conflict-free routing,\" Robot. Comput.-Integr. Flexible Job-Shop Scheduling Problems for a Real-World\nManuf., vol. 86, p. 102672, 2024, doi: Fastener Manufacturer,\" IEEE Access, vol. 2, pp. 1598-1606,\nhttps://doi.org/10.1016/j.rcim.2023.102672. 2014,doi:10.1109/ACCESS.2015.2388486. [19] Y. Hu, H. Yang, and Y. Huang, \"Conflict-free [34] M. L. K., Y. T., and L. Keon-Myung, \"A genetic\nscheduling of large-scale multi-load AGVs in material algorithm for general machine scheduling problems,\" in 1998\ntransportation network,\" Transportation Research Part E: SecondInternationalConference.Knowledge-BasedIntelligent\nLogistics and Transportation Review, vol. 158, p. 102623, Electronic Systems. Proceedings KES'98 (Cat. No.98EX111),\n2022,doi:https://doi.org/10.1016/j.tre.2022.102623. 1998,pp.60-66.",
      "size": 805,
      "sentences": 12
    },
    {
      "id": 87,
      "content": "BasedIntelligent\nLogistics and Transportation Review, vol. 158, p. 102623, Electronic Systems. Proceedings KES'98 (Cat. No.98EX111),\n2022,doi:https://doi.org/10.1016/j.tre.2022.102623. 1998,pp.60-66. [20]Q.Dang,N.Singh,I.Adan,T.Martagan,andD.vande [35] F. Liu, G. Li, C. Lu, L. Yin, and J. Zhou, \"A tri-\nSande, \"Scheduling heterogeneous multi-load AGVs with individual iterated greedy algorithm for the distributed hybrid\nbattery constraints,\" Comput. Oper. Res., vol. 136, p. 105517, flow shop with blocking,\" Expert Syst. Appl., vol. 237, p.\n2021,doi:https://doi.org/10.1016/j.cor.2021.105517. 121667,2024,doi:https://doi.org/10.1016/j.eswa.2023.121667. [21]R.Yan,L.Jackson,andS.Dunnett,\"Astudyforfurther [36] L. Deroussi and S. Norre, \"Simultaneous scheduling of\nexploringthe advantagesofusing multi-loadautomatedguided machines and vehicles for the flexible job shop problem,\",\nvehicles,\" J. Manuf. Syst., vol. 57, pp. 19-30, 2020, doi: 2010.\nhttps://doi.org/10.1016/j.jmsy.2020.08.005.",
      "size": 990,
      "sentences": 16
    },
    {
      "id": 88,
      "content": "using multi-loadautomatedguided machines and vehicles for the flexible job shop problem,\",\nvehicles,\" J. Manuf. Syst., vol. 57, pp. 19-30, 2020, doi: 2010.\nhttps://doi.org/10.1016/j.jmsy.2020.08.005. [37] R. C. V. Nostrand, \"Design of Experiments Using the\n[22] L. J., E. B. M., T. P. G., and J. C. P., \"A Species Taguchi Approach: 16 Steps to Product and Process\nConserving Genetic Algorithm for Multimodal Function Improvement,\"Technometrics,vol.44,p.289,2002. === 페이지 14 ===\n[38] K. Wang, W. Gong, L. Deng, and L. Wang,\n\"Multimodal optimization via dynamically hybrid niching\ndifferential evolution,\" Knowledge-Based Syst., vol. 238, p.\n107972, 2022, doi:\nhttps://doi.org/10.1016/j.knosys.2021.107972. [39] X. B. et al., \"Simultaneous Scheduling of Processing\nMachines and Automated Guided Vehicles via a Multi-View\nModeling-Based Hybrid Algorithm,\" IEEE Trans. Autom. Sci. Eng., vol. 21, no. 3, pp. 4753-4767, 2024, doi:\n10.1109/TASE.2023.3301656.",
      "size": 951,
      "sentences": 15
    },
    {
      "id": 89,
      "content": "Processing\nMachines and Automated Guided Vehicles via a Multi-View\nModeling-Based Hybrid Algorithm,\" IEEE Trans. Autom. Sci. Eng., vol. 21, no. 3, pp. 4753-4767, 2024, doi:\n10.1109/TASE.2023.3301656. [40]L.He,R.Chiong,W.Li,G.S.Budhi,andY.Zhang,\"A\nmultiobjective evolutionary algorithm for achieving energy\nefficiency in production environments integrated with multiple\nautomated guided vehicles,\" Knowledge-Based Syst., vol. 243,\np. 108315, 2022, doi:\nhttps://doi.org/10.1016/j.knosys.2022.108315. [41] P. Z., W. L., Z. J., F. C. J., and W. X., \"A Learning-\nBased Multipopulation Evolutionary Optimization for Flexible\nJob Shop Scheduling Problem With Finite Transportation\nResources,\" IEEE Trans. Evol. Comput., vol. 27, no. 6, pp. 1590-1603,2023,doi:10.1109/TEVC.2022.3219238.",
      "size": 778,
      "sentences": 15
    }
  ]
}