{
  "source": "ArXiv",
  "filename": "037_Resource_Allocation_with_Stability_Constraints_of_.pdf",
  "total_chars": 30132,
  "total_chunks": 44,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nResource Allocation with Stability Constraints of an\nEdge-cloud controlled AGV\nShreya Tayade∗, Peter Rost†, Andreas Maeder‡ and Hans D. Schotten§\n∗Intelligent Networks Research Group, German Research Center for Artificial Intelligence, Kaiserslautern, Germany\nEmail: {Shreya.Tayade, Hans Dieter.Schotten} @dfki.de\n†Communications Engineering Lab, Karlsruhe Institute of Technology, Germany\nEmail: peter.rost@kit.edu\n‡Nokia Bell Labs, Munich, Germany\nEmail: andreas.maeder@nokia-bell-labs.com\n§ Wireless Communication and Navigation, Technical University of Kaiserslautern, Germany\nEmail: schotten@eit.uni-kl.de\nAbstract—The paper proposes Resource Allocation (RA) ofcontrolcommandsalsoknownasAgeofInformation(AoI)\nschemes for a closed loop feedback control system by analysing [3], [4]. A fading channel may cause consecutive control\nthe control-communication dependencies.",
      "size": 887,
      "sentences": 2
    },
    {
      "id": 2,
      "content": "ommandsalsoknownasAgeofInformation(AoI)\nschemes for a closed loop feedback control system by analysing [3], [4]. A fading channel may cause consecutive control\nthe control-communication dependencies. We consider an Auto-\npacketlosshenceincreasingtheAoIasthecontrolinformation\nmatedGuidedVehicle(AGV)thatcommunicateswithacontroller\nwill be outdated. Therefore, the channel quality is crucial to\nlocated in an edge-cloud over a wireless fading channel. The\ncontrol commands are transmitted to an AGV and the position maintain the stability of an AGV. stateisfeedbacktothecontrollerateverytime-instant.Acontrol Additionally, in an industrial control short packets are\nstability based scheduling metric ’Probability of Instability’ is transmittedbetweenthecontrollersandactuatorseitherperiod-\nevaluatedfortheresourceallocation.Theperformanceofstability\nically or are event-triggered.",
      "size": 879,
      "sentences": 6
    },
    {
      "id": 3,
      "content": "scheduling metric ’Probability of Instability’ is transmittedbetweenthecontrollersandactuatorseitherperiod-\nevaluatedfortheresourceallocation.Theperformanceofstability\nically or are event-triggered. The error probability to transmit\nbased RA scheme is compared with the maximum SNR based\nshort packets is higher due to finite-block length. High error\nRA scheme and control error first approach in an overloaded\nand non-overloaded scenario. The RA scheme with the stability probabilitymaycauseinstabilityduetolossofcontrolpackets\nconstraints significantly reduces the resource utilization and is that leads to higher AoI. The stability of control system is\nable to schedule more number of AGVs while maintaining its significantly dependent on the channel condition, and control\nstability. Moreover, the proposed RA scheme is independent\npacket transmission strategies.",
      "size": 867,
      "sentences": 6
    },
    {
      "id": 4,
      "content": "dule more number of AGVs while maintaining its significantly dependent on the channel condition, and control\nstability. Moreover, the proposed RA scheme is independent\npacket transmission strategies. The control packet transmitted\nof control state and depends upon consecutive packet errors,\nwithlowerModulationandCodingScheme(MCS),withmore\nthe control parameters like sampling time and AGV velocity. Furthermore, we also analyse the impact of RA schemes on radioresourceswillreducetheerrorprobabilityandcanretain\nthe AGV’s stability and error performance, and evaluated the stability. However, allocating more resources than required to\nnumber of unstable AGVs. maintain the stability may cause resource wastage. Therefore,\nthe control aware RA techniques should be adopted to ef-\nI. INTRODUCTION\nficiently utilize resources.",
      "size": 826,
      "sentences": 8
    },
    {
      "id": 5,
      "content": "equired to\nnumber of unstable AGVs. maintain the stability may cause resource wastage. Therefore,\nthe control aware RA techniques should be adopted to ef-\nI. INTRODUCTION\nficiently utilize resources. The traditional RA strategies like\nIntroduction of tactile internet have initiated use-cases like proportionalfair,RoundRobinandmaximumSNRfocuseson\ntele-surgery and tele-medicine in E-health sector, Machine to maximizingthedataratesbyconsideringthewirelesschannel\nMachine (M2M), Human to Machine (H2M) communication quality,andprovidingfairness.However,forindustrialcontrol\nin the automation industry and self driving cars in automotive the stability and control state error is the priority as to the\nindustry. The tactile internet applications are driven by closed system throughput. Therefore, new control aware scheduling\nloopfeedbackcontrolsthathavestringentlatencyrequirements metrics must be evaluated to maintain control system stability\nconstituting the Round Trip Time (RTT) to 1ms [1].",
      "size": 995,
      "sentences": 7
    },
    {
      "id": 6,
      "content": "new control aware scheduling\nloopfeedbackcontrolsthathavestringentlatencyrequirements metrics must be evaluated to maintain control system stability\nconstituting the Round Trip Time (RTT) to 1ms [1]. The and efficiently use the resources. promising solution to support growing demands of reliability 1\nand ultra low latency for a real-time feedback control is\nan Edge cloud. Edge cloud enables computation of complex A. Related work\nprocessing at the edge unlike the centralized cloud, hence\nChannelawareencoding-decodingstrategiestomitigatethe\nreducing the latency [2]. effect of noisy and lossy communication link are proposed\nMoreover, unlike conventional cellular communication,\nin [5]. The impact of packet error rate, delay, channel noise\nwhere the throughput, data rate are the Key Performance\nand lossy communication links on the performance of control\nIndicators (KPI), the performance of control application is\nsystem is studied in [5]–[12].",
      "size": 951,
      "sentences": 7
    },
    {
      "id": 7,
      "content": "he throughput, data rate are the Key Performance\nand lossy communication links on the performance of control\nIndicators (KPI), the performance of control application is\nsystem is studied in [5]–[12]. The research in [13] focuses on\ndetermined with the stability and control state error. In an\nedge cloud based Wireless Network Control System (WNCS)\nthecontrollersendsthecontrolcommandsviadownlinkwire- 1This is a preprint, the full paper has been published in 27th VDE ITG\nEuropeanWirelessConference,©2022VDE.Personaluseofthismaterialis\nless channel and receives the state feedback via uplink. The\npermitted. However, permission to use this material for any other purposes\nstability and control state error depends up on the freshness mustbeobtainedfromtheITGVDEsocietyatitg@vde.com\n3202\nnaJ\n32\n]YS.ssee[\n1v88390.1032:viXra\n=== 페이지 2 ===\nFig.1. SystemModel\nevaluation of control aware optimal coding rate for transmis- AGV in the downlink.",
      "size": 939,
      "sentences": 6
    },
    {
      "id": 8,
      "content": "eobtainedfromtheITGVDEsocietyatitg@vde.com\n3202\nnaJ\n32\n]YS.ssee[\n1v88390.1032:viXra\n=== 페이지 2 ===\nFig.1. SystemModel\nevaluation of control aware optimal coding rate for transmis- AGV in the downlink. The control command consists of an\nsion that increases resource efficiency. Few control aware RA instantaneous velocity and acceleration for driving an AGV\nschemesarealsoproposedin[9],[10],[14]–[18].Apromising on the desired reference track. The desired reference track\ncontrolstateawareRAformulti-connectivityisalsopresented X = (x (k),y (k),θ (k)) is determined at every time\nr,i r,i r,i r,i\nin[17]toincreasestheavailability.Theauthorsin[16]present step k, where (x ,y ) represents the position coordinates and\nr r\nthe comparison of control aware scheduling metrics for RA θ is the orientation of an AGV. The actual track that AGV\nr\nof an Linear Time Invariant (LTI) control system in the follows is represented by X (k) = (x (k),y (k),θ (k)). c,i c,i c,i c,i\nUplink.",
      "size": 969,
      "sentences": 7
    },
    {
      "id": 9,
      "content": "r RA θ is the orientation of an AGV. The actual track that AGV\nr\nof an Linear Time Invariant (LTI) control system in the follows is represented by X (k) = (x (k),y (k),θ (k)). c,i c,i c,i c,i\nUplink. A network induced error and the predicted control The subscript r represent reference position and c represents\nerror first approach is compared with the traditional control current AGV position of ith AGV at kth time-instant. An\nerrorfirstapproach[10].Thepredictedcontrolerrorapproach, AGV attainsnew position X (k+1) on applying thecontrol\nc,i\npredicts the control error with control system parameters and commands as\nis independent of time and network errors. Therefore, the\nX (k+1)=X (k)+T ·J(k)·u (k) (1)\nscheduler is only applicable for LTI system, however, in c,i c,i s i\npractice the control loops are often complex, time-varying, where J(k) is transformation matrix. The attained position of\nnon-linear and in-homogeneous in nature.",
      "size": 941,
      "sentences": 7
    },
    {
      "id": 10,
      "content": "LTI system, however, in c,i c,i s i\npractice the control loops are often complex, time-varying, where J(k) is transformation matrix. The attained position of\nnon-linear and in-homogeneous in nature. an AGV X (k+1), is feedback to the controller via uplink\nc,i\nchannel.Theerror(cid:15) isevaluatedasthedeviationofanAGV\nB. Contribution and outline of the paper i,k\nfrom the reference track as shown in Fig. 1. The controller\nInthispaperweproposethecontrolawareRAschemesfor generates new control commands u (k+1) corresponding to\ni\na non-linear pragmatic edge cloud based AGV control system the error (cid:15) . For the sake of brevity an uplink channel is\ni,k\nand investigate its stability performance. The probability of assume to be perfect. The details about controller is described\ninstability is evaluated considering the channel conditions and in [19]–[21]. controlsystemstability.Wecomparecontrolawarescheduling\nmetrics with the conventional SNR as scheduling metric.",
      "size": 972,
      "sentences": 10
    },
    {
      "id": 11,
      "content": "described\ninstability is evaluated considering the channel conditions and in [19]–[21]. controlsystemstability.Wecomparecontrolawarescheduling\nmetrics with the conventional SNR as scheduling metric. A B. Communication system\ncontrol and communication system model is presented in AGVs are uniformly distributed in a circular area of radius\nsection II. The MCS selection and resource allocation to r fromanedge-cloud.Thecontrolcommandu isrepresented\ni\ntransmit the control packet is described in section II-C. The by D data bits at every scheduling time instant T . The\ni s\ncontrol aware scheduling metric and the proposed resource sampling time of control system is assumed to be same as the\nallocation algorithm are presented in III and IV respectively. schedulingtimeinstant.ARayleighfadingchannelwithpath-\nTheresultsandconclusionsarediscussedinsectionVandVI loss exponent β is considered for downlink communication. respectively.",
      "size": 932,
      "sentences": 8
    },
    {
      "id": 12,
      "content": "and IV respectively. schedulingtimeinstant.ARayleighfadingchannelwithpath-\nTheresultsandconclusionsarediscussedinsectionVandVI loss exponent β is considered for downlink communication. respectively. At every time instant the distance d of an AGV from the\ni,k\nedge cloud is evaluated. The received SNR γ is known\nII. SYSTEMMODEL i,k\nconsidering the path-loss and time correlated channel as\nA. AGV control system\n(cid:18) λ (cid:19)2 (cid:18) d (cid:19)β |h |2\nThe system consists of AGVs controlled by an edge- γ =P × × 0 i,k (2)\ni,k tx 4πd d N BW\ncloud based independent controllers C , where i = 1···N 0 i,k o\ni\nrepresents the ith AGV as shown in Fig. 1.",
      "size": 655,
      "sentences": 7
    },
    {
      "id": 13,
      "content": "|2\nThe system consists of AGVs controlled by an edge- γ =P × × 0 i,k (2)\ni,k tx 4πd d N BW\ncloud based independent controllers C , where i = 1···N 0 i,k o\ni\nrepresents the ith AGV as shown in Fig. 1. The controller where P is the transmit power, d is the reference distance,\ntx 0\nC generate control command u (k) at kth time-step at an d is the distance between the ith AGV and an edge cloud\ni i i,k\ninterval of control system sampling time T , and is sent to an at kth time-step, h is the channel gain, λ is the wavelength\ns i,k\n=== 페이지 3 ===\ncorresponding to carrier frequency and N\no\nis the noise. The III.",
      "size": 609,
      "sentences": 4
    },
    {
      "id": 14,
      "content": "f control system sampling time T , and is sent to an at kth time-step, h is the channel gain, λ is the wavelength\ns i,k\n=== 페이지 3 ===\ncorresponding to carrier frequency and N\no\nis the noise. The III. METRICSFORRESOURCEALLOCATION\nAGVs are scheduled on the available bandwidth BW for\nThe resource allocation schemes for cellular networks fo-\ndownlink communication that corresponds to N , the total\nRB cusesonincreasingthesystemthroughputandfairness,hence,\nnumber of Resource Blocks (RBs) per T and N is the\ns rb,i more resources are allocated to the user with maximum SNR,\nnumber of RBs allocated to an ith AGV at every scheduling\nsimultaneously ensuring fairness. In industrial control the\ntime instant. The Modulation and Coding Scheme (MCS) is\nstability and the control error are crucial factors as compared\nselected at every T to encode the D data bits with Coding\ns i to the throughput, considering the short data packet size.",
      "size": 930,
      "sentences": 5
    },
    {
      "id": 15,
      "content": "cheme (MCS) is\nstability and the control error are crucial factors as compared\nselected at every T to encode the D data bits with Coding\ns i to the throughput, considering the short data packet size. In\nrateR andmodulationschemeM .TheerrorprobabilityPi,k\ni i e ordertomaintainthestabilityofAGVs,wepresentthecontrol\nis\ndependent scheduling metrics for allocating resources. Pi,k =f(γ ,R ,M ), (3)\ne i,k i i A. Maximum control error\nand depends on the γ i,k and the selected MCS scheme. In this RA scheme, the RBs are allocated considering the\nThe expected error probability for ith AGV will vary with control error. The control error (cid:15) in AGV system is the\ni,k\nthe modulation and coding scheme. For constant MCS, the deviationofith AGVfromthereferencetrackX (k)attime\nr,i\nexpected error probability is step k. The maximum deviation of an AGV allowed from its\ndesired reference path is the error threshold (cid:15) .",
      "size": 921,
      "sentences": 7
    },
    {
      "id": 16,
      "content": "deviationofith AGVfromthereferencetrackX (k)attime\nr,i\nexpected error probability is step k. The maximum deviation of an AGV allowed from its\ndesired reference path is the error threshold (cid:15) . The error\nth\n(cid:90) ∞ at every time-step should be less than the error threshold i.e. E {Pi(R ,M )}= Pi(γ ,R ,M )f (γ )dγ , (4)\nγ e i i e i i i γi i i (cid:15)\ni,k\n<(cid:15)\nth\n. The error is evaluated as\n0\n(cid:113)\nwhere f γi (γ i ) is the PDF for SNR of i-th AGV given as (cid:15)\ni,k\n= (X\nr,i\n(k)−X\nc,i\n(k))2+(Y\nr,i\n(k)−Y\nc,i\n(k))2. (11)\nγ =|h |2γ (5)\ni i b,i In this resource allocation scheme, the AGV with maximum\n1 (cid:16)−γi (cid:17) control error is given the priority and more resources are\nf\nγi\n=\nγ\ne γb,i (6)\nallotted to successfully transmit the control packet in the\nb,i\n(cid:16) (cid:17)2 (cid:16) (cid:17)β current scheduling time instant.",
      "size": 858,
      "sentences": 5
    },
    {
      "id": 17,
      "content": "is given the priority and more resources are\nf\nγi\n=\nγ\ne γb,i (6)\nallotted to successfully transmit the control packet in the\nb,i\n(cid:16) (cid:17)2 (cid:16) (cid:17)β current scheduling time instant. γ = P tx × 4π λ d0 × d d i, 0 k (7) The priority user is\nb,i N BW\no\nPriority User=min|(cid:15) −(cid:15) |, (12)\nth i,k\nThe success or failure of current transmission is identified i\nbyδ i,k .Theδ i,k determinesthenumberofconsecutivepacket and the control error is independent of channel conditions. It\nlosses in the past, for ith AGV at kth timestep. is evaluated from the position feedback received by the edge\ncloud controller in the uplink. δ i,k =0 Successful Transmission B. Maximum SNR\nδ =δ +1 Unsuccessful Transmission (8)\ni,k i,k−1 In this RA scheme the objective is to maximize the overall\nsystem throughput.",
      "size": 818,
      "sentences": 6
    },
    {
      "id": 18,
      "content": "controller in the uplink. δ i,k =0 Successful Transmission B. Maximum SNR\nδ =δ +1 Unsuccessful Transmission (8)\ni,k i,k−1 In this RA scheme the objective is to maximize the overall\nsystem throughput. The AGV with maximum SNR is given\nδ representstheAoIofcontrolpacketsinthedownlinkasit\npriority for successful downlink transmission and higher data\ndetermines the number of consecutive control commands not\nrates.TheRAisindependentofthecontrolsystemparameters\nsuccessfully received by an AGV. like control error and stability of an AGV. More resources are\nC. Resource allocation and MCS selection allocated to an AGV with higher SNR as\nThe MCS selection depends upon the allocated RBs for\ntransmission in a resource limited regime. We assume a LTE\nPriority User=max γ . (13)\ni,k\nresource grid with each RB consisting of 12 sub-carriers and i\n7 OFDM symbols.",
      "size": 856,
      "sentences": 8
    },
    {
      "id": 19,
      "content": "nds upon the allocated RBs for\ntransmission in a resource limited regime. We assume a LTE\nPriority User=max γ . (13)\ni,k\nresource grid with each RB consisting of 12 sub-carriers and i\n7 OFDM symbols. If N rb,i is the amount of RBs allocated to C. Probability of instability\nith AGV and M is the modulation scheme, the permissible\ni The AGV is unstable if δ > n , where n is the\ncoding rate is i,k max max\nmaximum number of consecutive packet loss that an AGV\nR = D i . (9) control system can sustain without being unstable [19]. The\ni 12×7×N ×log (M ) stability of an AGV depends upon δ , higher the number of\nrb,i 2 i i,k\nconsecutive packet error, higher is the probability of an AGV\nTherefore,thecontrolpacketofsizeD bitscanbeencoded\ni becoming unstable. If an AGV transmits with constant MCS\nwithcodingrateR formodulationschemeM ,iftheallocated\ni i scheme, the probability of n consecutive packet error Pi\nRBs N is max us\nrb,i for ith AGV can be evaluated as\nD\nN ≥(cid:100) i (cid:101).",
      "size": 989,
      "sentences": 7
    },
    {
      "id": 20,
      "content": "MCS\nwithcodingrateR formodulationschemeM ,iftheallocated\ni i scheme, the probability of n consecutive packet error Pi\nRBs N is max us\nrb,i for ith AGV can be evaluated as\nD\nN ≥(cid:100) i (cid:101). (10)\nrb,i 12×7×log (M )×R\n2 i i Pi (1,··· ,n )=Pnmax−1×E {Pi(R ,M )} (14)\nus max bb γ e i i\n=== 페이지 4 ===\nwhere P is (back-back error probability), low threshold error probability for successful transmission. bb\nHowever, some control loops can maintain the stability even\n1−E {Pi(R ,M )}\nP = γ e i i [Q(θ,ρθ)−Q(ρθ,θ)]], (15) with lower reliability, therefore stringent constraints on Pth\nbb E {Pi(R ,M )} e\nγ e i i may result in to inefficient resource utilization. Moreover, as\nwhere the reliability requirements vary for different control systems,\n(cid:115) we impose constraints on its stability, i.e. the Pi,k ≤ 10−9. θ = −2log(1−E γ {P e i(R i ,M i )}) , (16) Therefore,weevaluatetheinter-dependenciesbetw u e s entheP e th\n1−ρ2\nand stability of the system.",
      "size": 961,
      "sentences": 6
    },
    {
      "id": 21,
      "content": "impose constraints on its stability, i.e. the Pi,k ≤ 10−9. θ = −2log(1−E γ {P e i(R i ,M i )}) , (16) Therefore,weevaluatetheinter-dependenciesbetw u e s entheP e th\n1−ρ2\nand stability of the system. The probability of instability for\nρ=J 0 (2πf d T s ), (17) ith AGV is evaluated from (19). As the δ i,k increases, less\nnumberofattemptsarelefttosuccessfullytransmitthecontrol\nand P e i is the average block error probability that depends packet, hence Pi,k is high. Moreover if Pi is high, i.e. higher\nus e\nupon MCS scheme. MCS scheme selected, then higher is the Pi,k. Therefore, we\nus\nThevalueofδ i,k ,determinesthenumberoffutureopportu- evaluate the Pth, for every AGV at every scheduling time\ne\nnitiesstillavailabletosuccessfullytransmitthecontrolpacket\ninstant so that the optimal MCS scheme is selected such that\nto prevent instability. The control packet must be successfully Pi,k(n −δ )≤10−9. us max i,k\nreceived within next (n max −δ i,k ) transmissions.",
      "size": 964,
      "sentences": 11
    },
    {
      "id": 22,
      "content": "t so that the optimal MCS scheme is selected such that\nto prevent instability. The control packet must be successfully Pi,k(n −δ )≤10−9. us max i,k\nreceived within next (n max −δ i,k ) transmissions. If δ i,k =0, The Pth is\ne\nn future opportunities are available to successfully trans-\nmax\nPth ={E {Pi(R ,M )}|Pi,k(n −δ )≤10−9},\nmit the packet. The higher the value of δ i,k , few transmission e γ e i i us max i,k\n(22)\nopportunities are available. The AGV is unstable if the next\n(n −δ ) transmission fails. MCS (M ,R )={MCS(M,R)|Pi(γ ,R ,M )<Pth}. max i,k i i i e i,k i i e\nThe probability of instability is therefore the probability of (23)\nn −δ consecutive packet error\nmax i,k The Pth is numerically evaluated for varying value of δ . e i,k\nP u i, s k =P u i s (1,··· ,n max −δ i,k ) (18) P e th decrease if δ i,k increases, as the AGV requires higher\nPi,k =P nmax−δi,k−1 ×E {Pi(R ,M )}, (19) reliability for packet transmission.",
      "size": 934,
      "sentences": 9
    },
    {
      "id": 23,
      "content": "δ . e i,k\nP u i, s k =P u i s (1,··· ,n max −δ i,k ) (18) P e th decrease if δ i,k increases, as the AGV requires higher\nPi,k =P nmax−δi,k−1 ×E {Pi(R ,M )}, (19) reliability for packet transmission. The AGV can tolerate\nus bb γ e i i few more packet loss if δ = 0 hence the packet can\ni,k\nwhere δ is the measure of consecutive block error up to be transmitted with higher MCS scheme, i.e. less resource\ni,k\nk −1 time-step evaluated in (8). In this resource allocation consumption. scheme, the AGV that has higher consecutive block error i.e. B. Algorithm\nhigher probability of instability is given the priority as\nThe AGVs arrive with Poisson process and are active for\nPriority User=max Pi,k. (20) certain time period to trace the desired reference track X . us r,i\ni\nTheRAalgorithmassignsRBsateveryschedulingtimeinstant\nIV. PROPOSEDRESOURCEALLOCATION k, for all N active AGVs. The error probability is evaluated\nA.",
      "size": 916,
      "sentences": 11
    },
    {
      "id": 24,
      "content": "d to trace the desired reference track X . us r,i\ni\nTheRAalgorithmassignsRBsateveryschedulingtimeinstant\nIV. PROPOSEDRESOURCEALLOCATION k, for all N active AGVs. The error probability is evaluated\nA. Error probability threshold and instability assuming the RBs are equally distributed with Pth = 10−3. e\nTheschedulingmetricisevaluatedforalltheactiveAGVsand\nThe stability of an AGV depends upon the number of\na priority user is chosen. The proposed Pi,k based approach\nconsecutive packet errors [19]. If the control packets are us\nevaluatestheprobabilityofinstabilitybasedontheconsecutive\ntransmitted with higher frequency in the downlink, i.e. with\npacket losses. The AGV that has highest Pi,k is selected as\nlowersamplingtime,thechannelcorrelationishigherovertwo us\npriority AGV and Pth is chosen according to (22). The\nconsecutive transmission.",
      "size": 846,
      "sentences": 11
    },
    {
      "id": 25,
      "content": "h\npacket losses. The AGV that has highest Pi,k is selected as\nlowersamplingtime,thechannelcorrelationishigherovertwo us\npriority AGV and Pth is chosen according to (22). The\nconsecutive transmission. If the channel correlation is higher, e\nMCS scheme is selected such that the the error probability\nmore is the probability of back to back failure, hence higher\nfor transmitting the current packet is below Pth. The number\nis the probability of instability. e\nof RBs required to transmit the packet with selected MCS\nFurthermore, the expected block error probability is higher\nscheme is allocated to the priority AGV. The error probability\nif higher MCS scheme is selected. The probability of insta-\nis updated with current MCS scheme and δ is evaluated. If\nbility is the probability of n consecutive packet failure, i,k\nmax\nno RBs are available for allocation i.e. (cid:80)N\nN = N ,\ngiven δ i,k = 0.",
      "size": 899,
      "sentences": 10
    },
    {
      "id": 26,
      "content": "s updated with current MCS scheme and δ is evaluated. If\nbility is the probability of n consecutive packet failure, i,k\nmax\nno RBs are available for allocation i.e. (cid:80)N\nN = N ,\ngiven δ i,k = 0. Therefore, if block error probability is high thePi,k =1.Thecontrolcommandsarethen i= a 1 ppli r e b d ,i toAG R V B ’s\nthe probability of instability will also increase as shown in e\nactuator depending on δ . If δ = 0, the current control\n(19).TheBlockErrorRate(BLER)fordifferentMCSscheme i,k i,k\ncommands are applied, else if δ > 0 the outdated control\nover SNR, for LTE is available in a lookup table. The MCS i,k\ncommands that were successfully received are applied. The\nscheme is selected such that the error probability is below the\nAGV attains new position and the error (cid:15) is evaluated, that\nthreshold error probability for every transmission as i,k\nis used to generate new control commands.",
      "size": 905,
      "sentences": 7
    },
    {
      "id": 27,
      "content": "e error probability is below the\nAGV attains new position and the error (cid:15) is evaluated, that\nthreshold error probability for every transmission as i,k\nis used to generate new control commands. MCS (M ,R )={MCS(M,R)|Pi(γ ,R ,M )<Pth},\ni i i e i,k i i e V. RESULTS\n(21)\n∀i=1···N, where Pth is the threshold error probability.",
      "size": 330,
      "sentences": 2
    },
    {
      "id": 28,
      "content": "every transmission as i,k\nis used to generate new control commands. MCS (M ,R )={MCS(M,R)|Pi(γ ,R ,M )<Pth},\ni i i e i,k i i e V. RESULTS\n(21)\n∀i=1···N, where Pth is the threshold error probability. A. Simulation setup and performance metrics\ne\nThe reliability requirement for closed loop control may AGVs arrive with a Poisson process with arrival rate of\nreach up to the order of 10−9, and hence requires extremely λ = {2e−3,3e−3,··· ,8e−3} and the service time for each\n=== 페이지 5 ===\nAlgorithm 1 P based resource allocation\nus\nInitialization:\nk=1, δ = 0, N =0; ∀i=1···N,\ni,k rb,i\nPth =10−3\ne\nEvaluate: Pi,k = f(γ ,MCS ) (cid:46) Equal allocation\ne i,k id\nfor (k =1→k ) do\nmax\nEvaluate: Pi (n −δ )∀i=1...N\nus max i,k\nfor i=1→N do\nif\n(cid:80)NN\n<N then (cid:46) RBs available\ni rb,i RB\nPriority AGV:\ni = arg max (Pi (n −δ ))\np us max i,k\ni=1...N\nEvaluate: Pth as in (22)\ne\nEvaluate: MCS scheme\n(M ,R ) according to (23)\nip ip Fig.2.",
      "size": 933,
      "sentences": 3
    },
    {
      "id": 29,
      "content": "(cid:80)NN\n<N then (cid:46) RBs available\ni rb,i RB\nPriority AGV:\ni = arg max (Pi (n −δ ))\np us max i,k\ni=1...N\nEvaluate: Pth as in (22)\ne\nEvaluate: MCS scheme\n(M ,R ) according to (23)\nip ip Fig.2. MeanResourceutilizationovervaryingAGVarrivalrateλ\nEvaluate: N (10) (cid:46) RBs required for\nrb,ip\n(M ip ,R ip ) b) Unstable AGVs: An AGV is unstable if the error at\nanytime-instantis abovetheerror threshold(cid:15) ≥(cid:15) ,where\ni,k th\nAssign N rb,ip RBs to priority AGV (cid:15) th =0.02m or the number of consecutive packet loss δ i,k ≥\nUpdate: P e ip,k = f(γ ip,k ,M ip ,R ip ) n max , where n max =10 [19]. else if\n(cid:80)N\ni N rb,i =N RB then c) SuccessfulAGVs: AnAGVissuccessfulifitisstable\nN\nrbi\n= 0 (cid:46) No RBs available andcompletesthetracksuchthatatanytime-instant(cid:15)\ni,k\n<(cid:15)\nth\nUpdate: Pi,k = 1 and δ <n . e i,k max\nend if\nend for\nB.",
      "size": 863,
      "sentences": 4
    },
    {
      "id": 30,
      "content": "lAGVs: AnAGVissuccessfulifitisstable\nN\nrbi\n= 0 (cid:46) No RBs available andcompletesthetracksuchthatatanytime-instant(cid:15)\ni,k\n<(cid:15)\nth\nUpdate: Pi,k = 1 and δ <n . e i,k max\nend if\nend for\nB. Resource utilization\nUpdate: δ , Pi,k,N ∀i=1...N\ni,k e rb,i\nAGV control and state evolution TheFig.2,showsthemeanresourceutilizationateverytime\nX (k+1)=X (k)+T ·J(k)·u (k−δ ) instantforvaryingarrivalratesofAGVs.Theresourceutiliza-\nc,i c,i s i i,k\nOutput: (cid:15) tionandtheperformanceoftheAGVisobservedunderanon-\ni,k\n(cid:46) Control error overloaded and an overloaded scenario. In a non-overloaded\nend for scenario, sufficient RBs are available for scheduling all the\nactive AGVs. The arrival rate λ is low and hence less number\nof AGVs are active at a given time instant, such that all the\nAGV is model with negative exponential with rate parameter active AGVs can be served with sufficient resources. On the\nµ = 4e−4.",
      "size": 921,
      "sentences": 6
    },
    {
      "id": 31,
      "content": "s number\nof AGVs are active at a given time instant, such that all the\nAGV is model with negative exponential with rate parameter active AGVs can be served with sufficient resources. On the\nµ = 4e−4. The Bandwidth of 1.4MHz is used for downlink contraryinanoverloadedcase,limitedresourcesareavailable\ntransmission with transmit power of 20dBm. The path-loss withmorenumberofactiveAGVsthanthesystemcanideally\nexponent β is 3, the AGVs are distributed within a distance support. of radius r = 1000 m. The information transmitted at every a) Non-overloaded system: The Fig. 2 shows the mean\ntime-step from an active AGV is 600 bits. Every time-step RU for different RA schemes that uses Pi,k, (cid:15) and γ as\nus i,k i,k\nis of 5ms, consisting of 5-subframes, and 60 RBs per time- the scheduling metric. The plot below λ < 6×10−3 shows\nstepforallocation(6RB/time-slot).Thesimulationisobserved the resource utilization in an non-overloaded case. The Pi,k\nus\nfor approx.",
      "size": 965,
      "sentences": 9
    },
    {
      "id": 32,
      "content": "s per time- the scheduling metric. The plot below λ < 6×10−3 shows\nstepforallocation(6RB/time-slot).Thesimulationisobserved the resource utilization in an non-overloaded case. The Pi,k\nus\nfor approx. 4 minutes i.e 5e4 time-steps for 5 independent basedRAschemerequireslessresourcescomparedtotheSNR\niterations. based and error based schemes. In Pi,k based scheme the\nus\na) Resource Utilization: The total Resource Utilization Pth is varied to fulfill the the requirement on probability of\ne\n(RU) at every time-step is evaluated as instability,henceallocatingmoreRBstotheAGVwithhigher\n(cid:80)NN probability of instability and less RBs i.e. higher MCS to the\nRU = i rb,i ×100% (24) AGVs that are more likely to be stable. As the number of\nN\nRB activeAGVsperschedulingtimeinstantincreases,Pi,k based\nus\nwhere N is the number of RBs allocated to ith AGV at outperforms SNR based and error based schemes by utilizing\nrb,i\ntime-step k and N is the total number of RBs available for less resources.",
      "size": 991,
      "sentences": 8
    },
    {
      "id": 33,
      "content": "ased\nus\nwhere N is the number of RBs allocated to ith AGV at outperforms SNR based and error based schemes by utilizing\nrb,i\ntime-step k and N is the total number of RBs available for less resources. The γ based and (cid:15) based schemes have\nRB i,k i,k\nscheduling. higher resource consumption as the resources are assigned\n=== 페이지 6 ===\nanAGVwithoutconsideringitschannelcondition.Allocating\nmore RBs to an AGV with highest (cid:15) might have a higher\ni,k\nprobability of packet loss, if the AGV is in deep fade. Hence, transmitting the data with lower MCS will not ensure\nreliable transfer of control information as the received SNR is\nlow to successfully decode a packet. Furthermore, this leads\nto resource shortage for the AGVs that have good channel\ncondition and comparatively less control error causing higher\nconsecutive packet drops and instability.",
      "size": 859,
      "sentences": 5
    },
    {
      "id": 34,
      "content": "code a packet. Furthermore, this leads\nto resource shortage for the AGVs that have good channel\ncondition and comparatively less control error causing higher\nconsecutive packet drops and instability. Pi,k based scheme have lower number of unstable AGVs\nus\nthan the γ and (cid:15) RA scheme as it considers both; the\ni,k i,k\nAGV’s stability criterion and the channel conditions. If the\nsystem prevents consecutive packet loss, less will be the\nAoI and more accurate control information is applied to the\nactuators causing less (cid:15) . Furthermore the Pi,k RA scheme\ni,k us\nis independent of the control error (cid:15) that is evaluated from\ni,k\nthepositionfeedbackateverytimeinstantviauplinkchannel. Hence,thePi,k basedRAschemeisrobustagainsttheuplink\nus\nchannel conditions and instantaneous control state, but only\ndependsuponthepre-knowncontrolparameterslikesampling\ntime and velocity of an AGV. Also,inanoverloadedcase,thePi,k basedRAschemehave\nus\nFig.3.",
      "size": 959,
      "sentences": 7
    },
    {
      "id": 35,
      "content": "nnel conditions and instantaneous control state, but only\ndependsuponthepre-knowncontrolparameterslikesampling\ntime and velocity of an AGV. Also,inanoverloadedcase,thePi,k basedRAschemehave\nus\nFig.3. AbsolutenumberofUnstableAGVs fewnumberofunstableAGVsasaresultofdynamicresource\nallocation by varying the Pth such that the Pi,k <10−9. The\ne us\nrate at which the % of unstable AGVs increase with increase\nwith constant P e th and excludes the stability based dynamic in λ is less for Pi,k RA scheme due to higher multiplexing\nus\nresource assignments. gains.ThechannelconditionbasedRAschemeslikePi,k and\nus\nb) Overloaded system: In an overloaded case, for λ >\nγ showshighergainsinanoverloadedcasewhencompared\ni,k\n6×10−3, the Pi,k based scheme still utilizes less resources\nus to (cid:15) i,k RA scheme. compared to γ and (cid:15) based schemes, but steadily con-\ni,k i,k\nverges at λ = 8×10−3. The resource utilization for all the VI.",
      "size": 931,
      "sentences": 7
    },
    {
      "id": 36,
      "content": "d scheme still utilizes less resources\nus to (cid:15) i,k RA scheme. compared to γ and (cid:15) based schemes, but steadily con-\ni,k i,k\nverges at λ = 8×10−3. The resource utilization for all the VI. CONCLUSIONS\nschemes approaches 100%, due to more number of AGVs We proposed a stability based resource allocation scheme\nbeing activated and hence all the available resources are for a pragmatic non-linear time-varying closed-loop feedback\nutilized. However, due to dynamically allocating resources AGV control system. We evaluated a new scheduling metric\nfor Pi,k more AGVs can be successfully served even in an ’Probability of Instability’ that considers channel condition,\nus\noverloadedcaseasshowninFig.3ascomparedto(cid:15) i,k andγ i,k consecutive packet losses and control stability for optimally\nbased schemes.",
      "size": 817,
      "sentences": 6
    },
    {
      "id": 37,
      "content": "ability of Instability’ that considers channel condition,\nus\noverloadedcaseasshowninFig.3ascomparedto(cid:15) i,k andγ i,k consecutive packet losses and control stability for optimally\nbased schemes. Moreover, the γ i,k RA scheme shows better selectingtheMCSschemeandallocatingtheresources.Unlike\nperformance compared to (cid:15) i,k RA scheme, as less number of traditional Maximizing SNR RA scheme, the presented RA\nAGVs become unstable with similar resource utilization. As scheme allocates more resources to the AGV that is more\nthe γ i,k based RA scheme allocates the resources considering likely to become unstable. The RA scheme ensures that the\nchannel conditions, lower is the probability of packet failure. probabilityofinstabilityforallthestableAGVsisbelow10−9\nOnthecontrarycontrolerrorbasedRAschemedonotconsider and the control error is maintained within the threshold of\nchannel condition, and allocates more resources to the AGV 2cm.",
      "size": 947,
      "sentences": 5
    },
    {
      "id": 38,
      "content": "hestableAGVsisbelow10−9\nOnthecontrarycontrolerrorbasedRAschemedonotconsider and the control error is maintained within the threshold of\nchannel condition, and allocates more resources to the AGV 2cm. The performance of RA scheme is analysed and com-\nwith higher (cid:15) i,k even in the bad channel condition, that pared with existing SNR based RA scheme and control error\nleads to packet loss and resource wastage. Therefore, the (cid:15) i,k based RA scheme. The RA with stability based scheduling\nhas higher resource utilization and more number of unstable metrics utilizes less resources while serving more number\nAGVs. of stable AGVs is a system. The AGV’s performance and\nresourceconsumptionispresentedforanoverloadedandnon-\nC. Unstable AGVs overloaded scenario. The Fig. 3 and Fig. ? ? show the absolute number and\nREFERENCES\npercentage of unstable AGVs respectively.",
      "size": 874,
      "sentences": 11
    },
    {
      "id": 39,
      "content": "nd\nresourceconsumptionispresentedforanoverloadedandnon-\nC. Unstable AGVs overloaded scenario. The Fig. 3 and Fig. ? ? show the absolute number and\nREFERENCES\npercentage of unstable AGVs respectively. In non-overloaded\ncase, λ < 6×10−3 sufficient resources are available hence [1] V. Fanibhare, N. I. Sarkar, and A. Al-Anbuky, “A survey of the\ntactile internet: Design issues and challenges, applications, and future\nvery few AGVs exceeds (cid:15) th and n max . Error based resource directions,”Electronics,vol.10,no.17,2021. allocationschemehasthemaximumnumberofunstableAGVs [2] S.Tayade,P.Rost,A.Maeder,andH.D.Schotten,“Delayconstrained\nenergy optimization for edge cloud offloading,” in 2018 IEEE Inter-\neven though the priority is given to the AGV with highest\nnationalConferenceonCommunicationsWorkshops(ICCWorkshops),\ncontrolerror.Thisisduetotheallocationofmoreresourcesto 2018,pp.1–6.",
      "size": 891,
      "sentences": 9
    },
    {
      "id": 40,
      "content": "18 IEEE Inter-\neven though the priority is given to the AGV with highest\nnationalConferenceonCommunicationsWorkshops(ICCWorkshops),\ncontrolerror.Thisisduetotheallocationofmoreresourcesto 2018,pp.1–6. === 페이지 7 ===\n[3] ICCPS ’19: Proceedings of the 10th ACM/IEEE International Confer-\nence on Cyber-Physical Systems. New York, NY, USA: Association\nforComputingMachinery,2019. [4] B. Han, Y. Zhu, Z. Jiang, M. Sun, and H. D. Schotten, “Fairness for\nfreshness:OptimalageofinformationbasedOFDMAschedulingwith\nminimalknowledge,”CoRR,vol.abs/2010.07139,2020. [5] S.TatikondaandS.Mitter,“Controlovernoisychannels,”IEEETrans-\nactionsonAutomaticControl,vol.49,no.7,pp.1196–1201,July2004. [6] ——, “Control under communication constraints,” IEEE Transactions\nonAutomaticControl,vol.49,no.7,pp.1056–1068,July2004. [7] M. Garc´ıa-Rivera and A. Barreiro, “Analysis of networked control\nsystemswithdropsandvariabledelays,”2007.",
      "size": 912,
      "sentences": 7
    },
    {
      "id": 41,
      "content": "on constraints,” IEEE Transactions\nonAutomaticControl,vol.49,no.7,pp.1056–1068,July2004. [7] M. Garc´ıa-Rivera and A. Barreiro, “Analysis of networked control\nsystemswithdropsandvariabledelays,”2007. [8] X.LiuandA.Goldsmith,Cross-layerDesignofControloverWireless\nNetworks,012005,pp.111–136. [9] W. P. M. H. Heemels, A. R. Teel, N. van de Wouw, and D. Nesˇic´,\n“Networkedcontrolsystemswithcommunicationconstraints:Tradeoffs\nbetween transmission intervals, delays and performance,” IEEE Trans-\nactionsonAutomaticControl,vol.55,no.8,pp.1781–1796,2010. [10] G.C.WalshandHongYe,“Schedulingofnetworkedcontrolsystems,”\nIEEEControlSystemsMagazine,vol.21,no.1,pp.57–65,2001. [11] M. S. Branicky, S. M. Phillips, and Wei Zhang, “Scheduling and\nfeedback co-design for networked control systems,” in Proceedings of\nthe41stIEEEConferenceonDecisionandControl,2002.,vol.2,2002,\npp.1211–1217vol.2.",
      "size": 881,
      "sentences": 6
    },
    {
      "id": 42,
      "content": "cky, S. M. Phillips, and Wei Zhang, “Scheduling and\nfeedback co-design for networked control systems,” in Proceedings of\nthe41stIEEEConferenceonDecisionandControl,2002.,vol.2,2002,\npp.1211–1217vol.2. [12] G. Walsh, H. Ye, and L. Bushnell, “Stability analysis of networked\ncontrol systems,” IEEE Transactions on Control Systems Technology,\nvol.10,no.3,pp.438–446,2002. [13] S. Tayade, P. Rost, A. Maeder, and H. D. Schotten, “Impact of short\nblocklengthcodingonstabilityofanagvcontrolsysteminindustry4.0,”\nin2020IEEEInternationalConferenceonCommunicationsWorkshops\n(ICCWorkshops),2020,pp.1–6. [14] M. Eisen, M. M. Rashid, K. Gatsis, D. Cavalcanti, N. Himayat, and\nA. Ribeiro, “Control aware radio resource allocation in low latency\nwirelesscontrolsystems,”IEEEInternetofThingsJournal,vol.6,no.5,\npp.7878–7890,2019.",
      "size": 813,
      "sentences": 4
    },
    {
      "id": 43,
      "content": "ashid, K. Gatsis, D. Cavalcanti, N. Himayat, and\nA. Ribeiro, “Control aware radio resource allocation in low latency\nwirelesscontrolsystems,”IEEEInternetofThingsJournal,vol.6,no.5,\npp.7878–7890,2019. [15] M.Vilgelm,O.Ayan,S.Zoppi,andW.Kellerer,“Control-awareuplink\nresourceallocationforcyber-physicalsystemsinwirelessnetworks,”in\nEuropeanWireless2017;23thEuropeanWirelessConference,2017,pp. 1–7. [16] ——,“Control-awareuplinkresourceallocationforcyber-physicalsys-\ntemsinwirelessnetworks,”inEuropeanWireless2017;23thEuropean\nWirelessConference,May2017,pp.1–7. [17] L. Scheuvens, T. Ho¨ßler, P. Schulz, N. Franchi, A. N. Barreto, and\nG. P. Fettweis, “State-aware resource allocation for wireless closed-\nloopcontrolsystems,”IEEETransactionsonCommunications,vol.69,\nno.10,pp.6604–6619,2021. [18] K.Gatsis,A.Ribeiro,andG.J.Pappas,“Control-awarerandomaccess\ncommunication,” in 2016 ACM/IEEE 7th International Conference on\nCyber-PhysicalSystems(ICCPS),2016,pp.1–9.",
      "size": 959,
      "sentences": 6
    },
    {
      "id": 44,
      "content": "9,\nno.10,pp.6604–6619,2021. [18] K.Gatsis,A.Ribeiro,andG.J.Pappas,“Control-awarerandomaccess\ncommunication,” in 2016 ACM/IEEE 7th International Conference on\nCyber-PhysicalSystems(ICCPS),2016,pp.1–9. [19] S.Tayade,P.Rost,A.Maeder,andH.D.Schotten,“Cloudcontrolagv\noverrayleighfadingchannel-thefasterthebetter,”inSCC2019;12th\nInternationalITGConferenceonSystems,CommunicationsandCoding,\nFeb2019,pp.1–6. [20] S. Tayade, P. Rost, and A. Maeder, “Error convergence analysis and\nstabilityofacloudcontrolagv,”2021. [21] Y. Kanayama, Y. Kimura, and F. Miyazaki, “A stable tracking control\nmethodforanautonomousmobilerobot.”",
      "size": 615,
      "sentences": 5
    }
  ]
}