{
  "source": "ArXiv",
  "filename": "005_Frequency-responsive_RCS_characteristics_and_scali.pdf",
  "total_chars": 23490,
  "total_chunks": 35,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nFrequency-responsive RCS characteristics and\nscaling implications for ISAC development\nSau´l Fenollosa+; Monika Drozdowska+; Wenfei Yang*; Sergio Mico´-Rosa+; Alejandro Castilla+;\nAlejandro Lopez-Escudero+; Jian Li*; Narcis Cardona+\n+iTEAM Research Institute, Universitat Polite`cnica de Vale`ncia, Spain\n*Wireless Technology Laboratory, Huawei Technologies Co., Ltd., China\n+[sjfenarg, mdrozdo, sermiro, a.castilla, alloes3, ncardona]@upv.edu.es\n*[yangwenfei4, calvin.li]@huawei.com\nAbstract—This paper presents an investigation on the Radar\nCross-Section (RCS) of various targets, with the objective of\nanalysinghowRCSpropertiesvarywithfrequency.Targetssuch\nas an Automated Guided Vehicle (AGV), a pedestrian, and a\nfull-scale car were measured in the frequency bands referred\nto in industry standards as FR2 and FR3. Measurements were\ntaken in diverse environments, indoors and outdoors, to ensure\ncomprehensive scenario coverage.",
      "size": 947,
      "sentences": 2
    },
    {
      "id": 2,
      "content": "ere measured in the frequency bands referred\nto in industry standards as FR2 and FR3. Measurements were\ntaken in diverse environments, indoors and outdoors, to ensure\ncomprehensive scenario coverage. The methodology employed\nin RCS extraction performs background subtraction, followed\nby time-domain gating to isolate the influence of the target. This analysis compares the RCS values and how the points\nof greatest contribution are distributed across different bands\nbased on the range response of the RCS. Analysis of the results\nFig. 1: RCS extraction methodology diagram. demonstratedhowRCSvalueschangewithfrequencyandtarget\nshape, providing insights into the electromagnetic behaviour of\nThis work outlines the process of measuring RCS using a\nthese targets. Key findings highlight how much scaling RCS\nvector network analyzer (VNA) for three targets at various\nvalues based on frequency and geometry is complex and varies\namong different types of materials and shapes.",
      "size": 974,
      "sentences": 8
    },
    {
      "id": 3,
      "content": "s highlight how much scaling RCS\nvector network analyzer (VNA) for three targets at various\nvalues based on frequency and geometry is complex and varies\namong different types of materials and shapes. These insights elevations and across two frequency bands: 10-15 GHz and\nare instrumental for advancing sensing systems and enhancing 25.75-30.25 GHz. The measured targets include a pedestrian,\n3GPP channel models, particularly for Integrated Sensing and an Automated Guided Vehicle (AGV), and a full-scale car. Communications (ISAC) techniques proposed for 6G standards. Additionally, this work elaborates on the complete process of\nIndex Terms—Radar Cross-Section, ISAC extractingtheinfluenceofthetargetfromothercomponentsof\nthe scenario, using techniques such of background subtraction\nI. INTRODUCTION and time-domain gating.",
      "size": 827,
      "sentences": 6
    },
    {
      "id": 4,
      "content": "s of\nIndex Terms—Radar Cross-Section, ISAC extractingtheinfluenceofthetargetfromothercomponentsof\nthe scenario, using techniques such of background subtraction\nI. INTRODUCTION and time-domain gating. It continues with an analysis of the\nInthecontextofadvancedmobilecommunicationnetworks, feasibilityofperformingfrequencyscalingoncomplextargets,\nIntegratedSensingandCommunication(ISAC)technologyhas andendswithananalysisofthespatialpointswiththegreatest\nemerged as a forefront innovation for future 6G networks. influence on the RCS value, comparing their consistency in\nISACaimstointegratesensingwithcommunications,enabling both bands. network elements to function as sensors for gathering envi- The rest of the paper is organised as follows: Section II\nronmental information [1].",
      "size": 780,
      "sentences": 5
    },
    {
      "id": 5,
      "content": "ntegratesensingwithcommunications,enabling both bands. network elements to function as sensors for gathering envi- The rest of the paper is organised as follows: Section II\nronmental information [1]. This approach offers a wide range describestheRCSextractionmethodology,SectionIIIoutlines\nof potential sensing applications, while enhancing spectral the measurement campaign, Section IV discusses the results,\nefficiency, leveraging radio channel information derived from and Section V summarises the conclusions of this paper. sensing data [2]. Existing literature proposes ISAC channel\nmodels that combine stochastic standards with deterministic\nII. RCSEXTRACTIONMETHODOLOGY\ninformation provided by the detection and characterization of\nenvironmental elements [3].",
      "size": 766,
      "sentences": 6
    },
    {
      "id": 6,
      "content": "roposes ISAC channel\nmodels that combine stochastic standards with deterministic\nII. RCSEXTRACTIONMETHODOLOGY\ninformation provided by the detection and characterization of\nenvironmental elements [3]. One of the steps to undertake The methodology for extracting the RCS, based on existing\nis the analysis of the influence of usual elements in radio literature [7], [8], is illustrated in the block diagram shown in\nchannels,suchaspedestriansorcars[4],[5].Itmaybedoneby Fig. 1. This process is conducted using complex S-parameter\nanalysing the Radar Cross-Section (RCS), which is defined as measurementsobtainedwithaVNA.Itrequiresthreedifferent\na metric of the detectability of an object by radar. This metric measurements:\ndepends on the element’s size and shape, its material, and • S 11,tg (f), which measures a scenario with a target in it\nthe frequency at which it is observed.",
      "size": 880,
      "sentences": 6
    },
    {
      "id": 7,
      "content": "ject by radar. This metric measurements:\ndepends on the element’s size and shape, its material, and • S 11,tg (f), which measures a scenario with a target in it\nthe frequency at which it is observed. RCS information helps • S 11,bg (f), which corresponds to the scenario without the\nconstraining the stochastic information according to 3GPP target\nchannel standards, allowing the addition of a deterministic • S 11,sph (f), which measures a calibration object at the\nmetric to the ISAC channel model [6]. target location in the scenario\n5202\nluJ\n61\n]PS.ssee[\n1v53221.7052:viXra\n=== 페이지 2 ===\nThe RCS value of the target over the frequency band is\n√\nobtained by averaging all the squared values of σ (f),\ntg\nN\n1 (cid:88)\nRCS= σ (f ), (2)\nN tg i\ni=1\nwhere N is the number of samples measured in the band. √\nHowever, the metric σ (f) enables us to assess the target’s\ntg\ncharacteristics not only in the frequency domain but also in\nthe time and range domains.",
      "size": 956,
      "sentences": 5
    },
    {
      "id": 8,
      "content": "s the number of samples measured in the band. √\nHowever, the metric σ (f) enables us to assess the target’s\ntg\ncharacteristics not only in the frequency domain but also in\nthe time and range domains. This is achieved by applying the\ninverse Fourier transform, expressed as follows:\nFig. 2: PEC sphere used as calibration object. √\nσ\n(t)=F−1(cid:8)√\nσ (f)\n(cid:9)\n. (3)\ntg tg\nA. Background subtraction and time-domain gating III. MEASUREMENTCAMPAIGN\nThebackgroundinfluenceissubtractedfromboththetarget A. Measurements setup\nandthecalibrationobjectmeasurementstoeliminateunwanted\nThe channel sounding system used for the measurements\ncomponents, ensuring that only the signals of interest remain. consists of a VNA and one horn antenna connected to the\nAfter this subtraction, a time-domain gating algorithm is\nVNA via RF cable. The VNA is the Rohde & Schwarz\napplied.",
      "size": 866,
      "sentences": 10
    },
    {
      "id": 9,
      "content": "signals of interest remain. consists of a VNA and one horn antenna connected to the\nAfter this subtraction, a time-domain gating algorithm is\nVNA via RF cable. The VNA is the Rohde & Schwarz\napplied. This algorithm filters out components not belonging\nZNB40 [9] designed to work in the 100 kHz to 40 GHz\ntotheobjectunderstudybyconsideringonlyreflectionswithin\nfrequencyband.Asfortheantennas,threedifferenttypeswere\na specific time range. utiliseddependingonthetargetfrequencyband.TheQSH-SL-\nB.",
      "size": 493,
      "sentences": 5
    },
    {
      "id": 10,
      "content": "to 40 GHz\ntotheobjectunderstudybyconsideringonlyreflectionswithin\nfrequencyband.Asfortheantennas,threedifferenttypeswere\na specific time range. utiliseddependingonthetargetfrequencyband.TheQSH-SL-\nB. Frequency dependent RCS definition and calibration pro- 10-15-N-20 (QMS-00195) antenna [10] for 10-14 GHz and\ncedure PE9855B/SF-15antenna[11]for10-15inFR3,andtheQWH-\nSL-18-40-K-SG (QMS-00910) antenna [12] for 25.75-30.25\nTo enable a more comprehensive analysis of the target’s\nGHzinFR2.TheRFcableKBL-2M-LOW+[13]wasusedto\ninfluence using the RCS metric, we define the frequency-\n√ connectport2oftheVNAwiththehornantenna.Usedcables\ndependent root of the RCS, denoted as σ (f), whose\ntg were 2 m long low-loss coaxial cables with an insertion loss\nexpressioniswritteninFig.1.Thisparameterisderivedfrom\nof2.35dBat10GHzand4.3dBat30GHz.Someadditional\nthe signal S↔ (f), obtained after background subtraction\n11,tg parameters are summarised in Table I.\nand time-domain gating application to the measured signal\nwith the target’s influence.",
      "size": 1032,
      "sentences": 3
    },
    {
      "id": 11,
      "content": "eadditional\nthe signal S↔ (f), obtained after background subtraction\n11,tg parameters are summarised in Table I.\nand time-domain gating application to the measured signal\nwith the target’s influence. Similarly, the signal S 1 ↔ 1,sph (f) TABLE I: Summary of the measurement parameters. is obtained for the calibration object, processed in the same\nmanner as for the target. The theoretical square root of the Centerfrequency 12 12.5GHz 28GHz\n√ Bandwidth 4GHz 5GHz 4.5GHz\nRCS value for the calibration object, denoted as σ sph , is AntennaHPBW 16◦ 32◦ 25◦\nthen used as a reference. We can accurately calibrate the Txpower 0dBm\nmeasurement system by comparing the measured response IFBandwidth 100kHz\nNo.ofsamplesperCIR 2001\nof the calibration object to its known theoretical RCS. This\nprocess compensates for variations in the radiation pattern,\nantenna gain, and other system losses. The chosen calibration B.",
      "size": 909,
      "sentences": 7
    },
    {
      "id": 12,
      "content": "sperCIR 2001\nof the calibration object to its known theoretical RCS. This\nprocess compensates for variations in the radiation pattern,\nantenna gain, and other system losses. The chosen calibration B. Measured Targets\nobject was a perfect electric conductor (PEC) sphere with a\nThe data of three targets were gathered. Two of them,\nradiusofR=15cm(Fig.2).ThePECspherewasselectedas\nautomatedguidedvehicle(AGV)andpedestrian,intheindoor\nthecalibrationobjectbecauseofitsstableandpredictableRCS\nscenario,andone,thefullsizecar(2018blackNissanMicra),\ncharacteristics,especiallyitsindependencefromfrequencyfor\nin the outdoor scenario. Targets are shown in Fig. 3a, Fig. 3b,\nsufficiently small wavelengths. For that case, the theoretical\nand Fig. 5a. The details of targets’ sizes and measurement\nRCSvalueisdeterminedsolelybythephysicaldimensionsof\nconditions are given in Table II. the sphere and is given by\nσ =πR2, (1) TABLE II: Characteristics of the measured targets.",
      "size": 961,
      "sentences": 12
    },
    {
      "id": 13,
      "content": "’ sizes and measurement\nRCSvalueisdeterminedsolelybythephysicaldimensionsof\nconditions are given in Table II. the sphere and is given by\nσ =πR2, (1) TABLE II: Characteristics of the measured targets. sph\nDimension AGV Pedestrian Car\nwhere R is the radius of the sphere. Additionally, it is\nHeight 0.416m 1.73m 1.455m\nnecessary to correct for discrepancies in propagation losses\nWidth 0.614m - 1.734m\nthat may arise due to different positions of the target and the\nLength 0.72m - 3.99m\ncalibration object. This correction is achieved by applying a Environment Indoor Indoor Outdoor\nfactorderivedfromthesquareoftheratiobetweenthedistance Center 12GHz 12GHz 12.5GHz\nto the target, D , and the distance to the calibration object, frequencies 28GHz 28GHz 28GHz\ntg\nD . sph\n[표 데이터 감지됨]\n\n=== 페이지 3 ===\n(a) (b)\n(a) (b) Fig. 5: Photo of the outdoor environment: a) School of\nTelecommunications Engineering building, b) Research Insti-\nFig. 3: Measured targets: a) AGV, b) pedestrian. tute CMT building.",
      "size": 992,
      "sentences": 9
    },
    {
      "id": 14,
      "content": "(a) (b)\n(a) (b) Fig. 5: Photo of the outdoor environment: a) School of\nTelecommunications Engineering building, b) Research Insti-\nFig. 3: Measured targets: a) AGV, b) pedestrian. tute CMT building. C. Indoor environment\nplaced in the far field zone according to equation 4, where D\nThe anechoic chamber used is 4.96 m wide, 8.33 m long, refers to the largest dimension of the antenna’s aperture. and6.1mhigh,designedforupto10GHzuse.However,aux-\n2·D2\niliary absorbing materials of proven efficiency up to 40 GHz d = (4)\nwere used. Each target has been measured with the antenna at min λ\na specified distance so that it is fully covered by the antenna The second condition is related to the antenna footprint on\nfootprint [14].",
      "size": 726,
      "sentences": 7
    },
    {
      "id": 15,
      "content": "ed. Each target has been measured with the antenna at min λ\na specified distance so that it is fully covered by the antenna The second condition is related to the antenna footprint on\nfootprint [14]. For those measurements whose distance to the thetargetundertest.Inordertocapturetheentiretargetinside\ntarget allowed it, a dispersive element has been included to theantennafootprint,thedistancebetweentheantennaandthe\navoid the influence of the reflected component on the ground. target must be obtained from the equation 5. Similarly, when it was possible to place the target on the (cid:18) (cid:19) (cid:18) (cid:19)\nW HPBW\nground, the rotating platform of the anechoic chamber was d min = 2 +d margin ·tan−1 2 , (5)\nused. In Fig. 4, a photo of the anechoic chamber is shown. where W refers to the width of the target in meters, d\nmargin\nis a small distance added to avoid approximation errors and\nHPBW is the half-power beamwidth of the antenna as\nshown in Fig. 6.",
      "size": 968,
      "sentences": 9
    },
    {
      "id": 16,
      "content": "is shown. where W refers to the width of the target in meters, d\nmargin\nis a small distance added to avoid approximation errors and\nHPBW is the half-power beamwidth of the antenna as\nshown in Fig. 6. As every antenna used for this measurement\ncampaign is a single horn antenna, for the working frequency\nband the far field distance is always less than the minimum\ndistancefortheHPBWfittingcriteria,sothefarfieldcondition\nis always met for every target. Fig.4:Photooftheindoorenvironmentwithoutthedispersive\nelement. D. Outdoor environment\nTwo outdoor scenarios were utilised for the real car mea-\nFig. 6: Methodology for obtaining the distance related to the\nsurements. One of them is located in front of the School of\nantenna footprint. Telecommunications Engineering building (Fig. 5a). It is an\nopen space with some far-placed scatterers on two sides and In the case of elevation θ, antennas must be mounted on\nbuildings on two sides.",
      "size": 937,
      "sentences": 11
    },
    {
      "id": 17,
      "content": "Telecommunications Engineering building (Fig. 5a). It is an\nopen space with some far-placed scatterers on two sides and In the case of elevation θ, antennas must be mounted on\nbuildings on two sides. The second site is located behind the a tripod, whose height can be adjusted. The methodology\nResearch Institute CMT building (Fig. 5b). Two sides of this employed to reach certain θ is putting the antenna higher and\narea are the building walls; two others are open spaces with closer, maintaining the minimum distance as shown in Fig. 7.\ndistanced greenhouses. As in the indoor scenario, it has been The AGV measurements were conducted for six elevation\ndesigned so that the antenna’s footprint covers the entire car. angles θ of the antenna: 0◦, 10◦, 20◦, 30◦, 40◦ and 50◦, the\npedestrian for 0◦, 10◦, and 20◦, and the car at two θ, 0◦ and\nE. Measurement procedure 10◦. In order to measure every target properly, two conditions Themethodologyfollowedfortheazimuthϕmeasurements\nneed to be met.",
      "size": 994,
      "sentences": 11
    },
    {
      "id": 18,
      "content": "0◦, 10◦, and 20◦, and the car at two θ, 0◦ and\nE. Measurement procedure 10◦. In order to measure every target properly, two conditions Themethodologyfollowedfortheazimuthϕmeasurements\nneed to be met. The first condition is that the target must be depends on the scenario and the target; some are above a\n=== 페이지 4 ===\n(a)\nFig. 7: Methodology for obtainingthe distance between target\nand antenna related to the antenna elevation. rotatoryplatform,othersareatafixedangle,whiletheantenna\nis rotating around the target. In the indoor scenario, a rotatory platform was used for\n(b)\nthe pedestrian and for the AGV when θ > 20◦. For angles\nFig. 8: AGV RCS measured for a) f ∈ [10,14] GHz and b)\n0◦, 10◦, and 20◦, AGV was placed on a table and rotated\nf ∈[25.75,30.25] GHz. using a remote controller. Targets were turned clockwise with\na 10-degree interval. The AGV is symmetrical; thus, when\nθ ≤20◦ it was measured from 0◦ to 180◦.",
      "size": 924,
      "sentences": 11
    },
    {
      "id": 19,
      "content": "table and rotated\nf ∈[25.75,30.25] GHz. using a remote controller. Targets were turned clockwise with\na 10-degree interval. The AGV is symmetrical; thus, when\nθ ≤20◦ it was measured from 0◦ to 180◦. In all other cases,\nthe measurements in indoor scenarios were performed from\n0◦ to 360◦. For the outdoor measurement campaign, the target was\nstatic,andtheantennawasmovedarounditalongasemicircle. The car was measured from 0◦ to 180◦ at 10-degree intervals,\nassuming the symmetry of the vehicle. (a)\nIV. RESULTS\nThissectionpresentstheRCSobtainedfrommeasurements\ndescribed in Section III. To perform the comparative analysis\nbetween frequency bands for each target, a stochastic approx-\nimationbasedonthelogarithmicscaledifferencesoftheRCS\nvalues is used. Finally, the RCS spread in the range domain\nin both bands is compared. (b)\nFig. 9: Pedestrian RCS measured for a) f ∈[10,14] GHz and\nA. RCS\nb) f ∈[25.75,30.25] GHz.",
      "size": 917,
      "sentences": 13
    },
    {
      "id": 20,
      "content": "ifferencesoftheRCS\nvalues is used. Finally, the RCS spread in the range domain\nin both bands is compared. (b)\nFig. 9: Pedestrian RCS measured for a) f ∈[10,14] GHz and\nA. RCS\nb) f ∈[25.75,30.25] GHz. The RCS values for the different targets were derived\nfollowingthemethodologyoutlinedinSectionII.Theadopted\nrepresentation for displaying the RCS values is a heatmap, For the pedestrian, the RCS results are presented in Fig. where the x-axis denotes the azimuth angle ϕ° and the y-axis 9. While there is some resemblance in the overall form, the\nrepresents the elevation angle θ°, corresponding to performed RCS values differ considerably between the frequency bands. measurements. It is not possible to visually find the similarities between two\nIn Fig. 8, the RCS values obtained for the AGV are frequency bands. However, it can be observed that the highest\ndisplayed.",
      "size": 870,
      "sentences": 11
    },
    {
      "id": 21,
      "content": "surements. It is not possible to visually find the similarities between two\nIn Fig. 8, the RCS values obtained for the AGV are frequency bands. However, it can be observed that the highest\ndisplayed. The results indicate a notable similarity between RCS values are obtained for θ = 0◦ and the lowest for θ =\nthebandsintermsoftheshape.Brightorangebars,indicating 20◦. high RCS values, are observed for θ =0◦ and ϕ=180◦, and\nfor θ between 20◦ and 50◦, ϕ = 90◦ and ϕ = 270◦ in both Lastly, in Fig. 10 the RCS for the car is illustrated. The\nbands. The visual comparison of Fig. 8a and 8b indicates the comparison across bands reveals a pattern analogous to the\nhigheroftwomeasuredbandsgivesslightlyhigherRCSvalues AGV, with shapes remaining consistent across both frequency\nas the heatmap is brighter. It is also worth noting that the line bands. Meanwhile, RCS values for the higher bands are\ncorresponding to θ =10◦ is visibly darker than others. noticeably higher.",
      "size": 964,
      "sentences": 13
    },
    {
      "id": 22,
      "content": "uency\nas the heatmap is brighter. It is also worth noting that the line bands. Meanwhile, RCS values for the higher bands are\ncorresponding to θ =10◦ is visibly darker than others. noticeably higher. === 페이지 5 ===\naround0-1dB.Notably,aslightincreaseinscalingisobserved\nfor θ = 20◦ and θ = 30◦. In the case of the pedestrian,\nthere are considerable differences between the bands, with\nvaluesnearly3dBhigherinthef ∈[25.75,30.25]GHzband. The complex surface and geometry of the pedestrian could\nhave affected the longer wavelength band, allowing for new\nreflectionsathigherfrequenciesthatincreasetheRCS.Finally,\n(a)\nforthecar,theRCSisobservedtobehigherintheupperband. However, the differences are not comparable to the scaling\neffects seen in simpler metallic objects like a metal plate or\na metal cylinder, whose scalings for the studied frequencies\nwould be approximately 7 dB and 3.5 dB, respectively.",
      "size": 901,
      "sentences": 8
    },
    {
      "id": 23,
      "content": "arable to the scaling\neffects seen in simpler metallic objects like a metal plate or\na metal cylinder, whose scalings for the studied frequencies\nwould be approximately 7 dB and 3.5 dB, respectively. C. RCS time-range response\n√\n(b) In Section II, σ tg (t) is defined as the square root of the\nRCSinthetimedomain.Thismetricfacilitatestheassessment\nFig. 10: Car RCS measured for a) f ∈ [10,15] GHz and b)\nofthescatteringpropertiesofeachtargetacrossbothfrequency\nf ∈[25.75,30.25] GHz. bands. Moreover, it provides an empirical method for deter-\nmining scattering centres (SC), which can be used to simplify\n√\nB. Stochastic approximation to frequency scaling complex targets [15], [16]. In this analysis, the σ (t) in\ntg\nBasedontheobtainedRCSvaluesforbothfrequencybands range domain shifted on the target’s centre will be compared\nand each target, a comparative analysis is performed based for both frequencies. This approach allows us to identify the\non logarithmic scale differences.",
      "size": 982,
      "sentences": 7
    },
    {
      "id": 24,
      "content": "fted on the target’s centre will be compared\nand each target, a comparative analysis is performed based for both frequencies. This approach allows us to identify the\non logarithmic scale differences. This analysis is predicated spatial points on the target with the greatest contribution to\non evaluating RCS behaviour at varying frequencies, aiming the RCS, which could potentially serve as precursors to SC. to facilitate the scaling of target sizes when utilizing higher Forthecomparisonbetweenbands,twodistinctgraphswillbe\nfrequency bands than the measured one. The RCS is subject employedforeachtarget(Fig.12),allcorrespondingtoθ =0°. to change due to target size scaling and frequency band alter- The first graph plots the azimuth angle ϕ vs the range, while\nations,makingitessentialtoexaminetheimpactoffrequency the second graph represents the range response by positioning\nalterations on RCS.",
      "size": 900,
      "sentences": 6
    },
    {
      "id": 25,
      "content": "- The first graph plots the azimuth angle ϕ vs the range, while\nations,makingitessentialtoexaminetheimpactoffrequency the second graph represents the range response by positioning\nalterations on RCS. This ensures that any influence due to the each measurement at its corresponding ϕ, with interpolated\nusedfrequencybandcanbeaccuratelycompensatedforeither values for the unmeasured angles. through direct target scaling or during post-processing. TheresultsindicatethatforboththeAGVandthecar(Fig. Aspreviouslymentioned,themetricutilizedisthelogarith- 12a and Fig. 12c), the distribution of the most influential\nmic scale difference of the RCS values, defined as: points across both bands is nearly identical, demonstrating\nhigh consistency with respect to frequency variations. How-\n(cid:18) (cid:19)\n∆RCS=10log RCS Band2 , (6) ever, significant differences are observed in the case of the\n10 RCS pedestrian (Fig. 12b).",
      "size": 918,
      "sentences": 8
    },
    {
      "id": 26,
      "content": "ng\nhigh consistency with respect to frequency variations. How-\n(cid:18) (cid:19)\n∆RCS=10log RCS Band2 , (6) ever, significant differences are observed in the case of the\n10 RCS pedestrian (Fig. 12b). While the RCS for the lower band\nBand1\nis concentrated at specific points, it becomes more spatially\nwhere Band 1 corresponds to f ∈ [10,15] GHz and Band 2\ndistributed when shifting to the higher band. corresponds to f ∈ [25.75,30.25] GHz. For each target, set\nof ∆RCS were calculated. To observe the behaviour of the V. CONCLUSIONS\nchange between bands, the Gaussian distributions were fitted The conclusions drawn from the study presented in this\nforeachelevationindividually,andforalltheresultsobtained papercanbesummarizedintwokeyaspects:1)thescalingof\nfor the target. For the overall case, the differences are plotted RCSvaluesand2)thespatialpointswiththegreatestinfluence\nin histogram format together with their fitted Gaussian curve on them.",
      "size": 948,
      "sentences": 8
    },
    {
      "id": 27,
      "content": "alingof\nfor the target. For the overall case, the differences are plotted RCSvaluesand2)thespatialpointswiththegreatestinfluence\nin histogram format together with their fitted Gaussian curve on them. Firstly, regarding the scaling, it has been observed\nin Fig. 11. The mean µ and standard deviation σ results can that variations in frequency lead to variations in RCS values,\nbe found in Table III for every target and every θ°. which depend on the material and shape of the target. For\ncomplexshapesandnon-metallicmaterials,suchasthepedes-\nTABLE III: Gaussian adjustment parameters for ∆RCS in\ntrian, the RCS is highly sensitive to frequency. Conversely,\ndifferent targets.",
      "size": 674,
      "sentences": 8
    },
    {
      "id": 28,
      "content": "target. For\ncomplexshapesandnon-metallicmaterials,suchasthepedes-\nTABLE III: Gaussian adjustment parameters for ∆RCS in\ntrian, the RCS is highly sensitive to frequency. Conversely,\ndifferent targets. for simpler shapes and metallic materials, a certain frequency\nTarget Parameter 0º 10º 20º 30º 40º 50º Overall scalingexists,whosevaluecanbeestimatedstochasticallyand\nAGV µ(dB) 0.63 0.12 2.55 2.82 0.51 0.06 1.12 must be considered when working with size and frequency\nσ(dB) 1.66 1.98 1.74 2.22 2.08 2.50 2.32\nPedestrian µ(dB) 1.41 3.15 3.94 - - - 2.84 scaling. σ(dB) 4.37 3.11 4.11 - - - 4.01 Regardingthedistributionofspatialpointswiththegreatest\nCar µ(dB) 0.61 2.52 - - - - 1.57\nσ(dB) 2.10 2.00 - - - - 2.25 influence on the RCS, a similar trend has been observed.",
      "size": 766,
      "sentences": 5
    },
    {
      "id": 29,
      "content": "4.37 3.11 4.11 - - - 4.01 Regardingthedistributionofspatialpointswiththegreatest\nCar µ(dB) 0.61 2.52 - - - - 1.57\nσ(dB) 2.10 2.00 - - - - 2.25 influence on the RCS, a similar trend has been observed. The\npedestrian exhibits a considerably more spatially distributed\nThe results indicate that for the AGV, the RCS exhibits RCS at higher frequencies, so not being feasibble in this case\nminimalvariationacrossfrequencies,withaveragedifferences a generalized frequency characterization based on scattering\n[표 데이터 감지됨]\n\n=== 페이지 6 ===\n(a) (b) (c)\nFig. 11: Overall ∆RCS histograms for different targets: (a) AGV, (b) Pedestrian, (c) Car. (a) (b) (c)\nFig. 12: RCS range response for different objects in θ = 0°. Upper graphs correspond to f ∈ [10,14-15] GHz and lower\ngraphs correspond to f ∈[25.75,30.25] GHz. (a) AGV, (b) Pedestrian, (c) Car. centers (SC).",
      "size": 851,
      "sentences": 8
    },
    {
      "id": 30,
      "content": "RCS range response for different objects in θ = 0°. Upper graphs correspond to f ∈ [10,14-15] GHz and lower\ngraphs correspond to f ∈[25.75,30.25] GHz. (a) AGV, (b) Pedestrian, (c) Car. centers (SC). However, the high similarity in the distribution [7] W.Hofmann,C.Bornkessel,A.SchwindandM.A.Hein,”Challenges\nof points for both the AGV and the car suggests the possi- ofRFAbsorberCharacterization:ComparisonBetweenRCS-andNRL-\nArch-Methods,” in 2019 International Symposium on Electromagnetic\nbility of developing SC models that are robust to frequency\nCompatibility-EMCEUROPE,Barcelona. variation, thereby simplifying the modelling of such targets [8] R. E. Jarvis, J. G. Metcalf, J. E. Ruyle and J. W. McDaniel, ”High\nandfacilitatingtheirimplementationinISACchannelmodels. Temporal Resolution Time-Gating for Wideband Radar Cross Section\nMeasurements,” 2021 51st European Microwave Conference (EuMC),\nLondon,UnitedKingdom,2022,pp.998-1001.",
      "size": 939,
      "sentences": 7
    },
    {
      "id": 31,
      "content": "plementationinISACchannelmodels. Temporal Resolution Time-Gating for Wideband Radar Cross Section\nMeasurements,” 2021 51st European Microwave Conference (EuMC),\nLondon,UnitedKingdom,2022,pp.998-1001. REFERENCES [9] Rohde&Schwarz, ”R&S ZNB/ZNBT Vector Net-\nwork Analyzers User Manual” [online] Available:\nhttps://assets.testequity.com/te1/Documents/pdf/manuals/znb-m.pdf. [1] F. Liu et al., ”Integrated Sensing and Communications: Toward Dual- [10] Steatite, ”Linearly Polarised Horn Antenna; QSH-SL-10-15-N-\nFunctionalWirelessNetworksfor6GandBeyond,”inIEEEJournalon 20” [online] Available: https://www.steatite-antennas.co.uk/wp-\nSelectedAreasinCommunications,vol.40,no.6,pp.1728-1767,June content/uploads/2019/01/QSH-SL-10-15-N-20.pdf. 2022.",
      "size": 742,
      "sentences": 5
    },
    {
      "id": 32,
      "content": "eyond,”inIEEEJournalon 20” [online] Available: https://www.steatite-antennas.co.uk/wp-\nSelectedAreasinCommunications,vol.40,no.6,pp.1728-1767,June content/uploads/2019/01/QSH-SL-10-15-N-20.pdf. 2022. [11] Pasternack,”WR-75WaveguideStandardGainHornAntenna”[online]\n[2] Y. Cui, F. Liu, X. Jing and J. Mu, ”Integrating Sensing and Commu- Available: https://www.pasternack.com/wr-75-waveguide-standard-gain-\nnicationsforUbiquitousIoT:Applications,Trends,andChallenges,”in horn-antenna-15-db-sma-pe9855b-sf-15-p.aspx. IEEENetwork,vol.35,no.5,pp.158-167,September/October2021. [12] Steatite, ”Wideband Horn Antenna; QWH-SL-18-40-K-SG” [on-\n[3] Z.Zhangetal.,”AGeneralChannelModelforIntegratedSensingand line] Available: https://qparusa.com/wp-content/uploads/2020/06/QMS-\nCommunication Scenarios,” in IEEE Communications Magazine, vol. 00910 TEST REPORT.pdf. 61,no.5,pp.68-74,May2023.",
      "size": 877,
      "sentences": 7
    },
    {
      "id": 33,
      "content": "egratedSensingand line] Available: https://qparusa.com/wp-content/uploads/2020/06/QMS-\nCommunication Scenarios,” in IEEE Communications Magazine, vol. 00910 TEST REPORT.pdf. 61,no.5,pp.68-74,May2023. [13] Mini-Circuits, ”KBL-2M-LOW+” [online] Available:\n[4] I.Matsunami,R.NakamuraandA.Kajiwara,“RCSmeasurementsfor https://www.minicircuits.com/pdfs/KBL-2M-LOW+.pdf. vehicles and pedestrian at 26 and 79GHz,” in 2012 6th International [14] S.B.J.Gowdu,A.Schwind,R.StephanandM.A.Hein,“Monostatic\nConferenceonSignalProcessingandCommunicationSystems,(pp.1- RCSMeasurementsofaPassengerCarMock-upat77GHzFrequency\n4),IEEE. inVirtualEnvironment,”in201949thEuropeanMicrowaveConference\n[5] T.Schipper,J.Fortuny-Guasch,D.,Tarchi,L.Reichardt,andT.Zwick, (EuMC)(pp.996-999).IEEE.",
      "size": 765,
      "sentences": 6
    },
    {
      "id": 34,
      "content": "sofaPassengerCarMock-upat77GHzFrequency\n4),IEEE. inVirtualEnvironment,”in201949thEuropeanMicrowaveConference\n[5] T.Schipper,J.Fortuny-Guasch,D.,Tarchi,L.Reichardt,andT.Zwick, (EuMC)(pp.996-999).IEEE. T, “RCS measurement results for automotive related objects at 23-27 [15] S. Abadpour, S. Marahrens, M. Pauli, J. Siska, N. Pohl and T. Zwick,\nGHz,”in2011Proceedingsofthe5thEuropeanConferenceonAntennas ”Backscattering Behavior of Vulnerable Road Users Based on High-\nandPropagation(EUCAP)(pp.683-686).IEEE. Resolution RCS Measurements,” in IEEE Transactions on Microwave\n[6] Y. Chen, Z. Yu, J. He, J. Li and G. Wang, ”A Scatterer-based Hybrid TheoryandTechniques,vol.70,no.3,pp.1582-1593,March2022.",
      "size": 697,
      "sentences": 5
    },
    {
      "id": 35,
      "content": ").IEEE. Resolution RCS Measurements,” in IEEE Transactions on Microwave\n[6] Y. Chen, Z. Yu, J. He, J. Li and G. Wang, ”A Scatterer-based Hybrid TheoryandTechniques,vol.70,no.3,pp.1582-1593,March2022. Channel Model for Integrated Sensing and Communications (ISAC),” [16] W.Yangetal.,”IntegratedSensingandCommunicationChannelMod-\n2023 IEEE 34th Annual International Symposium on Personal, Indoor elingandMeasurements:RequirementsandMethodologiesToward6G\nand Mobile Radio Communications (PIMRC), Toronto, ON, Canada, Standardization,”inIEEEVehicularTechnologyMagazine,vol.19,no. 2023,pp.1-7. 2,pp.22-30,June2024.",
      "size": 609,
      "sentences": 6
    }
  ]
}