{
  "source": "ArXiv",
  "filename": "045_Learning,_Computing,_and_Trustworthiness_in_Intell.pdf",
  "total_chars": 87647,
  "total_chunks": 130,
  "chunks": [
    {
      "id": 1,
      "content": "=== 페이지 1 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 1\nLearning, Computing, and Trustworthiness in Intelligent IoT\nEnvironments: Performance-Energy Tradeoffs\nBeatriz Soret, IEEE Member, Lam D. Nguyen, IEEE Graduate Student Member, Jan Seeger, Arne Bröring,\nChaouki Ben Issaid, IEEE Member, Sumudu Samarakoon, IEEE Member, Anis El Gabli, IEEE Member,\nVivek Kulkarni, Mehdi Bennis, IEEE Fellow, and Petar Popovski, IEEE Fellow\nAbstract—AnIntelligentIoTEnvironment(iIoTe)iscomprised Although the edge-centric approach solves the fundamental\nof heterogeneous devices that can collaboratively execute semi- limitations in terms of latency and dynamism, it also induces\nautonomous IoT applications, examples of which include highly\nnew challenges to the edge system: (1) the system has to deal\nautomated manufacturing cells or autonomously interacting\nwith complex IoT applications which include functions for\nharvesting machines.",
      "size": 934,
      "sentences": 1
    },
    {
      "id": 2,
      "content": "new challenges to the edge system: (1) the system has to deal\nautomated manufacturing cells or autonomously interacting\nwith complex IoT applications which include functions for\nharvesting machines. Energy efficiency is key in such edge\nenvironments, since they are often based on an infrastructure sensing, acting, reasoning and control, to be collaboratively\nthat consists of wireless and battery-run devices, e.g., e-tractors, run in heterogeneous devices, such as edge computers and\ndrones,AutomatedGuidedVehicle(AGV)sandrobots.Thetotal resource-constraineddevices,andgeneratingdatafromahuge\nenergy consumption draws contributions from multiple iIoTe\nnumber of data sources; (2) trustworthiness is a big concern\ntechnologies that enable edge computing and communication,\nfor edge and IoT systems where devices communicate with\ndistributed learning, as well as distributed ledgers and smart\ncontracts.Thispaperprovidesastate-of-the-artoverviewofthese other devices belonging to potentially many different parties,\ntechnologies and illustrates their functionality and performance, withoutanypre-establishedtrustrelationshipamongthem;(3)\nwith special attention to the tradeoff among resources, latency, all those functionalities are increasingly based on a resource-\nprivacy and energy consumption.",
      "size": 1299,
      "sentences": 2
    },
    {
      "id": 3,
      "content": "ablishedtrustrelationshipamongthem;(3)\nwith special attention to the tradeoff among resources, latency, all those functionalities are increasingly based on a resource-\nprivacy and energy consumption. Finally, the paper provides\nlimited wireless infrastructure that introduces latency and\na vision for integrating these enabling technologies in energy-\npacket losses in dynamically changing channels. efficient iIoTe and a roadmap to address the open research\nchallenges. Another huge concern for the exponential growth of IoT\nis its scalability and contribution to the carbon footprint. On\nIndexTerms—EdgeIoT,wirelessAI,Distributedlearning,Dis-\nthe one hand, IoT is key in deploying a huge amount of\ntributed Ledger Technology, Autonomous IoT, Trustworthiness. applicationsthatwillreducetheemissionsofnumeroussectors\nandindustries(e.g.,smartfarmingorenergy)[4].Ontheother\nI.",
      "size": 874,
      "sentences": 6
    },
    {
      "id": 4,
      "content": "ploying a huge amount of\ntributed Ledger Technology, Autonomous IoT, Trustworthiness. applicationsthatwillreducetheemissionsofnumeroussectors\nandindustries(e.g.,smartfarmingorenergy)[4].Ontheother\nI. INTRODUCTION hand, although many of these devices are low-power, the total\nenergy consumption of the infrastructure that support such\nA. Towards the edge\nsystemsdoeshaveacontributiontothedigitalcarbonfootprint\nDuring the last decade, the need for connecting billions of\nand cannot be overlooked [5], [6]. Internet of Things (IoT) devices has driven a significant part\nofthedesignofcomputingandcommunicationnetworks.The\nnumberofusecasesiscountless,rangingfromsmarthometo B. Intelligent IoT environments\nsmart city, industrial automation or smart farming.",
      "size": 753,
      "sentences": 6
    },
    {
      "id": 5,
      "content": "nificant part\nofthedesignofcomputingandcommunicationnetworks.The\nnumberofusecasesiscountless,rangingfromsmarthometo B. Intelligent IoT environments\nsmart city, industrial automation or smart farming. Many of\nWecointhetermIntelligentIoTEnvironment(iIoTe)torefer\nthe applications involve huge amounts of data, and the need\nto autonomous IoT applications endowed with intelligence\nfor fast, trustworthy and reliable processing of this data is\nbased on an efficient and reliable IoT/edge- (computation)\noftentimes infeasible with a cloud-centric paradigm [1], [2]. andnetwork-(communication)infrastructurethatdynamically\nMoreover, typical hierarchical setups of IoT cloud platforms\nadapts to changes in the environment and with built-in and\nhinder use cases with dynamically changing context due to\nassured trust.",
      "size": 809,
      "sentences": 4
    },
    {
      "id": 6,
      "content": "ically\nMoreover, typical hierarchical setups of IoT cloud platforms\nadapts to changes in the environment and with built-in and\nhinder use cases with dynamically changing context due to\nassured trust. Besides the wireless (and wired) networking\nlacking self-awareness of the individual subsystems and the\nto interconnect all IoT devices and infrastructure, there are\noverall system they usher. Alternatively, the architectures are\nother three key (and power-hungry) technologies that enable\nevolving towards edge solutions that place compute, network-\niIoTe. The first one is Machine Learning (ML) and Artificial\ning,andstorageincloseproximitytothedevices.Atthesame\nIntelligence (AI), and therefore we talk about intelligent IoT\ntime,theintroductionofmachine-drivenintelligencehasledto\nenvironments, comprising heterogeneous devices that can col-\nthetermedgeintelligence,referringtothedesignofdistributed\nlaboratively execute autonomous IoT applications.",
      "size": 953,
      "sentences": 4
    },
    {
      "id": 7,
      "content": "ine-drivenintelligencehasledto\nenvironments, comprising heterogeneous devices that can col-\nthetermedgeintelligence,referringtothedesignofdistributed\nlaboratively execute autonomous IoT applications. Given the\nIoT systems with latency-sensitive learning capabilities [3]. distributed nature of the system, distributed ML/AI solutions\nare better suited for multi-node (multi-agent) learning. Edge\nBeatrizSoret,LamD.Nguyen,andPetarPopovskiarewiththeConnectiv-\nitySection,DepartmentofElectronicSystem,AalborgUniversity,Denmark. computing is another defining technology that provides the\nContact:{bsa,ndl,petarp}@es.aau.dk. computationsideoftheinfrastructureandallocatescomputing\nJanSeeger,ArneBröring,andVivekKulkarniarewithSiemensAG,Mu-\nresources for complex IoT applications that need to be dis-\nnich,Germany.Contact:jan.seeger@thenybble.de,{arne.broering,vivekkulka-\nrni}@siemens.com.",
      "size": 884,
      "sentences": 6
    },
    {
      "id": 8,
      "content": ",ArneBröring,andVivekKulkarniarewithSiemensAG,Mu-\nresources for complex IoT applications that need to be dis-\nnich,Germany.Contact:jan.seeger@thenybble.de,{arne.broering,vivekkulka-\nrni}@siemens.com. tributed over multiple, connected IoT devices (e.g., machines\nChaoukiBenIssaid,SumuduSamarakoon,AnisElGabli,andMehdiBen- andAutomatedGuidedVehicle(AGV)s).Thethirdpillaristhe\nnisarewithCentreforWirelessCommunications(CWC),UniversityofOulu,\nDistributed Ledger Technology (DLT): rather than traditional\nFinland. Contact: {Chaouki.BenIssaid, Sumudu.Samarakoon, Anis.Elgabli,\nmehdi.bennis}@oulu.fi security mechanisms, DLT has been identified as the most\n1202\nceD\n42\n]CD.sc[\n2v68610.0112:viXra\n=== 페이지 2 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 2\nflexible solution for trustworthiness in a fully decentralized Plant Edge\nand heterogeneous scenario.",
      "size": 855,
      "sentences": 3
    },
    {
      "id": 9,
      "content": "eD\n42\n]CD.sc[\n2v68610.0112:viXra\n=== 페이지 2 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 2\nflexible solution for trustworthiness in a fully decentralized Plant Edge\nand heterogeneous scenario. Combined with smart contracts,\nitispossibleforthesystemtoautonomouslycontrolthetrans-\n1\nactions from parties without the need for human intervention. 2\nAlltheseingredientsarenecessaryforafullyfunctionaliIoTe, Plant Operator\nbut they have inevitably a significant contribution to the total\nenergy footprint. Our goal is to understand the role of each Internet\ntechnology in the performance and energy consumption of an Users 3 Local Global\niIoTe. Updates Updates\nC. Example: A manufacturing plant\n4\nArepresentativeusecaseforiIoTeisamanufacturingplant 4 4 4\nlike shown in Fig. 1, with autonomous collaboration between end-device end-device end-device end-device\nindustrial robot arms, machinery and AGVs. This relies on\n5\nreal-time data analysis and adaptability and intelligence in\nFig.",
      "size": 985,
      "sentences": 7
    },
    {
      "id": 10,
      "content": "onomous collaboration between end-device end-device end-device end-device\nindustrial robot arms, machinery and AGVs. This relies on\n5\nreal-time data analysis and adaptability and intelligence in\nFig. 1: iIoTe in a manufacturing plant. the manufacturing process, which is only feasible with the\nedge paradigm. The wireless infrastructure interconnects all\nthe machines and robots to the edge network and enables\nmanceand energyconsumption. Wenotice thatcharacterizing\nreliableandsafeoperation.Inthefigure,thefollowingsceneis\nthe energy efficiency of these complex systems is a daunting\ndepicted:acustomer(theend-user)ofasharedmanufacturing\ntask.Theconventionalapproachhasbeentocharacterizeevery\nplant orders a product by specifying a manufacturing goal\nsingle device or link. Nevertheless, the energy expenditure of\n(step 1).",
      "size": 824,
      "sentences": 7
    },
    {
      "id": 11,
      "content": "manufacturing\ntask.Theconventionalapproachhasbeentocharacterizeevery\nplant orders a product by specifying a manufacturing goal\nsingle device or link. Nevertheless, the energy expenditure of\n(step 1). In step (2), the needed machine orchestration and\nan IoT device will strongly depend on the context in which it\nassociated process plan is determined to manufacture the\nis put, in terms of, e.g., goal of the communication or traffic\ndesired product taking into account the available computa-\nbehaviour. Therefore, we go beyond the conventional single-\ntion and communication resources. The event-based process\ndevice approach and use the iIoTe as the basic building block\nplanner at the edge node is responsible for observing the\nin the energy budget. Contrary to the single device, the iIoTe\nmanufacturing process and reacting when the health state of\nis able to capture the complex interactions among devices for\na concerned machine changes. For example, by re-scheduling\neach of the technologies.",
      "size": 999,
      "sentences": 7
    },
    {
      "id": 12,
      "content": "turing process and reacting when the health state of\nis able to capture the complex interactions among devices for\na concerned machine changes. For example, by re-scheduling\neach of the technologies. The total energy footprint is not\na given task in a non-responding machine. In step (3), the\njust a simple sum of an average per-link or per-transaction\nmanufacturing process data is sent to the involved machines,\nconsumption of an isolated device, and scaling the number of\nwhichcaninclude,e.g.,mobilerobotsoranAGVtotransport\niIoTetoalargenumberofinstanceswillgiveamoreaccurate\nthework-piecesbetweenproductionpoints,roboticarms,laser\npicture of the overall energy consumption. engravers, assembly stations, etc. Let us assume that the task\nThe rest of the paper is organized as follows. In Section II\nrequires a robot to pick up a work-piece and place it in\nwe provide the state-of-the-art of the enabling technologies. different machines for its processing.",
      "size": 959,
      "sentences": 8
    },
    {
      "id": 13,
      "content": "er is organized as follows. In Section II\nrequires a robot to pick up a work-piece and place it in\nwe provide the state-of-the-art of the enabling technologies. different machines for its processing. As these machines may\nSection III analyzes the performance and energy consumption\nbe operated by the plant owner or a third-party operator, con-\nof each enabling technology, and Section IV provides the\ntractualarrangementsneedtobesetup,forwhichadistributed\nvision for integrating the enabling technologies in energy-\nledgerisused.Theledgerregistersthedetailsofeachtaskfor\nefficient iIoTe. Concluding remarks and a roadmap to address\nfuture accountability. In step (4), the local AI on board of the\nthe open research challenges are given in Section V.\ndifferentenddevicescomesintoplay.Forexample,inthecase\nof the robot as an end device, its AI decides how to pick up\nII. BACKGROUNDANDRELATEDWORK\na work-piece and place it in the next machine. In case the\nA.",
      "size": 956,
      "sentences": 8
    },
    {
      "id": 14,
      "content": "entenddevicescomesintoplay.Forexample,inthecase\nof the robot as an end device, its AI decides how to pick up\nII. BACKGROUNDANDRELATEDWORK\na work-piece and place it in the next machine. In case the\nA. Edge wireless communications\nlocal AI of the robot cannot complete its task (e.g., because\nit has not been trained for a similar situation yet), a human Edge computing enables the processing of the received\ntakes over remote control (this can be e.g. a plant operator). data closer to the sensor that generated them. This means a\nAfter the human intervention, the local AI can be re-trained full re-design of the communication infrastructure that must\nbased on the data captured from the human input.",
      "size": 700,
      "sentences": 7
    },
    {
      "id": 15,
      "content": "generated them. This means a\nAfter the human intervention, the local AI can be re-trained full re-design of the communication infrastructure that must\nbased on the data captured from the human input. This scene implementadditionalfunctionalityatthecellularbasestations\ncaptures the role and interaction of the three technologies orotheredgenodes.Thedesignandperformanceofcommuni-\nmentioned above: edge computing, ML/AI and DLTs/smart cation networks for edge computing has been widely studied\ncontracts. Similar examples can be defined in other domains, in the last years, and an overview can be found in [7] and\nsuch as agriculture (e.g., autonomously interacting harvesting [8].OneexampleisthetermMobileEdgeComputing(MEC),\nmachines), healthcare (e.g., remote patient monitoring and adoptedin5Gtorefertothedeploymentofcloudserversinthe\ninterventions) and energy (e.g., wind plant monitoring and basestationstoenablelowlatency,proximity,highbandwidth,\nmaintenance).",
      "size": 965,
      "sentences": 4
    },
    {
      "id": 16,
      "content": "nt monitoring and adoptedin5Gtorefertothedeploymentofcloudserversinthe\ninterventions) and energy (e.g., wind plant monitoring and basestationstoenablelowlatency,proximity,highbandwidth,\nmaintenance). real time radio network information and location awareness. Specifically, the concept was defined in late 2014 by the\nD. Contributions and outline European Telecommunications Standards Institute (ETSI): As\nIn this paper, we analyze the key technologies for the next a complement of the C-RAN architecture, MEC aims to unite\ngeneration of IoT systems, and the tradeoffs between perfor- the telecommunication and IT cloud services to provide the\n=== 페이지 3 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 3\ncloud-computing capabilities within radio access networks\nin the close vicinity of mobile users [9]. One of the areas\nof more research has been the network virtualization and Devices eNB-Ledger\nslicing with the MEC paradigm [10].",
      "size": 938,
      "sentences": 4
    },
    {
      "id": 17,
      "content": "ithin radio access networks\nin the close vicinity of mobile users [9]. One of the areas\nof more research has been the network virtualization and Devices eNB-Ledger\nslicing with the MEC paradigm [10]. In the Radio Access\nNetwork, several authors have looked at the potential of edge\ncomputing to support Ultra-Reliable Low-Latency Communi- Sync msg S y\nn\ncation (URLLC) [11]–[13]. Another research area is the use c\nof machine learning, particularly deep learning techniques, to Preamble R\na\nunleash the full potential of IoT edge computing and enable Response n d\na wider range of application scenarios [14], [15]. However, RRC req o m\nmost previous works address the communications separately.",
      "size": 694,
      "sentences": 5
    },
    {
      "id": 18,
      "content": "ash the full potential of IoT edge computing and enable Response n d\na wider range of application scenarios [14], [15]. However, RRC req o m\nmost previous works address the communications separately. A\nContention c\nEven though several papers address the joint communication c e\ns\nand computation resource management [16], they represent s\nonly the first step towards a holistic design of iIoTe and Record Data D\nits defining technologies, as well as the integration with the a\nta\ncommunication infrastructure. T\nra\nTo optimize the energy efficiency of iIoTe, it is interesting Confirmation n\ns\ntochooseacommunicationtechnologythatensureslowpower m\nis\nconsumption and massive connections of devices. In this s\nio\nregard, 3GPP introduced narrowband Internet of Things (NB- n\nIoT),acellulartechnologytoutilizelimitedlicensedspectrum\nof existing mobile networks to handle a limited amount of bi-\nUplink Downlink Verification\ndirectional IoT traffic.",
      "size": 945,
      "sentences": 5
    },
    {
      "id": 19,
      "content": "Internet of Things (NB- n\nIoT),acellulartechnologytoutilizelimitedlicensedspectrum\nof existing mobile networks to handle a limited amount of bi-\nUplink Downlink Verification\ndirectional IoT traffic. Although it uses LTE bands or guard-\nbands,itisusuallyclassifiedasa5Gtechnology.Itcanachieve\nFig. 2: Random Access procedure in NB-IoT\nup to 250 kbps peak data rate over 180 kHz bandwidth on a\nLTE band or guard-band [17] [18]. Compared to other low-power technologies, NB-IoT is\ninteresting for IoT applications with more frequent commu-\npseudo-randomhoppingsequence.TheNPRACHisscheduled\nnications. This is the case for the ones considered in iIoTe,\nto occur periodically in specific subframes; these are reserved\nwhere the intelligent end devices share the updated models\nfor the RA requests and are commonly known as Random\nfrequently and must record new transactions in the ledger. At\nAccess Opportunitys (RAOs).",
      "size": 914,
      "sentences": 6
    },
    {
      "id": 20,
      "content": "ere the intelligent end devices share the updated models\nfor the RA requests and are commonly known as Random\nfrequently and must record new transactions in the ledger. At\nAccess Opportunitys (RAOs). To initiate the RA procedure,\nthe same time, NB-IoT keeps the advantages of Low-Power\nthe devices select the initial subcarrier randomly, generate the\nWideArea(LPWA)technologies:lowpowerconsumptionand\nhopping sequence, and transmit it at the next available RAO. simplicity. Throughout the rest of the paper, we use NB-IoT\nThe orthogonality of preambles implies that multiple devices\nas a representative wireless technology for our analyses of\ncan access the base station in the same RAO if they select\niIoTe. Other wireless technologies will follow similar access\ndifferent preambles. Next, the grants are transmitted to the\nprocedures and energy-performance trade-offs.",
      "size": 870,
      "sentences": 7
    },
    {
      "id": 21,
      "content": "in the same RAO if they select\niIoTe. Other wireless technologies will follow similar access\ndifferent preambles. Next, the grants are transmitted to the\nprocedures and energy-performance trade-offs. devices through the Narrowband Physical Downlink Control\nFor an analysis of the energy consumption and battery\nChannel (PDCCH) (NPDCCH) within a predefined period\nlifetimeofNB-IoTunderdifferentconfigurationswereferthe\nknown as the RA response window. However, the number\nreaderto[19].Akeypointforthisanalysisisthestudyofthe\nof preambles is finite and collisions can happen. In case of\ncommunication exchange during the access procedure: The\ncollision,eachcollideddevicemayretransmitapreambleafter\ndevices that attempt to communicate through a base station\na randomly selected backoff time. must first complete a Random Access (RA) procedure to\ntransit from Radio Resource Control (RRC) idle mode to Thespecificationprovidessufficientflexibilityintheconfig-\nRRC connected mode.",
      "size": 976,
      "sentences": 7
    },
    {
      "id": 22,
      "content": "ackoff time. must first complete a Random Access (RA) procedure to\ntransit from Radio Resource Control (RRC) idle mode to Thespecificationprovidessufficientflexibilityintheconfig-\nRRC connected mode. Only in RRC connected mode data urationoftheRAprocess,whichmakesitfeasibletoadjustthe\ncan be transmitted in the uplink through the Physical Uplink protocolandfindtherightbalancebetweenreliability,latency,\nShared Channel (PUSCH) or in the downlink through the and energy consumption for a given application. Specifically,\nPhysical Downlink Shared Channel (PDSCH). The standard thenetworkconfiguresthepreambleformatandthemaximum\n3GPP RA procedure consists of four message exchanges: number of preamble transmission depending on the cell size,\npreamble (Msg1), uplink grant (Msg2), connection request and this has an impact on the preamble and the total dura-\n(Msg3),andcontentionresolution(Msg4)(seeFigure2where tion [20].",
      "size": 920,
      "sentences": 5
    },
    {
      "id": 23,
      "content": "g on the cell size,\npreamble (Msg1), uplink grant (Msg2), connection request and this has an impact on the preamble and the total dura-\n(Msg3),andcontentionresolution(Msg4)(seeFigure2where tion [20]. Increasing the number of preamble transmissions\nthe example of recording some data, e.g., a DLT transaction reducestheerasureprobability,butatthecostofhigherenergy\nis depicted). Out of these, Msg3 and Msg4 are scheduled consumption and larger latency. The same energy-reliability-\ntransmissions where no contention takes place. latency tradeoff applies to other messages, including the RA\nThe NB-IoT preamble are orthogonal resources transmit- response. Moreover, scheduling the NPRACH and NPDCCH\nted in the Narrowband Physical Random Access Channel consumes resources that would otherwise be used for data\n(PRACH) (NPRACH) and used to perform the RA request transmission. Therefore, each implementation must find an\n(Msg1).",
      "size": 924,
      "sentences": 7
    },
    {
      "id": 24,
      "content": "al Random Access Channel consumes resources that would otherwise be used for data\n(PRACH) (NPRACH) and used to perform the RA request transmission. Therefore, each implementation must find an\n(Msg1). A preamble is defined by a unique single-tone and adequate balance between the amount of resources dedicated\n[표 데이터 감지됨]\n\n=== 페이지 4 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 4\nto NPRACH, NPDCCH, PUSCH, and PDSCH1. absence of a central coordinator/helper. While such sparsi-\nfication improves energy and communication efficiencies, it\ncouldyieldhigherlearningconvergencespeedaswellaslower\nB. Distributed Learning over Wireless Networks\ntraining and inference accuracy, in which sparsity needs to be\nImplementing intelligent IoT systems with distributed optimized in terms of the trade-off between communication\nML/AI over wireless networks (e.g., NB-IoT) needs to con- cost and convergence speed.",
      "size": 906,
      "sentences": 6
    },
    {
      "id": 25,
      "content": "e\nImplementing intelligent IoT systems with distributed optimized in terms of the trade-off between communication\nML/AI over wireless networks (e.g., NB-IoT) needs to con- cost and convergence speed. In this view, several sparse-\nsider the impact of the communication network (latency and topology-based distributed learning methods including decen-\nreliabilityundercommunicationoverheadandchanneldynam- tralized Gradient Descent (GD), dual averaging [42], learning\nics)andon-deviceconstraints(accesstodata,energy,memory, over graphs [43], [44] and GADMM algorithms [45], [46]\ncompute, and privacy, etc.). Obtaining high-quality trained have been investigated. models without sharing raw data is of utmost importance, and\nredounds to the trustworthiness of the system.",
      "size": 768,
      "sentences": 4
    },
    {
      "id": 26,
      "content": "], [46]\ncompute, and privacy, etc.). Obtaining high-quality trained have been investigated. models without sharing raw data is of utmost importance, and\nredounds to the trustworthiness of the system. In this view,\nC. Optimizing IoT Application Deployments in IoT Environ-\nFederated Learning (FL) has received a groundswell interest\nments\nin both academia and industry, whose underlying principle is\nto train a ML model by exchanging model parameters (e.g., IoT applications typically consist of multiple components. Neural Network (NN) weights and/or gradients) among edge For instance, an IoT application could comprise components\ndevices under the orchestration of a federation server and for secure data acquisition (e.g., based on Blockchain), data\nwithout revealing raw data [21].",
      "size": 785,
      "sentences": 5
    },
    {
      "id": 27,
      "content": "an IoT application could comprise components\ndevices under the orchestration of a federation server and for secure data acquisition (e.g., based on Blockchain), data\nwithout revealing raw data [21]. Therein, devices periodically pre-processing,feedingthedataintoaneuralnetwork(oreven\nupload their model parameters after their local training to a through multiple ones) before it acts upon the outcome of\nparameter server, which in return does model averaging and the ML inference, etc. In many cases, such composed IoT\nbroadcasting the resultant global model to all devices.",
      "size": 574,
      "sentences": 3
    },
    {
      "id": 28,
      "content": "it acts upon the outcome of\nparameter server, which in return does model averaging and the ML inference, etc. In many cases, such composed IoT\nbroadcasting the resultant global model to all devices. FL has applications need to be distributed over multiple, connected\nbeenproposedbyGoogleforitspredictivekeyboards[22]and intelligentIoTdevices.Animportantaspectisthentooptimize\nlateronadoptedindifferentusecasesintheareasofintelligent thisallocationofapplicationcomponentstodevices.Theresult\ntransportation,healthcareandindustrialautomation,andmany of the allocation is an assignment of components to devices,\nothers [23], [24]. While FL is designed for training over that fulfills the constraints, and optimizes the performance of\nhomogeneous agents with a common objective, recent studies the system in some metric.",
      "size": 815,
      "sentences": 4
    },
    {
      "id": 29,
      "content": "23], [24]. While FL is designed for training over that fulfills the constraints, and optimizes the performance of\nhomogeneous agents with a common objective, recent studies the system in some metric. This metric could, for example,\nhave extended the focus towards personalization (i.e., multi- maximize the responsiveness of the application or minimize\ntask learning) [25], training over dynamic topologies [26] and the overall energy consumption, where the latter is reasonable\nrobustness guarantees [27], [28]. In terms of improving data in battery-run wireless systems. An overview of existing\nprivacyagainstmaliciousattackers,variousprivacy-preserving allocation approaches is given in [47]. methods including injecting fine-tuned noise into model pa- Previous work [48] used Constraint Programming to de-\nrameters via a differential privacy mechanism [29]–[32] and scribeanapproachfortheefficientdistributionofactorstoIoT\nmixingmodelparametersovertheairviaanalogtransmissions devices.",
      "size": 989,
      "sentences": 6
    },
    {
      "id": 30,
      "content": "Programming to de-\nrameters via a differential privacy mechanism [29]–[32] and scribeanapproachfortheefficientdistributionofactorstoIoT\nmixingmodelparametersovertheairviaanalogtransmissions devices. The approach resembles the Quadratic Assignment\n[33], [34] have been recently investigated. Despite of the Problem(QAP)andisNP-hard,resultinginlongcomputation\nadvancements in FL design, one main drawback in the design times when scaling up. Samie et al. [49] present another Con-\nof FL is that its communication overhead is proportional to straint Programming-based approach that takes into account\nthe number of model parameters calling for the design of thebandwidthlimitationsandminimizingenergyconsumption\ncommunication-efficient FL. In an edge setup with limited of IoT nodes.",
      "size": 780,
      "sentences": 6
    },
    {
      "id": 31,
      "content": "kes into account\nthe number of model parameters calling for the design of thebandwidthlimitationsandminimizingenergyconsumption\ncommunication-efficient FL. In an edge setup with limited of IoT nodes. The system optimizes computation offloading\nresources in communication and computation, this introduces from an IoT node to a gateway, however, it does not consider\ntraining stragglers degrading the overall training performance. composed computations that can be distributed to multiple\nIn this view, client scheduling [35]–[37] and computation devices. offloading [38]–[40] with the focus on guaranteeing target A Game Theory-based approach is presented in [50] that\ntraining/inferenceaccuracyhavebeenidentifiedasapromising aims at the joint optimization of radio and computational\nresearch direction. resources of mobile devices.",
      "size": 831,
      "sentences": 6
    },
    {
      "id": 32,
      "content": "approach is presented in [50] that\ntraining/inferenceaccuracyhavebeenidentifiedasapromising aims at the joint optimization of radio and computational\nresearch direction. resources of mobile devices. However, the system local op-\nWith client scheduling, the number of communication links timum for multiple users only aims at deciding whether to\nare reduced (known as link sparcification) and thus, the com- fully offload a computation or to fully process it on device. munication bandwidth and energy consumption of distributed BasedonNon-linearIntegerProgramming,Sahnietal. [51]\nlearning can be significantly decreased.",
      "size": 620,
      "sentences": 5
    },
    {
      "id": 33,
      "content": "a computation or to fully process it on device. munication bandwidth and energy consumption of distributed BasedonNon-linearIntegerProgramming,Sahnietal. [51]\nlearning can be significantly decreased. Additional temporal present their Edge Mesh algorithm for task allocation that\nlink sparsity can be introduced by enforcing model sharing optimizes overall energy consumption and considers data\npolicies that account model changes and/or importance within distribution, task dependency, embedded device constraints,\nconsecutive training iterations such as the Lazy Aggregated and device heterogeneity. However, only basic evaluation\nGradient Descent (LAG) method [41]. Sparsity can be further and experimentation are done, without performance compar-\nexploited by adopting sparse network topologies, which rely ison.",
      "size": 815,
      "sentences": 6
    },
    {
      "id": 34,
      "content": "asic evaluation\nGradient Descent (LAG) method [41]. Sparsity can be further and experimentation are done, without performance compar-\nexploited by adopting sparse network topologies, which rely ison. Based on Integer Linear Programming (ILP), Mohan\non communications within a limited neighborhood in the & Kangasharju [52] propose a task assignment solver that\nfirst minimizes the processing cost and secondly optimizes\n1Itisworthmentioningthat5GhasnotdefinedaRAprocedureyetbutit the network cost, which stems from the assumption that\nisexpectedthat,whenthishappens,itwillbeheavilybasedonthedescribed\nEdge resources may not be highly processing-capable. An\nprocedure for LTE and the energy consumption/latency tradeoff will follow\nsimilarprinciples. intermediarystepreducesthesub-problemspacebycombining\n=== 페이지 5 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 5\ntasksandjobswiththesameassociatedcosts.Thisreducesthe and vehicular networks [65].",
      "size": 951,
      "sentences": 5
    },
    {
      "id": 35,
      "content": "termediarystepreducesthesub-problemspacebycombining\n=== 페이지 5 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 5\ntasksandjobswiththesameassociatedcosts.Thisreducesthe and vehicular networks [65]. In the smart manufacturing area,\noverall processing costs. the work described in [64] investigates DLT-based security\nCardellini et al. [53] describe a comprehensive ILP-based and trust mechanisms and elaborates a particular application\nframework for optimally placing operators of distributed of DLTs for quality assurance, which is one of the strategic\nstreamprocessingapplications,whilebeingflexibleenoughto priorities of smart manufacturing. Data generated in a smart\nbe adjusted to other application contexts. Different optimiza- manufacturing process can be leveraged to retrieve material\ntion goals are considered, e.g., application response time and provenance, facilitate equipment management, increase trans-\navailability.",
      "size": 932,
      "sentences": 6
    },
    {
      "id": 36,
      "content": "- manufacturing process can be leveraged to retrieve material\ntion goals are considered, e.g., application response time and provenance, facilitate equipment management, increase trans-\navailability. They propose their solution as a unified general action efficiency, and create a flexible pricing mechanism. formulation of the optimal placement problem and provide an One of the challenges of implementing DLT in IoT and\nappropriate theoretical foundation. The framework is flexible edgecomputingisthelimitedcomputationandcommunication\nso that it can be extended by adding further constraints or capabilitiesofsomeofthenodes.Inthisregard,theauthorsin\nshiftedtootheroptimizationtargets.Finally,ourpreviouswork [60],[66]workedonthecommunicationaspectsofintegrating\n[54]hasleveragedCardellini’sframeworkandhasextendedit DLTs with IoT systems.",
      "size": 840,
      "sentences": 4
    },
    {
      "id": 37,
      "content": "eauthorsin\nshiftedtootheroptimizationtargets.Finally,ourpreviouswork [60],[66]workedonthecommunicationaspectsofintegrating\n[54]hasleveragedCardellini’sframeworkandhasextendedit DLTs with IoT systems. The authors studied the trade-off\nby incorporating further constraints for the optimization goal, between the wireless communication and the trustworthiness\nnamely the overall energy usage of the application. with two wireless technologies, LoRa and NB-IoT. III. ENABLINGTECHNOLOGIESFORIIOTE\nD. Distributed Ledger Technologies over Wireless Networks\nThis section elaborates on the three enabling technologies\nIn recent years, DLT has been the focus of large research\nfor iIoTe: distributed learning, distributed computing, and\neffortsspanningseveralapplicationdomains.Startingwiththe\ndistributed ledgers.",
      "size": 804,
      "sentences": 5
    },
    {
      "id": 38,
      "content": "ies\nIn recent years, DLT has been the focus of large research\nfor iIoTe: distributed learning, distributed computing, and\neffortsspanningseveralapplicationdomains.Startingwiththe\ndistributed ledgers. adoption of Bitcoin and Blockchain, DLT has received a lot\nof attention in the realm of IoT, as the technology promises\nA. Energy-efficient Distributed Learning over Wireless Net-\nto help address some of the IoT security and scalability\nworks\nchallenges[55].Forinstance,inIoTdeployments,therecorded\ndata are either centralized or spread out across different het- As shown in Figure 1, each end device in the iIoTe has\nerogeneous parties. These data can be both public or private, local AI and the whole system relies on FL. We present\nwhichmakesitdifficulttovalidatetheiroriginandconsistency.",
      "size": 792,
      "sentences": 4
    },
    {
      "id": 39,
      "content": "device in the iIoTe has\nerogeneous parties. These data can be both public or private, local AI and the whole system relies on FL. We present\nwhichmakesitdifficulttovalidatetheiroriginandconsistency. learning frameworks that are suitable for iIoTe leveraging\nIn addition, querying and performing operations on the data two techniques: (1) spatial and temporal sparsity; and (2)\nbecomesachallengeduetotheincompatibilitybetweendiffer- quantization. ent Application Programming Interfaces (APIs). For instance, 1) Dynamic GADMM: Standard FL requires a central en-\nNon-Governmental Organizations (NGOs), Public and Private tity, which plays the role of a parameter server (PS). At every\nsectors, and industrial companies may use different data types iteration, all nodes need to communicate with the PS, which\nand databases, which leads to difficulties when sharing the may not be an energy-efficient solution especially for a large\ndata [56].",
      "size": 938,
      "sentences": 7
    },
    {
      "id": 40,
      "content": "types iteration, all nodes need to communicate with the PS, which\nand databases, which leads to difficulties when sharing the may not be an energy-efficient solution especially for a large\ndata [56]. A DLT system offers a tamper-proof ledger that distributednetworkofagents/workers,asinthemanufacturing\nis distributed on a collection of communicating nodes, all usecase.Furthermore,aPS-basedapproachisvulnerabletoa\nsharingthesameinitialblockofinformation,thegenesisblock singlepointofattackorfailure.Toovercomethisproblemand\n[57]. In order to publish data to the ledger, a node includes ensure a more energy-efficient solution, we propose a variant\ndata formatted in transactions in a block with a pointer to its of the standard Alternative Direction Method of Multipliers\nprevious block, which creates a chain of blocks, the so called (ADMM)[67]methodthatdecomposestheproblemintoaset\nBlockchain. ofsubproblemsthataresolvedinparallel,referredtoasGroup\nADMM (GADMM) [45].",
      "size": 970,
      "sentences": 4
    },
    {
      "id": 41,
      "content": "s\nprevious block, which creates a chain of blocks, the so called (ADMM)[67]methodthatdecomposestheproblemintoaset\nBlockchain. ofsubproblemsthataresolvedinparallel,referredtoasGroup\nADMM (GADMM) [45]. GADMM extends the standard\nA smart contract [58] is a distributed app that lives in the\nADMMtodecentralizedtopologyandenablescommunication\nBlockchain. This app is, in essence, a programming language\nand energy-efficient distributed learning by leveraging spatial\nclass with fields and methods, and they are executed in a\nsparsity, i.e. enforcing each worker to communicate with at\ntransparent manner on all nodes participating in a Blockchain\nmost two neighbouring workers. In GADMM, the standard\n[59].",
      "size": 702,
      "sentences": 6
    },
    {
      "id": 42,
      "content": "are executed in a\nsparsity, i.e. enforcing each worker to communicate with at\ntransparent manner on all nodes participating in a Blockchain\nmost two neighbouring workers. In GADMM, the standard\n[59]. Smart contracts are the main blockchain-powered mech-\nlearningproblem(P1)isre-formulatedasthefollowinglearn-\nanism that is likely to gain a wide acceptance in IoT, where\ning problem (P2):\ntheycanencodetransactionlogicandpolicies,whichincludes\nthe requirements and obligations of parties requesting access, 𝑁\nthe IoT resource/service provider, as well as data trading (P1) min {𝜽𝑛}\n𝑛\n𝑁\n=1𝑛\n(cid:205)\n=1\n𝑓 𝑛(𝜽𝑛) (1)\nover wireless IoT networks [60]. With the aforementioned\ncharacteristics, the advantages of the integration of DLTs into 𝑁\nwireless IoT networks consist of: i) guarantee of immutability (P2) min {𝜽𝑛}\n𝑛\n𝑁\n=1𝑛\n(cid:205)\n=1\n𝑓 𝑛(𝜽𝑛)\n(2)\nand transparency for recorded IoT data; ii) removal of the\nneedforthirdparties;iii)developmentofatransparentsystem\ns.t. 𝜽𝑛 =𝜽𝑛+1 , for 𝑛=1,··· ,𝑁 −1.",
      "size": 996,
      "sentences": 6
    },
    {
      "id": 43,
      "content": "ty (P2) min {𝜽𝑛}\n𝑛\n𝑁\n=1𝑛\n(cid:205)\n=1\n𝑓 𝑛(𝜽𝑛)\n(2)\nand transparency for recorded IoT data; ii) removal of the\nneedforthirdparties;iii)developmentofatransparentsystem\ns.t. 𝜽𝑛 =𝜽𝑛+1 , for 𝑛=1,··· ,𝑁 −1. for heterogeneous IoT networks to prevent tampering and To this end, GADMM divides the set of workers into two\ninjection of fake data from the stakeholders. groups head and tail. Thanks to the equality constraint of\nDLTshavebeenappliedinvariousIoTareassuchashealth- (P2), each worker from the head/tail group exchanges model\ncare [61], [62], supply chain [63], smart manufacturing [64], with only two workers from the tail/head group forming a\n=== 페이지 6 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 6\nchain topology. At iteration 𝑘 +1, giving the models of the\ntail workers and the dual variables at iteration 𝑘, all head\n102\nworkers update their models in parallel since they have no\njoint constraints.",
      "size": 911,
      "sentences": 6
    },
    {
      "id": 44,
      "content": "in topology. At iteration 𝑘 +1, giving the models of the\ntail workers and the dual variables at iteration 𝑘, all head\n102\nworkers update their models in parallel since they have no\njoint constraints. Once the head workers update their models,\ntheytransmittheirupdatedmodeltotheirneighboursfromthe 100\ntail group. Then, following the same way, every tail worker\nupdates its model. Finally, the dual variables are updated\nlocally at each worker. Following this alternation, GADMM\n10-2\nallows at most 𝑁/2 workers to compete over the available\nbandwidthcomparedto 𝑁 workersforthePS-basedapproach. 10-4\nWith that, GADMM can significantly increase the bandwidth 0 500 1000 1500 2000 2500 3000\nNumber of iterations\navailable to each worker, which reduces the energy wasted in\n(a)\ncompetition for communication resources. The energy expen-\nditureforcommunicationisfurtherreducedbyincludingonly\ntwoneighbouringworkers.Thedetailedalgorithmisdescribed\nin [45].",
      "size": 949,
      "sentences": 8
    },
    {
      "id": 45,
      "content": "e energy wasted in\n(a)\ncompetition for communication resources. The energy expen-\nditureforcommunicationisfurtherreducedbyincludingonly\ntwoneighbouringworkers.Thedetailedalgorithmisdescribed\nin [45]. One drawback of GADMM is attributed to its slow conver-\ngence compared to standard ADMM. In other words, due to\nthesparsificationofthegraph,workersrequiremoreiterations\nfor the convergence. To alleviate this issue and combine the\nfastconvergenceofstandardADMMwiththecommunication-\nefficiencyofGADMM,wehaveproposedDynamicGADMM\n(D-GADMM) [45]. Not only D-GADMM improves the con-\nvergence speed of GADMM, but it also copes with dynamic\n(time-variant) networks, in which the workers are moving\n(e.g., the AGVs in the manufacturing plant or the tractors\nin the agriculture use case), while inheriting the theoretical\nconvergence guarantees of GADMM.",
      "size": 844,
      "sentences": 6
    },
    {
      "id": 46,
      "content": "t) networks, in which the workers are moving\n(e.g., the AGVs in the manufacturing plant or the tractors\nin the agriculture use case), while inheriting the theoretical\nconvergence guarantees of GADMM. In a nutshell, every\ncoupleofiterationsinD-GADMM,i.e.systemcoherencetime,\ntwo things are changing: (i) workers assignment to head/tail\ngroup,whichfollowsapredefinedassignmentmechanismand\n(ii) neighbours of each worker from the other group. The idea\nat high level as is follows: the workers are given fixed IDs,\nand they share a pseudo-random code that is used every 𝜏\nseconds, where 𝜏 is the system coherence time to generate a\nset of random integers with cardinality 𝑁/2−2. If 𝑛 belongs\nto the set, then worker 𝑛 is a head worker for this period. The assumption is that workers 1 and 𝑁 do not change their\nassignment. i.e., worker 1 is always a head and worker 𝑁 is\nalways a tail.",
      "size": 881,
      "sentences": 6
    },
    {
      "id": 47,
      "content": "longs\nto the set, then worker 𝑛 is a head worker for this period. The assumption is that workers 1 and 𝑁 do not change their\nassignment. i.e., worker 1 is always a head and worker 𝑁 is\nalways a tail. Head workers broadcast their IDs alongside a\npilot signal, then tail workers compute their communication\ncost to all head workers, and share the cost vector with\nthe neighboring heads. If a tail does not receive a signal\nfrom a certain head, the cost to that head is ∞, the same\napplies to heads. Subsequently, every head locally computes\nthecommunication-efficientchainusingapredefinedheuristic\nand share it with its neighboring tails. This approach requires\ntwo communication rounds and guarantees that every head\nwill compute the same chain.",
      "size": 744,
      "sentences": 7
    },
    {
      "id": 48,
      "content": "munication-efficientchainusingapredefinedheuristic\nand share it with its neighboring tails. This approach requires\ntwo communication rounds and guarantees that every head\nwill compute the same chain. Once the chain information is\ncalculated, each worker will share its right dual variable with\nits right neighbor to be used by both workers and GADMM\ncontinuesfor 𝜏 seconds.Itisworthmentioningthatwecould,\ne.g., start with a chain 1 − 2 − 3 − ··· − 𝑁 and move to\n1 − 5 − 7 − 4 − ··· − 𝑁, so only nodes 1 and 𝑁 preserve\ntheir assignments. For further details, the reader is referred\nto [45] where a comprehensive explanation of the steps of\nD-GADMM can be found. InFig.3,weplottheobjectiveerrorintermsofthenumber\nssoL\nADMM\nGADMM\nD-GADMM, refresh rate =1\nD-GADMM, refresh rate =10\nD-GADMM, refresh rate =50\n102\n100\n10-2\n10-4\n02 4 6 8 10\nSum energy 1010\n(b)\nssoL\nADMM\nGADMM\nD-GADMM, refresh rate =1\nD-GADMM, refresh rate =10\nD-GADMM, refresh rate =50\nFig.",
      "size": 951,
      "sentences": 5
    },
    {
      "id": 49,
      "content": "D-GADMM, refresh rate =10\nD-GADMM, refresh rate =50\n102\n100\n10-2\n10-4\n02 4 6 8 10\nSum energy 1010\n(b)\nssoL\nADMM\nGADMM\nD-GADMM, refresh rate =1\nD-GADMM, refresh rate =10\nD-GADMM, refresh rate =50\nFig. 3: D-GADMM: loss as a function of (a) number of\niterations and (b) total energy consumption. of iterations (left) and in terms of sum energy (right) for\nD-GADMM as well as GADMM and standard ADMM. As\nwe can see from Fig. 3, D-GADMM greatly increases the\nconvergencespeedofGADMMandthusdecreasestheoverall\ncommunication cost for fixed topology. As a consequence, D-\nGADMM achieves convergence speed comparable to the PS-\nbased ADMM while maintaining GADMM’s low communi-\ncation cost per iteration.",
      "size": 695,
      "sentences": 6
    },
    {
      "id": 50,
      "content": "overall\ncommunication cost for fixed topology. As a consequence, D-\nGADMM achieves convergence speed comparable to the PS-\nbased ADMM while maintaining GADMM’s low communi-\ncation cost per iteration. 2) Censored Quantized Generalized GADMM: As pointed\nout earlier, each worker, in the GADMM framework, ex-\nchanges its model with up to two neighbouring workers only,\nwhichslowsdownconvergence.Toreducethecommunication\noverhead while generalizing to more generic network topolo-\ngies,weproposetheGeneralizedGADMM(GGADMM)[46]. Underthisgeneralizedframework,theworkersarestilldivided\nintotwogroups:headandtail,withpossiblydifferentsizes.In\notherwords,thetopologyisgeneralizedfromachaintopology\nto any bipartite graph where the number of neighbours, that\neach worker can communicate with can be any arbitrary\nnumber and not necessarily limited to two. By leveraging\nthe censoring idea, i.e.",
      "size": 885,
      "sentences": 5
    },
    {
      "id": 51,
      "content": "ogy\nto any bipartite graph where the number of neighbours, that\neach worker can communicate with can be any arbitrary\nnumber and not necessarily limited to two. By leveraging\nthe censoring idea, i.e. temporal sparsity, we introduce the\nCensored GGADMM (C-GGADMM) where each worker ex-\nchanges its model only if the difference between its current\nand previous models is greater than a certain threshold. To\nmake the algorithm more communication-efficient, censoring\nis applied on the quantized version of the worker’s model\ninstead of the model itself to get the Censored Quantized\nGGADMM (CQ-GGADMM) [46], [68]. CQ-GGADMM can\nsignificantly reduce the communication overhead, particularly\n=== 페이지 7 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 7\n100\n10-2\n10-4\n10-6\n10-8\n0 200 400 600 800 1000 1200 1400\nNumber of iterations\n(a)\nssoL\nC-ADMM\nGGADMM\nC-GGADMM\nCQ-GGADMM\n100\n10-2\n10-4\n10-6\n10-8\n0 500 1000 1500 2000 2500 3000\nSum energy\n(b)\nssoL\naccess to the bandwidth.",
      "size": 972,
      "sentences": 5
    },
    {
      "id": 52,
      "content": "0-8\n0 200 400 600 800 1000 1200 1400\nNumber of iterations\n(a)\nssoL\nC-ADMM\nGGADMM\nC-GGADMM\nCQ-GGADMM\n100\n10-2\n10-4\n10-6\n10-8\n0 500 1000 1500 2000 2500 3000\nSum energy\n(b)\nssoL\naccess to the bandwidth. B. Optimizing Energy Consumption of Wireless IoT Environ-\nments\nThe next pillar in iIoTe is edge computing. Specifically, we\nconsidertheproblemofallocatingtheapplicationcomponents\nto the available end devices. As first presented in [54], we ex-\ntend the Integer Linear Programming (ILP) based framework\ndefined by Cardellini et al. [53] (Section II-C). In [54] the\ngoal was to minimize the overall energy consumption needed\nforexecutinganIoTapplication.TheformulatedILPmodelis\ndescribed below. The optimality can be determined with this\nby feeding it into a solver, such as IBM CPLEX2. C-ADMM\nGGADMM We define optimality of the allocation by total energy use\nC-GGADMM over one execution of an IoT application.",
      "size": 909,
      "sentences": 8
    },
    {
      "id": 53,
      "content": "an be determined with this\nby feeding it into a solver, such as IBM CPLEX2. C-ADMM\nGGADMM We define optimality of the allocation by total energy use\nC-GGADMM over one execution of an IoT application. Energy during the\nCQ-GGADMM\napplication’s execution is consumed in two phases: (1) device\nenergy, consumed by a device when executing a component;\n(2) and edge network energy, consumed by the device when\nsending the result of the calculation over the network. Note\nthat “optimal” in this case only describes optimality in the\nintegermodel.Giventheconstraintsandthemodel,wefindthe\noptimal assignment, i.e. the one with minimal energy usage. The optimal network configuration is the assignment of\napplication components to devices that result in the lowest\ntotal consumption of energy and satisfies the constraints. The\nFig. 4: CQ-GGADMM: loss as a function of (a) number of\nconstraints concern the requirements that an assignment must\niterations and (b) total energy consumption.",
      "size": 978,
      "sentences": 8
    },
    {
      "id": 54,
      "content": "rgy and satisfies the constraints. The\nFig. 4: CQ-GGADMM: loss as a function of (a) number of\nconstraints concern the requirements that an assignment must\niterations and (b) total energy consumption. satisfy: Each component should only be allocated once and\nresource requirements for assigned components should not\nexceed the resources of the node. This problem is a form of\nfor large model size 𝑑, since its payload size is (𝑏𝑑+32) bits\nthe quadratic assignment problem, and thus is NP-hard. comparedtothepayloadsizeof32𝑑 bitsforthefullprecision\n1) System model: The application consists of a set of\nGGADMM. Since according to the Shannon’s capacity theo-\ncomponents and edges that interconnect them, modeled as\nrem,morebitsconsumemoretransmissionenergyforthesame a weighted undirected graph G = (cid:0) V ,E (cid:1) .",
      "size": 819,
      "sentences": 7
    },
    {
      "id": 55,
      "content": "ding to the Shannon’s capacity theo-\ncomponents and edges that interconnect them, modeled as\nrem,morebitsconsumemoretransmissionenergyforthesame a weighted undirected graph G = (cid:0) V ,E (cid:1) . Graph\nbandwidth, transmission duration, and noise spectral density, app app app\nG is multi-partite, with vertex set V containing the\nthecommunicationenergyofCQ-GGADMM,comparedtothe app app\napplication components, |V | = 𝑁, and edge set E ⊂\no G r G ig A in D al M G M AD in M he M ri , ts is t s h i e gn s i a fi m ca e nt p ly er r f e o d rm uc a e n d c . e Th an eo d re c t o ic n a v l e ly rg , e C n Q ce - (cid:8)𝑡 1 𝑡 2 :𝑡 𝑖 ∈V app ,𝑖 =1,2 (cid:9) rep a r p e p senting the logical connec ap t p ions\nbetween components 𝑡 𝑖.\nguarantees of vanilla GGADMM, provided that the censoring\nAnalogously, the network infrastructure where the com-\nthreshold sequence is non-increasing and non-negative. ponents can be evaluated is modeled with the multi-partite\nFig.",
      "size": 966,
      "sentences": 4
    },
    {
      "id": 56,
      "content": "ovided that the censoring\nAnalogously, the network infrastructure where the com-\nthreshold sequence is non-increasing and non-negative. ponents can be evaluated is modeled with the multi-partite\nFig. 4 compares CQ-GGADMM with Censored ADMM\ngraph G = (V ,E ) with vertex set V containing the\n(C-ADMM), GGADMM, as well as C-GGADMM in terms net net net net\ncommunicating nodes, with cardinality |V | = 𝑀, and edge\nof the loss versus the number of iterations (left) and versus net\nthe total sum energy (right) for a system of 18 workers on a set E net ⊂ {𝑡 1 𝑡 2 :𝑡 𝑖 ∈V net ,𝑛=1,2} representing the wireless\nand wired links among nodes 𝑛 𝑖. The result of the allocation\nlinearregressiontaskusingtheBodyFatdataset[69].Wecan\nis a matrix 𝑋 = V ×V where 𝑋[𝑡,𝑛] = 1 if and only\nobserve, from Fig. 4, that CQ-GGADMM exhibits the low- app net\nif component 𝑡 is allocated to node 𝑛. We also define 𝐸 𝑑 to\nest total communication energy, followed by C-GGADMM,\nbe the device energy and 𝐸 𝑛 the network energy.",
      "size": 996,
      "sentences": 6
    },
    {
      "id": 57,
      "content": "CQ-GGADMM exhibits the low- app net\nif component 𝑡 is allocated to node 𝑛. We also define 𝐸 𝑑 to\nest total communication energy, followed by C-GGADMM,\nbe the device energy and 𝐸 𝑛 the network energy. 𝐸 𝑡 is then\nthen GGADMM and finally C-ADMM, while having similar\nthe total energy, and we put the constraint 𝐸 𝑑 + 𝐸 𝑛 ≤ 𝐸 𝑡.\nconvergence speed to GGADMM. This observation validates\nComponents, nodes and links have properties that are relevant\nthe benefits of censoring the quantized version of the models\nfor the energy consumption of the application once allocated. before sharing, which makes the proposed algorithm (CQ-\nThese parameters are described in Table I. 𝑆 𝑡, 𝑃 𝑛, 𝑅 𝑛 and 𝐶 𝑛\nGGADMM) more communication and energy efficient.",
      "size": 737,
      "sentences": 5
    },
    {
      "id": 58,
      "content": "e application once allocated. before sharing, which makes the proposed algorithm (CQ-\nThese parameters are described in Table I. 𝑆 𝑡, 𝑃 𝑛, 𝑅 𝑛 and 𝐶 𝑛\nGGADMM) more communication and energy efficient. aredefinedasmultiplesofsomereferencenode.Theresources\nFinally, it is worth mentioning that motivated by the fact\nof a node are expressed as a single scalar, but additional\nthat,inFL,theparameterserverisinterestedintheaggregated\nresourcerequirementscaneasilybeintroducedintothemodel. output of all workers rather than the individual output of\n2) Problem formulation: For calculating the network en-\neach worker, analog over the air aggregation schemes such\nergy,weneedtoknowwhetheralinkbetweentwocomponents\nas [34], [70]–[72] were proposed.",
      "size": 739,
      "sentences": 4
    },
    {
      "id": 59,
      "content": "f\n2) Problem formulation: For calculating the network en-\neach worker, analog over the air aggregation schemes such\nergy,weneedtoknowwhetheralinkbetweentwocomponents\nas [34], [70]–[72] were proposed. Such schemes were shown\nisassignedtoalinkbetweentwonodes.Forthis,weintroduce\nto achieve high scalability and significant savings in energy\nconsumption owing to their ability to allow non-orthogonal 2https://www.ibm.com/analytics/cplex-optimizer\n=== 페이지 8 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 8\nTABLE I: Parameters of energy-aware allocation algorithm. Symbol Description\n𝑅 𝑡 Resources required for the evaluation of component 𝑡 ∈V app . 𝑂 𝑡 Output of component 𝑡 ∈V app for a single received input. 𝑆 𝑡 Computation time required for completing component 𝑡 ∈V app once. 𝑃 𝑛 Processing power of node 𝑛 ∈V net . 𝑅 𝑛 Resources available on node 𝑛 ∈V net . 𝐶 𝑛 Energy consumption of node 𝑛 ∈V net for one unit of computation.",
      "size": 936,
      "sentences": 8
    },
    {
      "id": 60,
      "content": "equired for completing component 𝑡 ∈V app once. 𝑃 𝑛 Processing power of node 𝑛 ∈V net . 𝑅 𝑛 Resources available on node 𝑛 ∈V net . 𝐶 𝑛 Energy consumption of node 𝑛 ∈V net for one unit of computation. 𝑇 𝑙 Energy use for the transfer of one data packet over link 𝑙 ∈ 𝐸 net . 𝐷 (𝑛 1 ,𝑛 2 ) Energy cost of the shortest path between 𝑛 1 and 𝑛 2 . amatrix𝑌 =V ×V ×V ×V ,where𝑌[𝑡 ,𝑡 ,𝑛 ,𝑛 ] =1\napp app net net 1 2 1 2\nif and only if the communication between component 𝑡 and c1 end\n1 c2 c0\ncomponent 𝑡 is allocated on the network link between nodes\n2\n𝑛 and 𝑛 . This corresponds to 𝑋[𝑡 ,𝑛 ] = 1 ∧ 𝑋[𝑡 ,𝑛 ]. c0 start\n1 2 1 1 2 2\nUnfortunately, this is not a linear constraint, and thus we c3 c1\nneed to linearize the formulation. For this, we follow the c4 c2\nformulation presented in [53] and define an ILP model as:\nFig. 5: “Long” (left) and “wide” (right) composed IoT\napplications. ∀𝑡 ,𝑡 ∈V :∀𝑛 ,𝑛 ∈V :𝑌[𝑡 ,𝑡 ,𝑛 ,𝑛 ] ≤ 𝑋[𝑡 ,𝑛 ]\n1 2 app 1 2 net 1 2 1 2 1 1\n(3)\nthe average of a node’s links.",
      "size": 985,
      "sentences": 12
    },
    {
      "id": 61,
      "content": "efine an ILP model as:\nFig. 5: “Long” (left) and “wide” (right) composed IoT\napplications. ∀𝑡 ,𝑡 ∈V :∀𝑛 ,𝑛 ∈V :𝑌[𝑡 ,𝑡 ,𝑛 ,𝑛 ] ≤ 𝑋[𝑡 ,𝑛 ]\n1 2 app 1 2 net 1 2 1 2 1 1\n(3)\nthe average of a node’s links. We introduce the parameter\n∀𝑡\n1\n,𝑡\n2\n∈V\napp\n:∀𝑛\n1\n,𝑛\n2\n∈V\nnet\n:𝑌[𝑡\n1\n,𝑡\n2\n,𝑛\n1\n,𝑛\n2\n] ≤ 𝑋[𝑡\n2\n,𝑛\n2 (\n]\n4) 𝑇ˆ 𝑛 = |outgo 1 ing(𝑛)| (cid:205) 𝑒∈outgoing(𝑛) 𝑇 𝑒 that describes the average\ntransmission cost of a node’s links. ∀𝑡 ,𝑡 ∈V :∀𝑛 ,𝑛 ∈V :𝑌[𝑡 ,𝑡 ,𝑛 ,𝑛 ]\n1 2 app 1 2 net 1 2 1 2 ∑︁ ∑︁\n≥ 𝑋[𝑡 ,𝑛 ]+𝑋[𝑡 ,𝑛 ]−1 (5) 𝐶 𝑛·(𝑆 𝑡/𝑃 𝑛)·𝑋[𝑡,𝑛]+𝑂 𝑡 ·𝑇ˆ 𝑛·𝑋[𝑡,𝑛] ≤ 𝐸 𝑡\n1 1 2 2\n𝑡∈Vapp 𝑛∈Vnet\n∑︁ (11)\n∀𝑡 ∈V : 𝑋[𝑡,𝑛] =1 (6)\napp\nThe complete model reuses constraints in equations (6)\n𝑛∈Vnet\n∑︁ and(7)withtheconstraint(11).BytransformingtheQAPinto\n∀𝑛 ∈V net : 𝑋[𝑡,𝑛]·𝑅 𝑡 ≤ 𝑅 𝑛 (7) a linear problem, we greatly increase the speed of finding a\n𝑡∈Vapp\nsolution,andmaketheoptimizationfeasibleforon-lineusage.",
      "size": 887,
      "sentences": 5
    },
    {
      "id": 62,
      "content": "theconstraint(11).BytransformingtheQAPinto\n∀𝑛 ∈V net : 𝑋[𝑡,𝑛]·𝑅 𝑡 ≤ 𝑅 𝑛 (7) a linear problem, we greatly increase the speed of finding a\n𝑡∈Vapp\nsolution,andmaketheoptimizationfeasibleforon-lineusage. ∑︁ ∑︁\n𝐶 𝑛·(𝑆 𝑡/𝑃 𝑛)·𝑋[𝑡,𝑛] ≤ 𝐸 𝑑 (8) Thedrawbackisthatbyapproximatingthenetworkenergythe\n𝑡∈Vapp 𝑛∈Vnet solutionisnolongeroptimal,asitwillbeshownintheresults. ∑︁ ∑︁ 𝑂 𝑛 1 ·𝑃 𝑛 1 ,𝑛 2 ·𝑌[𝑡 1 ,𝑡 2 ,𝑛 1 ,𝑛 2 ] ≤ 𝐸 𝑛 (9) the 4) m E od va el lu u a s t i i n o g n t o h f e A P l u lo L c P a 3 tio li n ne A a l r g p o r r o it g h r m am : m W in e g im lib p r l a e r m y. en T te h d e\n(𝑡 1 ,𝑡 2 )∈Eapp 𝑛 1 ,𝑛 2 ∈Vnet\nevaluation was done by generating a random network and a\n𝐸 𝑛+𝐸 𝑑 ≤ 𝐸 𝑡 (10)\nrandom application, and letting the solver find the optimal\nallocation. where equations (3) to (5) describe the linearization of the\nnetworkmatrix𝑌.",
      "size": 843,
      "sentences": 4
    },
    {
      "id": 63,
      "content": "nerating a random network and a\n𝐸 𝑛+𝐸 𝑑 ≤ 𝐸 𝑡 (10)\nrandom application, and letting the solver find the optimal\nallocation. where equations (3) to (5) describe the linearization of the\nnetworkmatrix𝑌. (6)and(7)areforensuringthatcomponents The network configuration is generated with a variety of\nnode configurations and capabilities, reflecting a heteroge-\nare allocated only once and that resources are not exceeded,\nneous computation and communication infrastructure that one\nrespectively. Equations (8) and (9) calculate network and\ncould find in an industrial manufacturing plant (e.g., using\ndevice energy as described above. Finally, we calculate the\nSiemens range of industrial computers [74]). In the evaluated\ntotal energy use of the assignment by adding both energies in\nconfiguration, 60% of the nodes were generated as wired\n(10). The objective of the optimization is the minimization of\nnodes, and the remaining 40% are wireless nodes. Nodes are\nthe total used energy.",
      "size": 980,
      "sentences": 8
    },
    {
      "id": 64,
      "content": "onfiguration, 60% of the nodes were generated as wired\n(10). The objective of the optimization is the minimization of\nnodes, and the remaining 40% are wireless nodes. Nodes are\nthe total used energy. connected to each other with a certain probability. That prob-\n3) A Linear Heuristic for Energy-Optimized Allocation:\nability is 0.8 for wired-wired connections, 0.5 for wireless-\nThe presented QAP is NP-hard and thus compute intensive. wireless connections and 0.4 for wireless-wired connections. The culprit for this is the network cost calculation and the\nWired connections use 0.2 units of energy, while wireless\nlinearization of 𝑌 resulting in a large number of constraints. connections use 0.8 units of energy, which is similar to the\nBy removing the 𝑌 matrix and the associated constraints,\npowerconsumptionofanEthernetmodule[75]ascomparedto\nwe create a linear problem that can be evaluated effectively\naWiFimodule[76].Nodeshaveavaryingamountofmemory\nby the simplex method [73].",
      "size": 985,
      "sentences": 8
    },
    {
      "id": 65,
      "content": "onstraints,\npowerconsumptionofanEthernetmodule[75]ascomparedto\nwe create a linear problem that can be evaluated effectively\naWiFimodule[76].Nodeshaveavaryingamountofmemory\nby the simplex method [73]. The approach approximates\nthe energy required for sending a packet of data by taking 3https://pythonhosted.org/PuLP/\n=== 페이지 9 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 9\n50000\n40000\n30000\n20000\n10000\n0\n6 8 10 12 14 16 18\nNodes\n)s(\nemit\n(a) CPUtimeoftheoptimalallocationalgorithmvs.thenumber\nofnodes.Eachexperimentwithnnodeswasmeasured5times\nwith 3 to n-1 components. 350000\n300000\n250000\n200000\n150000\n100000\n50000\n0\n2.5 5.0 7.5 10.0 12.5 15.0 17.5\nTasks\n)s(\nemit\n6\n5\n4\n3\n2\n1\n0\n6 8 10 12 14 16 18 20\nNodes\n(b) CPU time of the optimal allocation algorithm vs. the\nnumber of components. Each experiment with n components\nwas measured 5 times with 5 to 20 nodes. Fig. 6: Runtime for optimal allocation.",
      "size": 911,
      "sentences": 6
    },
    {
      "id": 66,
      "content": "Nodes\n(b) CPU time of the optimal allocation algorithm vs. the\nnumber of components. Each experiment with n components\nwas measured 5 times with 5 to 20 nodes. Fig. 6: Runtime for optimal allocation. resources uniformly distributed between a lower bound of 1\nand an upper bound of 8 resource units. Nodes also have a\nvarying processing speed between 1 and 3 speedup, roughly\ncomparing to the Intel processor family i3, i5, and i7. Finally,\nnodescanusefrom0.5to1.5unitsofenergyforasingleunit\nof computation. For the application, two classes with a certain number of\ncomponents are generated, a “wide” and a “long” application. In a “wide” application, two components are designated the\n“start” and “end” components, and every other component\nneeds input from the start node and sends output to the end\nnode. In a long application, components are linked serially. Figure 5 shows two example applications. This method for\ngenerating recips is similar to [53].",
      "size": 956,
      "sentences": 12
    },
    {
      "id": 67,
      "content": "the start node and sends output to the end\nnode. In a long application, components are linked serially. Figure 5 shows two example applications. This method for\ngenerating recips is similar to [53]. Each application compo-\nnent has resource requirements randomly distributed between\n1 and 8, an output factor randomly distributed between 0.5\nand 1.5, and a computation size of 1 or 2. As expected, the optimal allocation algorithm scales very\nbadly (non-polynomially). Figure 6 shows the runtime of\nthe algorithm for varying problem sizes. The shaded area\nshows the variance with the non-shown parameter (different\napplicationsizesforthenetworknodegraph,differingnetwork\nsizes for the application node graph). The time needed for\n)s(\nemit\n(a) CPU time of the allocation heuristic vs. the number of\nnodes. Each experiment with n nodes was measured 5 times\nwith 3 to n-1 components.",
      "size": 880,
      "sentences": 10
    },
    {
      "id": 68,
      "content": "the application node graph). The time needed for\n)s(\nemit\n(a) CPU time of the allocation heuristic vs. the number of\nnodes. Each experiment with n nodes was measured 5 times\nwith 3 to n-1 components. 8\n6\n4\n2\n0\n4 6 8 10 12 14 16 18\nTasks\n)s(\nemit\n(b) CPU time of the allocation heuristic vs. the number of\ncomponents.Eachexperimentwithncomponentswasmeasured\n5 times with 5 to 20 nodes. Fig. 7: Heuristic runtime. finding the optimal allocation grows unwieldy very quickly. Incomparison,theheuristicpresentedinequation(11)finds\na solution much more quickly. Figure 7 shows the runtime\nof the heuristic for different network and application sizes. For the slowest case for the full allocation, the heuristic\ntakes 8 seconds of CPU time, while the solver consumes\n864104 seconds (about 10 days) of CPU time for finding\ntheoptimalallocation.Theallocationevaluationwasexecuted\non an Amazon EC2 m4.10xlarge machine with 40 virtual\ncoresand160GiBofmemory.Peakmemoryusewas51GiB.",
      "size": 969,
      "sentences": 10
    },
    {
      "id": 69,
      "content": "onds (about 10 days) of CPU time for finding\ntheoptimalallocation.Theallocationevaluationwasexecuted\non an Amazon EC2 m4.10xlarge machine with 40 virtual\ncoresand160GiBofmemory.Peakmemoryusewas51GiB. However, the heuristic loses about 30% of energy efficiency\nover the optimal algorithm. Specifically, 50% of the solutions\nachieve between 60% and 80% of the energy efficiency of the\noptimal case. C. Energy-efficient Blockchain over Wireless Networks\nThe last enabling technology is DLT, which provides a\ntamper-proof ledger distributed for the nodes of the iIoTe. The energy and latency cost of implementing DLT over\nwireless links and with constrained IoT devices is oftentimes\noverlooked. In general, the latency and energy budgets are\nhighly impacted by the wireless access protocol. === 페이지 10 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 10\n1) System model: As introduced in [77], there are two consumptionofsynchronization,resourcereservation,anddata\narchitectural choices for IoT DLT.",
      "size": 1000,
      "sentences": 7
    },
    {
      "id": 70,
      "content": "=\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 10\n1) System model: As introduced in [77], there are two consumptionofsynchronization,resourcereservation,anddata\narchitectural choices for IoT DLT. The conventional one is transmission of uplink and downlink, respectively. 𝐿𝑢\nhas\n𝑠𝑦𝑛𝑐\nto have IoT devices that receive complete blocks from the been defined in [79] with the values of 0.33𝑠. 𝐿 𝑟𝑟 is given as:\nBlockchain to which they are connected, and locally verify\nthevalidityoftheProof-of-Work(PoW)solutionandthecon- 𝐿 𝑟𝑟 =\n𝑁\n∑︁\n𝑟𝑚𝑎𝑥\n(1−𝑃 𝑟𝑟)𝑙−1𝑃 𝑟𝑟 𝑙(𝐿 𝑟𝑎+𝐿 𝑟𝑎𝑟), (13)\ntained transactions. This configuration provides the maximum\n𝑙=1\npossible level of security. However, this requires high storage,\nenergy and computation resources, since the node needs to\nin which, 𝑁 𝑟𝑚𝑎𝑥 is the maximum number of attempts, 𝑃 𝑟𝑟 is\ntheprobabilityofsuccessfulresourcereservationinanattempt,\nstore the complete Blockhain and to check all transactions.",
      "size": 940,
      "sentences": 6
    },
    {
      "id": 71,
      "content": "nce the node needs to\nin which, 𝑁 𝑟𝑚𝑎𝑥 is the maximum number of attempts, 𝑃 𝑟𝑟 is\ntheprobabilityofsuccessfulresourcereservationinanattempt,\nstore the complete Blockhain and to check all transactions. 𝐿\n𝑟𝑎\n=0.5𝑡+𝜏,istheexpectedlatencyinsendinganRAcontrol\nThis makes it infeasible for many IoT applications. Instead,\nmessage,𝜏istheunitlengthandequaltotheNPRACHperiod\nwe consider the second option where the IoT device is a light\nfor the coverage class 1 which is varied from 40ms to 2.56s\nnodethatreceivesonlytheheadersfromtheBlockchainnodes. [79], and 𝐿 𝑟𝑎𝑟 = 0.5𝑑 +0.5Q𝑓𝑢+𝑢, is the expected latency\nThese headers contain sufficient information for the Proof-of-\nin receiving the RAR message, where Q are requests waiting\nInclusion (PoI), i.e., to prove the inclusion of a transaction\nto be served. in the block without the need to download the entire block\nIn the following, we provide a simple technique based on\nbody.",
      "size": 919,
      "sentences": 5
    },
    {
      "id": 72,
      "content": "Inclusion (PoI), i.e., to prove the inclusion of a transaction\nto be served. in the block without the need to download the entire block\nIn the following, we provide a simple technique based on\nbody. Furthermore, the device defines a list of (few) events of\ninterest, such as modifications to the state of a smart contract drift approximation [80] to calculate 𝑃 𝑟𝑟 recursively. There-\nfore, we treat the mean of the random variables involved in\nor transactions from/to a particular address. the process as constants. Besides, we assume that sufficient\nThecommunicationmodelforthislightweight versionisas\nresources are available in the NPDCCH so that failures only\nfollows.TheIoTdevicestransmitdatatotheBlockchainusing\noccur due to collisions in the NPRACH or to link outages. the edge infrastructure. Specifically, a NB-IoT cell with the\nbasestationlocatedinitscenterisconsidered,with 𝑁 devices Let 𝜆𝑎 = 𝜆𝑢 + 𝜆𝑑 be the arrival rate of access requests\nuniformly distributed within the area.",
      "size": 989,
      "sentences": 8
    },
    {
      "id": 73,
      "content": "structure. Specifically, a NB-IoT cell with the\nbasestationlocatedinitscenterisconsidered,with 𝑁 devices Let 𝜆𝑎 = 𝜆𝑢 + 𝜆𝑑 be the arrival rate of access requests\nuniformly distributed within the area. The base station, which per NPRACH period and\n𝜆𝑎(𝑙)\nbe the mean number of\nisdesignatedasafullDLTnodeconnectedtotheBlockchain, devices participating in the contention with their 𝑙-th attempt. is the DLT-anchor for the IoT devices. For the radio resource Note that in the steady state\n𝜆𝑎(𝑙)\nremains constant for\nmanagement, we adapt the queueing model of [19] to our all NPRACH periods. Next, let 𝜆 𝑡 𝑎 𝑜𝑡 = (cid:205) 𝑙 𝑁 = 𝑟 1 𝑚𝑎𝑥 𝜆𝑎(𝑙). The\nscenario, where the uplink and downlink radio resources are collision probability in the NPRACH can be calculated using\nmodeled as two servers that visit and serve their respective the drift approximation for a given value of 𝜆 𝑡 𝑎 𝑜𝑡 and for a\ninter-dependent traffic queues.",
      "size": 917,
      "sentences": 7
    },
    {
      "id": 74,
      "content": "lity in the NPRACH can be calculated using\nmodeled as two servers that visit and serve their respective the drift approximation for a given value of 𝜆 𝑡 𝑎 𝑜𝑡 and for a\ninter-dependent traffic queues. given number of available preambles 𝐾 as:\nera 2 g ) e E c n la d s - s 2 e - s En n d am (E el 2 y E) no la rm ten al c , y: ex N tre B m -I e o , T an p d rov ro id b e u s st th c r l e a e ss co fo v r - 𝑃 collision (𝜆 𝑡 𝑎 𝑜𝑡 ) =1− (cid:18) 1− 𝐾 1 (cid:19)𝜆 𝑡 𝑎 𝑜𝑡−1 ≈1−𝑒− 𝜆𝑡 𝑎 𝐾 𝑜𝑡. (14)\nservinglimited-resourcedevicesandsufferingvariouspathloss\nlevels [78]. Minimum latency and throughput requirements From there, we approximate the probability of resource reser-\nneed to be maintained in the extreme coverage class, whereas vation as a function of 𝜆 𝑡 𝑎 𝑜𝑡 as 𝑃 𝑟𝑟(𝜆 𝑡 𝑎 𝑜𝑡 ) ≈ 𝑝 𝑑 𝑒− 𝜆𝑡 𝑎 𝐾 𝑜𝑡. This\nenhanced performance is ensured in the extended or normal\nallows us to define\n𝜆𝑎\nas:\n𝑡𝑜𝑡\ncoverage class. Without loss of generality, we consider only\n𝐶 no = rm 2 a .",
      "size": 972,
      "sentences": 6
    },
    {
      "id": 75,
      "content": "𝑡 𝑎 𝑜𝑡 ) ≈ 𝑝 𝑑 𝑒− 𝜆𝑡 𝑎 𝐾 𝑜𝑡. This\nenhanced performance is ensured in the extended or normal\nallows us to define\n𝜆𝑎\nas:\n𝑡𝑜𝑡\ncoverage class. Without loss of generality, we consider only\n𝐶 no = rm 2 a . l A an c d la e s x s tr i e s m a e ss c ig ov n e e r d ag to e a cla d s e s v , ic i. e e. b , a th se e d nu o m n b th e e ro e f st c im la a ss te e d s 𝜆 𝑡 𝑎 𝑜𝑡 =𝜆𝑎+ (cid:0) 1−𝑃 𝑟𝑟(𝜆 𝑡 𝑎 𝑜𝑡 ) (cid:1) 𝑁 ∑︁ 𝑟𝑚𝑎𝑥 𝜆𝑎(𝑙), (15)\npath loss, with the base station informing the assigned device\n𝑙=2\nof the dedicated path between them. Class 𝑗 and ∀𝑗 are since 𝜆𝑎(𝑙) = (cid:0) 1−𝑃 𝑟𝑟(𝜆 𝑡 𝑎 𝑜𝑡 ) (cid:1)𝜆𝑎(𝑙−1) for 𝑙 ≥ 2 and 𝜆𝑎(1) =\nsupported by the replicas number 𝑐 𝑗, which are transmitted 𝜆𝑎 . Finally, from the initial conditions 𝜆𝑎(𝑙) = 0 for 𝑙 ≥ 2,\nbased on data and the control packet [19]. Particularly, the the values of 𝜆𝑎(𝑙) and 𝜆 𝑡 𝑎 𝑜𝑡 can be calculated recursively by:\nreserved NPRACH period of class 𝑗 is denoted by 𝑐 𝑗 𝜏.",
      "size": 935,
      "sentences": 7
    },
    {
      "id": 76,
      "content": ") = 0 for 𝑙 ≥ 2,\nbased on data and the control packet [19]. Particularly, the the values of 𝜆𝑎(𝑙) and 𝜆 𝑡 𝑎 𝑜𝑡 can be calculated recursively by:\nreserved NPRACH period of class 𝑗 is denoted by 𝑐 𝑗 𝜏. The 1) applying (15); 2) calculating 𝑃 𝑟𝑟(𝜆 𝑡 𝑎 𝑜𝑡 ) for the new value\nunit length 𝜏 of the NPRACH for the class of coverage is of 𝜆 𝑡 𝑎 𝑜𝑡 ; and 3) updating the values of 𝜆𝑎(𝑙). This process is\ndenoted by 𝑐 𝑗 = 1. 𝑡 𝑗 is the average time interval between repeateduntilthevaluesofthevariablesconvergetoaconstant\ntwo consecutive scheduling of NPRACH of class 𝑗, whereas value. The final value of 𝑃 𝑟𝑟(𝜆 𝑡 𝑎 𝑜𝑡 ) is simply denoted as 𝑃 𝑟𝑟\nthe average time duration between two consecutive NPDCCH and used throughout the rest of the paper. occurrences is denoted by 𝑑.",
      "size": 765,
      "sentences": 6
    },
    {
      "id": 77,
      "content": "as value. The final value of 𝑃 𝑟𝑟(𝜆 𝑡 𝑎 𝑜𝑡 ) is simply denoted as 𝑃 𝑟𝑟\nthe average time duration between two consecutive NPDCCH and used throughout the rest of the paper. occurrences is denoted by 𝑑. Assuming that the transmission time for the uplink trans-\nThe total E2E latency includes two parts: (1) the latency actions follows a general distribution with the first two mo-\n𝐿 𝑈𝑒𝐷 of transmissions of uplink and downlink between IoT ments 𝑙 ,𝑙 , the first two moments of the distribution of the\n1 2\ndevices and the base station (the wireless communication packet transmission time are 𝑠 = (𝑓 𝑙 )/(R𝑤), and 𝑠 =\n1 1 1 2\nlatency);(2)andthelatency 𝐿 𝐷𝐿𝑇 duetotheDLTverification (𝑓 𝑙 )/ (cid:0) R2𝑤2(cid:1) . Applying the results from [81], considering\n1 2\nprocess. I.e., 𝐿 = 𝐿 𝑈𝑒𝐷 +𝐿 𝐷𝐿𝑇.",
      "size": 787,
      "sentences": 6
    },
    {
      "id": 78,
      "content": "𝑠 = (𝑓 𝑙 )/(R𝑤), and 𝑠 =\n1 1 1 2\nlatency);(2)andthelatency 𝐿 𝐷𝐿𝑇 duetotheDLTverification (𝑓 𝑙 )/ (cid:0) R2𝑤2(cid:1) . Applying the results from [81], considering\n1 2\nprocess. I.e., 𝐿 = 𝐿 𝑈𝑒𝐷 +𝐿 𝐷𝐿𝑇. 𝐿 𝑡𝑥 as a function of scheduling of NPUSCH, we have:\nThe wireless communication latency of NB-IoT uplink and\n𝑓𝜆𝑢𝑠 𝑠 𝑓𝜆𝑢𝑠2 𝑙\ndownlink can be formulated as: 𝐿 𝑡𝑥 = 2𝑠 (1− 1 𝑓𝐺 2 𝑠 ) + 2(1− 𝑓𝜆 1 𝑢𝑠 ) + R𝑢 1 𝑤 , (16)\n𝐿 𝑈𝑒𝐷 = 𝐿𝑢+𝐿𝑑 = 𝐿𝑢 𝑠𝑦𝑛𝑐 +𝐿 𝑟 𝑢 𝑟 +𝐿𝑢 𝑡𝑥 +𝐿 𝑠 𝑑 𝑦𝑛𝑐 +𝐿 𝑟 𝑑 𝑟 +𝐿 𝑟 𝑑 𝑥 , (12) whereR𝑢 isthe 1 averageu 1 plinktransmissio 1 nrate,𝜆𝑢 =𝜆 𝑠+𝜆 𝑏,\nwhere 𝐿𝑢\n𝑠𝑦𝑛𝑐\n, 𝐿\n𝑟\n𝑢\n𝑟\n, 𝐿𝑢\n𝑡𝑥\n, 𝐿\n𝑠\n𝑑\n𝑦𝑛𝑐ℎ\n,𝐿\n𝑟\n𝑑\n𝑟\n, and 𝐿\n𝑟\n𝑑\n𝑥\nare energy and 𝑓(𝜆 𝑠+𝜆 𝑏)𝑠\n1\nis the mean batch-size.",
      "size": 674,
      "sentences": 4
    },
    {
      "id": 79,
      "content": "𝑟 𝑑 𝑥 , (12) whereR𝑢 isthe 1 averageu 1 plinktransmissio 1 nrate,𝜆𝑢 =𝜆 𝑠+𝜆 𝑏,\nwhere 𝐿𝑢\n𝑠𝑦𝑛𝑐\n, 𝐿\n𝑟\n𝑢\n𝑟\n, 𝐿𝑢\n𝑡𝑥\n, 𝐿\n𝑠\n𝑑\n𝑦𝑛𝑐ℎ\n,𝐿\n𝑟\n𝑑\n𝑟\n, and 𝐿\n𝑟\n𝑑\n𝑥\nare energy and 𝑓(𝜆 𝑠+𝜆 𝑏)𝑠\n1\nis the mean batch-size. The latency of data\n=== 페이지 11 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 11\nreception is defined as:\n0.5𝐹ℎ 𝑡−1 𝐹ℎ 𝑚\n𝐿 𝑟𝑥 = ℎ (1−𝐹 1 ℎ𝑡−1) + 1−𝐹ℎ 1 𝑡−1 + R𝑑 2 𝑦 , (17)\n1\nin which, ℎ = 𝑓𝑚 (R𝑑𝑦)−1, ℎ = 𝑓𝑚 ((R𝑑)2𝑦2)−1 are\n1 1 2 2\ntwo moments of distribution of the packet transmission time,\nassuming that the packet length follows a general distribution\nwith moments 𝑚 , 𝑚 , 𝐹 = 𝑓𝜆𝑑𝑡, R𝑑 is downlink data\n1 2\ntransmission rate. Next, we calculate the second latency component, corre-\nsponding to the DLT verification process. Consider a DLT\nnetwork that includes 𝑀 miners.",
      "size": 778,
      "sentences": 4
    },
    {
      "id": 80,
      "content": ", 𝐹 = 𝑓𝜆𝑑𝑡, R𝑑 is downlink data\n1 2\ntransmission rate. Next, we calculate the second latency component, corre-\nsponding to the DLT verification process. Consider a DLT\nnetwork that includes 𝑀 miners. These miners start their\nProof-of-Work (PoW) computation at the same time and keep\nexecuting the PoW process until one of the miners completes\n(a) End-to-End Latency (sec)\nthe computational task by finding the desired hash value [82]. When a miner executes the computational task for the POW\nof current block, the time period required to complete this\nPoW can be formulated as an exponential random variable𝑊\nwhose distribution is 𝑓 𝑊(𝑤) =𝜆 𝑐 𝑒−𝜆𝑐𝑤 , in which 𝜆 𝑐 =𝜆 0 𝑃 𝑐\nrepresents the computing speed of a miner, 𝑃 𝑐 is power\nconsumption for computation of a miner, and 𝜆 is a constant\n0\nscaling factor. Once a miner completes its PoW, it will\nbroadcast messages to other miners, so that other miners can\nstop their PoW and synchronize the new block.",
      "size": 953,
      "sentences": 6
    },
    {
      "id": 81,
      "content": "on of a miner, and 𝜆 is a constant\n0\nscaling factor. Once a miner completes its PoW, it will\nbroadcast messages to other miners, so that other miners can\nstop their PoW and synchronize the new block. 𝐿 𝑡𝑀 = 𝐿 𝑛𝑒𝑤𝐵+𝐿 𝑔𝑒𝑡𝐵+𝐿 𝑡𝑟𝑎𝑛𝑠𝐵 (18)\nIn (18), 𝐿 𝑛𝑒𝑤𝐵, 𝐿 𝑔𝑒𝑡𝐵, and 𝐿 𝑡𝑟𝑎𝑛𝑠𝐵, are latencies of send-\ning hash of new mined block, requesting new block from\n(b) Energy consumption\nneighboring nodes, and new block transmission, respectively. 𝐿 𝑛𝑒𝑤𝐵 and 𝐿 𝑡𝑟𝑎𝑛𝑠𝐵 are computed using uplink transmission, Fig. 8: Latency and Energy Consumption\nwhile 𝐿 𝑔𝑒𝑡𝐵 is computed based on downlink transmission as\ndescribed in previous section. For the PoW computation, a miner 𝑖∗, first finds out the transmission of uplink and downlink, respectively. Each of\ndesired PoW hash value, 𝑖∗ = min𝑖∈𝑀 𝑤 𝑖.",
      "size": 781,
      "sentences": 7
    },
    {
      "id": 82,
      "content": "smission as\ndescribed in previous section. For the PoW computation, a miner 𝑖∗, first finds out the transmission of uplink and downlink, respectively. Each of\ndesired PoW hash value, 𝑖∗ = min𝑖∈𝑀 𝑤 𝑖. The fastest PoW them are formally defined as follows:\ncomputation among miners is 𝑊 𝑖∗ , the complementary cumu-\nlative probability distribution of 𝑊 𝑖∗ could be computed as 𝐸 𝑠𝑦𝑛𝑐 = 𝑃 𝑙 ·𝐿 𝑠𝑦𝑛𝑐 (21)\n𝑃𝑟(𝑊 𝑖∗ > 𝑥) = 𝑃𝑟(min𝑖∈𝑀(𝑊 𝑖) > 𝑥) = (cid:206) 𝑖 𝐻 =1 𝑃𝑟(𝑊 𝑖 > 𝑥) = 𝐸 𝑟𝑎𝑟 = 𝑃 𝑙 ·𝐿 𝑟𝑎𝑟 (22)\no\n(1\nf\n−\nm\n𝑃\nin\n𝑟\ne\n(\nr\n𝑊\n𝑖∗\n<\nis\n𝑥\nd\n))\ne\n𝑀\nsc\n. ri\nH\nbe\ne\nd\nnc\na\ne\ns\n,\n:\nthe average computational latency\n𝐸 𝑟𝑟 =\n𝑁 ∑︁𝑚𝑎𝑥\n(1−𝑃 𝑟𝑟)𝑙−1·𝑃 𝑟𝑟 ·(𝐸 𝑟𝑎+𝐸 𝑟𝑎𝑟) (23)\n𝑙=1\n𝐿 𝑊𝑖∗ = ∫\n∫ 0\n∞\n∞\n(1−𝑃𝑟(𝑊 ≤ 𝑥))𝑀\n1\n𝐷𝐷𝑥\n(19)\n𝐸\n𝐸\n𝑟\n𝑡𝑥\n𝑎\n=\n=\n(\n(\n𝐿\n𝐿\n𝑡\n𝑟\n𝑥\n𝑎\n−\n−\nR\n𝜏 𝑙 )\n𝑢 𝑎\n·\n𝑤\n𝑃\n)\n𝐼\n·\n+\n𝑃\n𝜏\n𝐼 +\n·(\n(\n𝑃\n𝑃\n𝑐\n𝑐\n+\n+\n𝑃\n𝑃\n𝑒\n𝑒\n𝑃\n𝑃\n𝑡\n𝑡\n)\n) R\n𝑙\n𝑢 𝑎 𝑤 (\n(\n2\n2\n5\n4\n)\n)\n= 𝑒−𝜆𝑐𝑀𝑥𝐷𝐷𝑥 = 𝑚 𝑚\n0 𝜆 𝑐 𝑀 𝐸 𝑟𝑥 = (𝐿 𝑟𝑥 − R𝑑 1 𝑦 )·𝑃 𝐼 +𝑃 𝑙 R𝑑 1 𝑦 (26)\nThe total latency required from DLT verification process is\n𝐿 𝐷𝐿𝑇 = 𝐿 𝑡𝑚+𝐿 𝑊𝑖∗ .",
      "size": 983,
      "sentences": 5
    },
    {
      "id": 83,
      "content": "+\n𝑃\n𝑃\n𝑒\n𝑒\n𝑃\n𝑃\n𝑡\n𝑡\n)\n) R\n𝑙\n𝑢 𝑎 𝑤 (\n(\n2\n2\n5\n4\n)\n)\n= 𝑒−𝜆𝑐𝑀𝑥𝐷𝐷𝑥 = 𝑚 𝑚\n0 𝜆 𝑐 𝑀 𝐸 𝑟𝑥 = (𝐿 𝑟𝑥 − R𝑑 1 𝑦 )·𝑃 𝐼 +𝑃 𝑙 R𝑑 1 𝑦 (26)\nThe total latency required from DLT verification process is\n𝐿 𝐷𝐿𝑇 = 𝐿 𝑡𝑚+𝐿 𝑊𝑖∗ . w\nci\nh\nen\ner\nc\ne\ny,\n𝑃\nid\n𝑒,\nle\n𝑃\np\n𝐼\no\n,\nw\n𝑃\ne\n𝑐\nr\n,\nc\n𝑃\no\n𝑙\nn\n,\ns\na\nu\nn\nm\nd\npt\n𝑃\nio\n𝑡\nn\na\n,\nre\ncir\nt\nc\nh\nu\ne\nit\np\np\now\now\ner\ner\nam\nco\np\nn\nl\ns\nifi\nu\ne\nm\nr\np\ne\nti\nf\no\nfi\nn\n-\n3) Energy consumption: Analogously to the latency, the\nof transmission, listening power consumption, and transmit\nenergy consumption is divided in the wireless communication\npower consumption, respectively. (uplink/downlink) and the DLT verification. The total energy consumption in the wireless communica- Following the PoW described above, the average energy\ntion is written as follows: consumption of DLT to finish a single PoW round is:\n𝐸 𝑈𝐷 = 𝐸𝑢 +𝐸𝑑 𝐸 𝐷𝐿𝑇 = 𝑃 𝑐 𝐿 𝑊𝑖∗ +𝑃 𝑡 𝐿 𝑡𝑚 (27)\n=\n𝐸𝑢 +𝐸𝑢 +𝐸𝑢 +𝐸𝑢 +𝐸𝑑 +𝐸𝑑 +𝐸𝑑 +𝐸𝑑,\n𝑠𝑦𝑛𝑐 𝑟𝑟 𝑡𝑥 𝑠 𝑠𝑦𝑛𝑐 𝑟𝑟 𝑟𝑥 𝑠\n4) Results: TheperformanceofDLT-basedNB-IoTsystem\n(20)\nis shown in Fig. 8.",
      "size": 995,
      "sentences": 5
    },
    {
      "id": 84,
      "content": "gle PoW round is:\n𝐸 𝑈𝐷 = 𝐸𝑢 +𝐸𝑑 𝐸 𝐷𝐿𝑇 = 𝑃 𝑐 𝐿 𝑊𝑖∗ +𝑃 𝑡 𝐿 𝑡𝑚 (27)\n=\n𝐸𝑢 +𝐸𝑢 +𝐸𝑢 +𝐸𝑢 +𝐸𝑑 +𝐸𝑑 +𝐸𝑑 +𝐸𝑑,\n𝑠𝑦𝑛𝑐 𝑟𝑟 𝑡𝑥 𝑠 𝑠𝑦𝑛𝑐 𝑟𝑟 𝑟𝑥 𝑠\n4) Results: TheperformanceofDLT-basedNB-IoTsystem\n(20)\nis shown in Fig. 8. The experiments demonstrate the total\nin which,\n𝐸𝑢\n,\n𝐸𝑢\n,\n𝐸𝑢\n,\n𝐸𝑑 ,𝐸𝑑\n, and\n𝐸𝑑\nare energy latency Fig. 8a and energy efficient Fig. 8b of a DLT-based\n𝑠𝑦𝑛𝑐 𝑟𝑟 𝑟𝑟 𝑠𝑦𝑛𝑐 𝑟𝑟 𝑟𝑥\nconsumptionofsynchronization,resourcereservation,anddata NB-IoT system, respectively. In Fig.",
      "size": 465,
      "sentences": 6
    },
    {
      "id": 85,
      "content": ",𝐸𝑑\n, and\n𝐸𝑑\nare energy latency Fig. 8a and energy efficient Fig. 8b of a DLT-based\n𝑠𝑦𝑛𝑐 𝑟𝑟 𝑟𝑟 𝑠𝑦𝑛𝑐 𝑟𝑟 𝑟𝑥\nconsumptionofsynchronization,resourcereservation,anddata NB-IoT system, respectively. In Fig. 8a, the E2E latency\n[표 데이터 감지됨]\n\n=== 페이지 12 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 12\nData Processing Model Training Model Aggregator\nPre-\nSelect data processing C2\nd\ner\nRaw Data\nvi\no\nPr Raw Data C2 Aggregated\nat a .... Aggregator Model\nD Raw Data\nStructured\nC1 Data C2 C3\nSmart Contracts\nC2 ....\nC1 C2 C3 C3\nSync C2 Sync Sync\nEdge Nodes\nModels updated on DLT\nWireless Station DLT clients\nEdge Node with different computing capabilities\nAggregated Models ML Model\nC Component X executed in Edge Nodes\nUpload Models Download Models\nFig. 9: Integration of enabling technologies. is defined as the time elapsed from the generation of a and tasks is exploited accordingly: The edge servers with\ntransaction at the NB-IoT device until its verification.",
      "size": 961,
      "sentences": 7
    },
    {
      "id": 86,
      "content": "on of enabling technologies. is defined as the time elapsed from the generation of a and tasks is exploited accordingly: The edge servers with\ntransaction at the NB-IoT device until its verification. This high computation capability are selected to operate the DLT\nincludes the latency at the NB-IoT radio link and at the DLT, activities, e.g, block mining, and aggregate the ML models\nwhich comprises the execution time of the smart contract and (the head workers if the learning paradigms in Section III-A\ntransaction verification. We observe that increasing 𝑡 and 𝑑 are applied), while more constrained edge devices or mobile\nvaluesatthefirstincreaseslifetimeanddecreaselatencydueto devices are setup as DLT light clients that can participate in\nmore resources for NPUSCH and NPDSCH, but after certain local training (the tail workers) and consensus.",
      "size": 853,
      "sentences": 4
    },
    {
      "id": 87,
      "content": "lifetimeanddecreaselatencydueto devices are setup as DLT light clients that can participate in\nmore resources for NPUSCH and NPDSCH, but after certain local training (the tail workers) and consensus. The involved\npoint increasing 𝑡 and 𝑑 decreases the lifetime by increasing networkcomponentscancommunicateviawirelesslong-range\ntheexpectedtimeforresourcereservation.Incomparisonwith communication NB-IoT channels. the standard NB-IoT system in [56], [83], the DLT-based In detail, the communication workflow of the proposed\nsystem introduces a slight latency because of addition time scheme can be summarized as follows:\nof consensus process and transaction verification. This is a\n• Step1:Thedataprocessingcanbecompletedindifferent\nlatency and security trade-off between standard NB-IoT and\nedge devices with limited resources. The selected data\nDLT-based systems. from the data provider is pre-processed and structured. This process includes both a data engineering and fea-\nIV.",
      "size": 980,
      "sentences": 7
    },
    {
      "id": 88,
      "content": "NB-IoT and\nedge devices with limited resources. The selected data\nDLT-based systems. from the data provider is pre-processed and structured. This process includes both a data engineering and fea-\nIV. TOWARDSENERGY-EFFICIENTINTELLIGENTIOT\nture engineering sub-process, in which data engineering\nENVIRONMENTS converts the raw data into prepared data and feature\nHavingtheenergy-performancecharacterizationforeachof engineering tunes the prepared data to create features\nthe enabling technologies (Section III), we describe next how expected by ML models. they interact with each other in iIoTe. For this, we consider • Step 2: Then, the edge nodes or IoT devices, which are\nthe scenario in Figure 9, where a given learning application responsible for training, compute the local model based\nis considered.",
      "size": 803,
      "sentences": 7
    },
    {
      "id": 89,
      "content": "e consider • Step 2: Then, the edge nodes or IoT devices, which are\nthe scenario in Figure 9, where a given learning application responsible for training, compute the local model based\nis considered. We split the task into sub-tasks such as data onitsownprivatedataandthenpublishthelocalmodelto\nprocessing,datatrainingandmodelaggregationanddistribute itsassociatededgeservervia,e.g.,NB-IoTbyregistering\nthem in a decentralized way. Each of these sub-tasks (Sec- withactivesmartcontractstouploadtheirresultsecurely\ntion III-A) constitute the application components (𝐶 ,𝐶 ,...) until the results are incorporated in the final aggregation\n1 2\nthat can be run at the available edge nodes. The optimal and generation of DLT transactions.",
      "size": 732,
      "sentences": 4
    },
    {
      "id": 90,
      "content": "ute the application components (𝐶 ,𝐶 ,...) until the results are incorporated in the final aggregation\n1 2\nthat can be run at the available edge nodes. The optimal and generation of DLT transactions. allocation of sub-tasks to edge nodes is determined using the • Step 3: Next, the edge servers with ML aggregation\nILP-basedalgorithmspresentedinSectionIII-B.Therequired responsibility gather transactions and arrange them in\ntrustworthiness (i.e., assuring security, privacy, immutability blocks following the Merkle tree. The structure of a DLT\nandtransparency)betweensub-tasksisprovidedthroughDLT involves the hash of the previous block, a timestamp,\n(Section III-C).",
      "size": 669,
      "sentences": 4
    },
    {
      "id": 91,
      "content": "vacy, immutability blocks following the Merkle tree. The structure of a DLT\nandtransparency)betweensub-tasksisprovidedthroughDLT involves the hash of the previous block, a timestamp,\n(Section III-C). The heterogeneity of devices, capabilities ’nonce’andthestructureofhashtree.Theseedgeservers\n=== 페이지 13 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 13\nwithhighcomputationalcapacityjoinintheDLTmining intheDLT.Futureworkalsoincludesextendingtheproposed\nprocess to verify the created blocks and operate consen- solutions to dynamic environments where agents move and\nsus in the edge network. After completing the mining edgenodesarenotalwaysavailable.Thisisalreadysupported\nprocess, the verified blocks are added to the ledger, and bythepresenteddynamichead/taillearningparadigmsbutthe\nsynchronized among the nodes. The local models are integration of a dynamic resource allocation and DLT frame-\npublished in the distributed ledger. Hence, the powerful work is pending.",
      "size": 976,
      "sentences": 6
    },
    {
      "id": 92,
      "content": "aradigmsbutthe\nsynchronized among the nodes. The local models are integration of a dynamic resource allocation and DLT frame-\npublished in the distributed ledger. Hence, the powerful work is pending. Another necessary direction is to investigate\nedgeserverscancomputetheglobalmodeldirectlybased the joint optimization of the computing and communication\non the aggregation rules defined in smart contracts. resources from the energy perspective. The advantages of this integration are two-folds. First, by\ndistributing the tasks to different edge nodes with different ACKNOWLEDGMENT\ncomputingcapacities,theIoTdevicesoredgenodeswithlim- This work has received funding from the European Union’s\nited resources can save significant amount of energy required Horizon2020researchandinnovationprogrammeundergrant\nfor training or mining and they can achieve lower latency. agreement No. 957218 (Project IntellIoT).",
      "size": 906,
      "sentences": 9
    },
    {
      "id": 93,
      "content": "can save significant amount of energy required Horizon2020researchandinnovationprogrammeundergrant\nfor training or mining and they can achieve lower latency. agreement No. 957218 (Project IntellIoT). Second, by leveraging the DLT, the updates of ML models\nare securely formed in encrypted transactions and hashed\nREFERENCES\nblocks, which significantly enhances the security and privacy\n[1] L.Hou,S.Zhao,X.Xiong,K.Zheng,P.Chatzimisios,M.S.Hossain,\nofdistributedlearningintheedgenetworks.TheDLTprovides\nand W. Xiang, “Internet of things cloud: Architecture and implemen-\ntrust, transparency and immutability baseline for distributed tation,” IEEE Communications Magazine, vol. 54, no. 12, pp. 32–39,\nlearning to guarantee the security and privacy of data and 2016.",
      "size": 762,
      "sentences": 7
    },
    {
      "id": 94,
      "content": "emen-\ntrust, transparency and immutability baseline for distributed tation,” IEEE Communications Magazine, vol. 54, no. 12, pp. 32–39,\nlearning to guarantee the security and privacy of data and 2016. [2] A. Alnoman, S. K. Sharma, W. Ejaz, and A. Anpalagan, “Emerging\nMLmodels,andnaturallyaddressesthesingle-pointoffailure\nedgecomputingtechnologiesfordistributediotsystems,”IEEENetwork,\nproblem of the current standard FL approach that relies on vol.33,no.6,pp.140–147,2019. a centralized server to aggregate the models. Although the [3] S. Deng, H. Zhao, W. Fang, J. Yin, S. Dustdar, and A. Y. Zomaya,\n“Edge intelligence: The confluence of edge computing and artificial\nintegration of enabling technologies introduces advantages, it\nintelligence,”IEEEInternetofThingsJournal,vol.7,no.8,pp.7457–\nalso has some drawbacks, for example, the time required of 7469,2020. DLTminingwillincreasethetotallatencyofthesystem.This [4] L.HiltyandB.Aebischer,ICTInnovationsforsustainability,vol.310. Springer,2015.",
      "size": 999,
      "sentences": 9
    },
    {
      "id": 95,
      "content": "has some drawbacks, for example, the time required of 7469,2020. DLTminingwillincreasethetotallatencyofthesystem.This [4] L.HiltyandB.Aebischer,ICTInnovationsforsustainability,vol.310. Springer,2015. is a trade-off between trust and communication latency which\n[5] “Eanict-towardsdigitalsobriety,”2019. we discussed in [66], [84]. [6] D. Bol, G. de Streel, and D. Flandre, “Can we connect trillions of iot\nsensorsinasustainableway?atechnology/circuitperspective(invited),”\nin 2015 IEEE SOI-3D-Subthreshold Microelectronics Technology Uni-\nV. CONCLUSIONSANDFUTUREWORK fiedConference(S3S),pp.1–3,2015. [7] W.Yu,F.Liang,X.He,W.G.Hatcher,C.Lu,J.Lin,andX.Yang,“A\nIn this paper, we address the evolution of next-generation surveyontheedgecomputingfortheInternetofThings,”IEEEaccess,\nof IoT networks towards the edge, driven by the introduced vol.6,pp.6900–6919,Nov.2017. [8] N.Hassan,S.Gillani,E.Ahmed,I.Yaqoob,andM.Imran,“Theroleof\nintelligent IoT environments.",
      "size": 956,
      "sentences": 8
    },
    {
      "id": 96,
      "content": "Things,”IEEEaccess,\nof IoT networks towards the edge, driven by the introduced vol.6,pp.6900–6919,Nov.2017. [8] N.Hassan,S.Gillani,E.Ahmed,I.Yaqoob,andM.Imran,“Theroleof\nintelligent IoT environments. We use the iIoTe as the basic\nedgecomputingininternetofthings,”IEEECommunicationsMagazine,\nbuildingblocktocharacterizethetradeoffenergy-performance vol.56,no.11,pp.110–115,2018. of the three key enabling technologies, learning, edge com- [9] M. Patel, B. Naughton, C. Chan, N. Sprecher, S. Abeta, and A. Neal,\n“Mobile-edge computing introductory technical white paper,” ETSI\nputing and distributed ledger. Edge intelligence must rely on\nWhitePaper,2014.",
      "size": 653,
      "sentences": 5
    },
    {
      "id": 97,
      "content": "Naughton, C. Chan, N. Sprecher, S. Abeta, and A. Neal,\n“Mobile-edge computing introductory technical white paper,” ETSI\nputing and distributed ledger. Edge intelligence must rely on\nWhitePaper,2014. distributed paradigms such as FL, and we have shown how [10] T.Taleb,K.Samdanis,B.Mada,H.Flinck,S.Dutta,andD.Sabella,“On\nexploiting spatial and temporal sparsity and quantization can multi-accessedgecomputing:Asurveyoftheemerging5gnetworkedge\ncloud architecture and orchestration,” IEEE Communications Surveys\nsignificantly improve the performance and reduce the energy\nTutorials,vol.19,no.3,pp.1657–1681,2017. consumption. Moreover, we have discussed the distribution of [11] M.S.Elbamby,M.Bennis,W.Saad,andetal.,“Proactiveedgecomput-\nthe FL model aggregator and the rest of sub-tasks to make inginfognetworkswithlatencyandreliabilityguarantees,”EURASIP\nJournalonWirelessCommunicationsandNetworking,vol.209,no.1,\nthe framework more robust against failures.",
      "size": 956,
      "sentences": 5
    },
    {
      "id": 98,
      "content": "r and the rest of sub-tasks to make inginfognetworkswithlatencyandreliabilityguarantees,”EURASIP\nJournalonWirelessCommunicationsandNetworking,vol.209,no.1,\nthe framework more robust against failures. For edge comput-\n2018.\ning, the optimal allocation of the application components to [12] M.S.Elbamby,C.Perfecto,C.Liu,J.Park,S.Samarakoon,X.Chen,\nnetwork resources is important to efficiently use the available and M. Bennis, “Wireless edge computing with latency and reliability\nguarantees,”ProceedingsoftheIEEE,vol.107,no.8,pp.1717–1737,\ninfrastructure and optimize its energy consumption. DLT is\n2019.\na flexible solution for trustworthiness in these environments, [13] Y. Hu and A. Schmeink, “Delay-constrained communication in edge\nbut the energy and latency cost of implementing DLT over computing networks,” in 2018 IEEE 19th International Workshop on\nSignal Processing Advances in Wireless Communications (SPAWC),\nwirelessandconstraineddevicesisoftentimesoverlooked.We\npp.1–5,2018.",
      "size": 988,
      "sentences": 3
    },
    {
      "id": 99,
      "content": "ver computing networks,” in 2018 IEEE 19th International Workshop on\nSignal Processing Advances in Wireless Communications (SPAWC),\nwirelessandconstraineddevicesisoftentimesoverlooked.We\npp.1–5,2018. have analyzed these parameters using NB-IoT as the baseline [14] X. Wang, Y. Han, V. C. M. Leung, D. Niyato, X. Yan, and X. Chen,\nwireless technology. “Convergence of edge computing and deep learning: A comprehen-\nsive survey,” IEEE Communications Surveys Tutorials, vol. 22, no. 2,\nIn the integration of these technologies in iIoTe, we have\npp.869–904,2020. shown the interactions among them, which provides the basis [15] H.Li,K.Ota,andM.Dong,“LearningIoTinedge:Deeplearningfor\ntowards an energy model and evaluation that encompasses the the Internet of Things with edge computing,” IEEE Network, vol. 32,\npp.96–101,Jan.2018. contribution of each element.",
      "size": 857,
      "sentences": 8
    },
    {
      "id": 100,
      "content": "nedge:Deeplearningfor\ntowards an energy model and evaluation that encompasses the the Internet of Things with edge computing,” IEEE Network, vol. 32,\npp.96–101,Jan.2018. contribution of each element. For instance, the learning and\n[16] Y. Mao, C. You, J. Zhang, K. Huang, and K. B. Letaief, “A survey\ncomputation models can be easily broaden to consider the on mobile edge computing: The communication perspective,” IEEE\nallocationofthedifferentsub-tasksofthelearningapplication CommunicationsSurveysTutorials,vol.19,no.4,pp.2322–2358,2017. [17] M. Kanj, V. Savaux, and M. Le Guen, “A tutorial on nb-iot physical\nin a representative topology, with each learning action and\nlayerdesign,”IEEECommunicationsSurveysTutorials,vol.22,no.4,\nresourceallocationplayingtheroleofanactiontoberecorded pp.2408–2446,2020.",
      "size": 807,
      "sentences": 5
    },
    {
      "id": 101,
      "content": "ical\nin a representative topology, with each learning action and\nlayerdesign,”IEEECommunicationsSurveysTutorials,vol.22,no.4,\nresourceallocationplayingtheroleofanactiontoberecorded pp.2408–2446,2020. === 페이지 14 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 14\n[18] Y.-P.E.Wang,X.Lin,A.Adhikary,A.Grovlen,Y.Sui,Y.Blankenship, [41] T. Chen, G. B. Giannakis, T. Sun, and W. Yin, “Lag: Lazily aggre-\nJ.Bergman,andH.S.Razaghi,“Aprimeron3GPPnarrowbandInternet gated gradient for communication-efficient distributed learning,” arXiv\nofThings,”IEEECommunicationsMagazine,vol.55,pp.117–123,Mar. preprintarXiv:1805.09965,2018. 2017. [42] J. C. Duchi, A. Agarwal, and M. J. Wainwright, “Dual averaging for\n[19] A. Azari, Cˇ. Stefanovic´, P. Popovski, and C. Cavdar, “On the latency- distributed optimization: Convergence analysis and network scaling,”\nenergyperformanceofnb-iotsystemsinprovidingwide-areaiotconnec- IEEE Transactions on Automatic control, vol. 57, no. 3, pp.",
      "size": 970,
      "sentences": 8
    },
    {
      "id": 102,
      "content": "atency- distributed optimization: Convergence analysis and network scaling,”\nenergyperformanceofnb-iotsystemsinprovidingwide-areaiotconnec- IEEE Transactions on Automatic control, vol. 57, no. 3, pp. 592–606,\ntivity,”IEEETransactionsonGreenCommunicationsandNetworking, 2011.\nvol.4,no.1,pp.57–68,2019. [43] T. AlShammari, S. Samarakoon, A. Elgabli, and M. Bennis, “Baygo:\n[20] 3GPP,“Radioresourcecontrol(rrc);protocolspecification,”no.TS36. Joint bayesian learning and information-aware graph optimization,” in\n331v9.3.0,2010. ICC2021-IEEEInternationalConferenceonCommunications,pp.1–6,\n[21] J.Konecny,H.B.McMahan,F.X.Yu,P.Richtarik,A.T.Suresh,and IEEE,2021. D.Bacon,“Federatedlearning:strategiesforimprovingcommunication [44] J.Wang,A.K.Sahu,Z.Yang,G.Joshi,andS.Kar,“Matcha:Speeding\nefficiency,” in Proc. of NIPS Wksp. PMPML, (Barcelona, Spain), Dec. up decentralized sgd via matching decomposition sampling,” in 2019\n2016. SixthIndianControlConference(ICC),pp.299–300,IEEE,2019.",
      "size": 979,
      "sentences": 11
    },
    {
      "id": 103,
      "content": "ng\nefficiency,” in Proc. of NIPS Wksp. PMPML, (Barcelona, Spain), Dec. up decentralized sgd via matching decomposition sampling,” in 2019\n2016. SixthIndianControlConference(ICC),pp.299–300,IEEE,2019. [22] T. Yang, G. Andrew, H. Eichner, H. Sun, W. Li, N. Kong, D. Ram- [45] A.Elgabli,J.Park,A.S.Bedi,M.Bennis,andV.Aggarwal,“Gadmm:\nage, and F. Beaufays, “Applied federated learning: Improving google Fast and communication efficient framework for distributed machine\nkeyboardquerysuggestions,”arXivpreprintarXiv:1812.02903,2018. learning.,”JournalofMachineLearningResearch,vol.21,no.76,pp.1–\n[23] S.Samarakoon,M.Bennis,W.Saad,andM.Debbah,“Distributedfed- 39,2020.\neratedlearningforultra-reliablelow-latencyvehicularcommunications,” [46] C. B. Issaid, A. Elgabli, J. Park, and M. Bennis, “Communication\nIEEETransactionsonCommunications,vol.68,no.2,pp.1146–1159, efficient distributed learning with censored, quantized, and generalized\n2019. groupADMM,”arXivpreprintarXiv:2009.06459,2020.",
      "size": 985,
      "sentences": 6
    },
    {
      "id": 104,
      "content": "“Communication\nIEEETransactionsonCommunications,vol.68,no.2,pp.1146–1159, efficient distributed learning with censored, quantized, and generalized\n2019. groupADMM,”arXivpreprintarXiv:2009.06459,2020. [24] P. Kairouz, H. B. McMahan, B. Avent, A. Bellet, M. Bennis, A. N. [47] G. T. Lakshmanan, Y. Li, and R. Strom, “Placement Strategies for\nBhagoji, K. Bonawitz, Z. Charles, G. Cormode, R. Cummings, et al., Internet-ScaleDataStreamSystems,”IEEEInternetComputing,vol.12,\n“Advances and open problems in federated learning,” arXiv preprint pp.50–60,Nov.2008. arXiv:1912.04977,2019. [48] A. M. Haubenwaller and K. Vandikas, “Computations on the edge in\n[25] V. Smith, C.-K. Chiang, M. Sanjabi, and A. S. Talwalkar, “Federated\ntheinternetofthings,”ProcediaComputerScience,vol.52,pp.29–34,\nmulti-task learning,” in Proc. of NIPS (I. Guyon, U. V. Luxburg, 2015.",
      "size": 854,
      "sentences": 5
    },
    {
      "id": 105,
      "content": ". Smith, C.-K. Chiang, M. Sanjabi, and A. S. Talwalkar, “Federated\ntheinternetofthings,”ProcediaComputerScience,vol.52,pp.29–34,\nmulti-task learning,” in Proc. of NIPS (I. Guyon, U. V. Luxburg, 2015. S. Bengio, H. Wallach, R. Fergus, S. Vishwanathan, and R. Garnett, [49] F.Samie,V.Tsoutsouras,L.Bauer,S.Xydis,D.Soudris,andJ.Henkel,\neds.),(LongBeach,USA),pp.4424–4434,CurranAssociates,Inc.,Dec. “Computationoffloadingandresourceallocationforlow-poweriotedge\n2017. devices,” in 2016 IEEE 3rd World Forum on Internet of Things (WF-\nIoT),pp.7–12,IEEE,2016. [26] A. Lalitha, O. C. Kilinc, T. Javidi, and F. Koushanfar, “Peer-to-peer\nfederatedlearningongraphs,”arXivpreprintarXiv:1901.11173,2019.",
      "size": 691,
      "sentences": 6
    },
    {
      "id": 106,
      "content": "orld Forum on Internet of Things (WF-\nIoT),pp.7–12,IEEE,2016. [26] A. Lalitha, O. C. Kilinc, T. Javidi, and F. Koushanfar, “Peer-to-peer\nfederatedlearningongraphs,”arXivpreprintarXiv:1901.11173,2019. [50] S.Sardellitti,G.Scutari,andS.Barbarossa,“Jointoptimizationofradio\nand computational resources for multicell mobile-edge computing,”\n[27] Y.Zhao,M.Li,L.Lai,N.Suda,D.Civin,andV.Chandra,“Federated\nIEEETransactionsonSignalandInformationProcessingoverNetworks,\nlearningwithnon-IIDdata,”ArXivpreprint,vol.abs/1806.00582,June\nvol.1,no.2,pp.89–103,2015. 2018. [51] Y.Sahni,J.Cao,S.Zhang,andL.Yang,“Edgemesh:Anewparadigm\n[28] F. Sattler, S. Wiedemann, K.-R. Müller, and W. Samek, “Robust and\nto enable distributed intelligence in internet of things,” IEEE access,\ncommunication-efficient federated learning from non-iid data,” IEEE\nvol.5,pp.16441–16458,2017. transactionsonneuralnetworksandlearningsystems,2019.",
      "size": 907,
      "sentences": 6
    },
    {
      "id": 107,
      "content": "d intelligence in internet of things,” IEEE access,\ncommunication-efficient federated learning from non-iid data,” IEEE\nvol.5,pp.16441–16458,2017. transactionsonneuralnetworksandlearningsystems,2019. [52] N.MohanandJ.Kangasharju,“Edge-fogcloud:Adistributedcloudfor\n[29] Y.Zhao,J.Zhao,L.Jiang,R.Tan,D.Niyato,Z.Li,L.Lyu,andY.Liu,\ninternetofthingscomputations,”in2016CloudificationoftheInternet\n“Privacy-preservingblockchain-basedfederatedlearningforiotdevices,”\nofThings(CIoT),pp.1–6,IEEE,2016. IEEEInternetofThingsJournal,pp.1–1,2020. [53] V. Cardellini, V. Grassi, F. Lo Presti, and M. Nardelli, “Optimal\n[30] Y. Zhao, J. Zhao, M. Yang, T. Wang, N. Wang, L. Lyu, D. Niyato,\noperator placement for distributed stream processing applications,” in\nandK.Y.Lam,“Localdifferentialprivacybasedfederatedlearningfor\nProceedingsofthe10th ACMInternationalConferenceonDistributed\ninternetofthings,”2020. andEvent-basedSystems,pp.69–80,ACMPress,2016.",
      "size": 937,
      "sentences": 6
    },
    {
      "id": 108,
      "content": "s,” in\nandK.Y.Lam,“Localdifferentialprivacybasedfederatedlearningfor\nProceedingsofthe10th ACMInternationalConferenceonDistributed\ninternetofthings,”2020. andEvent-basedSystems,pp.69–80,ACMPress,2016. [31] L.Lyu,H.Yu,andQ.Yang,“Threatstofederatedlearning:Asurvey,”\n[54] J.Seeger,A.Bröring,andG.Carle,“Optimallyself-healingiotchore-\n2020.\nographies,”ACMTransactionsonInternetTechnology(TOIT),vol.20,\n[32] M. Yang, L. Lyu, J. Zhao, T. Zhu, and K.-Y. Lam, “Local differential no.3,pp.1–20,2020. privacyanditsapplications:Acomprehensivesurvey,”2020. [55] T.M.Fernández-CaramésandP.Fraga-Lamas,“Areviewontheuseof\n[33] Y. Koda, K. Yamamoto, T. Nishio, and M. Morikura, “Differentially blockchain for the internet of things,” Ieee Access, vol. 6, pp. 32979–\nprivate aircomp federated learning with power adaptation harnessing 33001,2018.\nreceivernoise,”2020. [56] L. D. Nguyen, A. E. Kalor, I. Leyva-Mayorga, and P. Popovski,\n[34] A. Elgabli, J.",
      "size": 937,
      "sentences": 9
    },
    {
      "id": 109,
      "content": "pp. 32979–\nprivate aircomp federated learning with power adaptation harnessing 33001,2018.\nreceivernoise,”2020. [56] L. D. Nguyen, A. E. Kalor, I. Leyva-Mayorga, and P. Popovski,\n[34] A. Elgabli, J. Park, C. B. Issaid, and M. Bennis, “Harnessing wireless “Trusted wireless monitoring based on distributed ledgers over nb-iot\nchannelsforscalableandprivacy-preservingfederatedlearning,”IEEE connectivity,”IEEECommunicationsMagazine,vol.58,no.6,pp.77–\nTransactionsonCommunications,vol.69,no.8,pp.5194–5208,2021. 83,2020. [35] H.H.Yang,Z.Liu,T.Q.Quek,andH.V.Poor,“Schedulingpolicies [57] S. Nakamoto, “Bitcoin: A peer-to-peer electronic cash system,” tech. for federated learning in wireless networks,” IEEE transactions on rep.,Manubot,2008. communications,vol.68,no.1,pp.317–333,2019.",
      "size": 782,
      "sentences": 8
    },
    {
      "id": 110,
      "content": "S. Nakamoto, “Bitcoin: A peer-to-peer electronic cash system,” tech. for federated learning in wireless networks,” IEEE transactions on rep.,Manubot,2008. communications,vol.68,no.1,pp.317–333,2019. [58] G.Woodetal.,“Ethereum:Asecuredecentralisedgeneralisedtransac-\n[36] M.M.Wadu,S.Samarakoon,andM.Bennis,“Federatedlearningunder tionledger,”Ethereumprojectyellowpaper,vol.151,no.2014,pp.1–\nchannel uncertainty: Joint client scheduling and resource allocation,” 32,2014.\nin 2020 IEEE Wireless Communications and Networking Conference [59] K.ChristidisandM.Devetsikiotis,“Blockchainsandsmartcontractsfor\n(WCNC),pp.1–6,2020. theinternetofthings,”IeeeAccess,vol.4,pp.2292–2303,2016.",
      "size": 678,
      "sentences": 5
    },
    {
      "id": 111,
      "content": "EEE Wireless Communications and Networking Conference [59] K.ChristidisandM.Devetsikiotis,“Blockchainsandsmartcontractsfor\n(WCNC),pp.1–6,2020. theinternetofthings,”IeeeAccess,vol.4,pp.2292–2303,2016. [37] K. Bonawitz, H. Eichner, W. Grieskamp, D. Huba, A. Ingerman, [60] L. D. Nguyen, I. Leyva-Mayorga, A. N. Lewis, and P. Popovski,\nV.Ivanov,C.Kiddon,J.Konecny,S.Mazzocchi,H.B.McMahan,etal., “Modelingandanalysisofdatatradingonblockchain-basedmarketin\n“Towards federated learning at scale: System design,” arXiv preprint iotnetworks,”IEEEInternetofThingsJournal,pp.1–1,2021. arXiv:1902.01046,2019. [61] C. Esposito, A. De Santis, G. Tortora, H. Chang, and K.-K. R. Choo,\n[38] M.M.AmiriandD.Gündüz,“Computationschedulingfordistributed “Blockchain: A panacea for healthcare cloud-based data security and\nmachinelearningwithstragglingworkers,”IEEETransactionsonSignal privacy?,”IEEECloudComputing,vol.5,no.1,pp.31–37,2018. Processing,vol.67,no.24,pp.6270–6284,2019.",
      "size": 962,
      "sentences": 7
    },
    {
      "id": 112,
      "content": "althcare cloud-based data security and\nmachinelearningwithstragglingworkers,”IEEETransactionsonSignal privacy?,”IEEECloudComputing,vol.5,no.1,pp.31–37,2018. Processing,vol.67,no.24,pp.6270–6284,2019. [62] K. N. Griggs, O. Ossipova, C. P. Kohlios, A. N. Baccarini, E. A. [39] M.S.Elbamby,C.Perfecto,C.Liu,J.Park,S.Samarakoon,X.Chen, Howson,andT.Hayajneh,“Healthcareblockchainsystemusingsmart\nand M. Bennis, “Wireless edge computing with latency and reliability contracts for secure automated remote patient monitoring,” Journal of\nguarantees,” Proceedings of the IEEE, vol. 107, pp. 1717–1737, Aug. medicalsystems,vol.42,no.7,pp.1–7,2018. 2019.",
      "size": 643,
      "sentences": 7
    },
    {
      "id": 113,
      "content": "and reliability contracts for secure automated remote patient monitoring,” Journal of\nguarantees,” Proceedings of the IEEE, vol. 107, pp. 1717–1737, Aug. medicalsystems,vol.42,no.7,pp.1–7,2018. 2019. [63] S. Saberi, M. Kouhizadeh, J. Sarkis, and L. Shen, “Blockchain tech-\n[40] M.Polese,R.Jana,V.Kounev,K.Zhang,S.Deb,andM.Zorzi,“Ma- nology and its relationships to sustainable supply chain management,”\nchinelearningattheedge:Adata-drivenarchitecturewithapplicationsto InternationalJournalofProductionResearch,vol.57,no.7,pp.2117–\n5Gcellularnetworks,”IEEETransactionsonMobileComputing,2020. 2135,2019.",
      "size": 601,
      "sentences": 6
    },
    {
      "id": 114,
      "content": "chinelearningattheedge:Adata-drivenarchitecturewithapplicationsto InternationalJournalofProductionResearch,vol.57,no.7,pp.2117–\n5Gcellularnetworks,”IEEETransactionsonMobileComputing,2020. 2135,2019. === 페이지 15 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 15\n[64] Y. Zhang, X. Xu, A. Liu, Q. Lu, L. Xu, and F. Tao, “Blockchain- LamD.Nguyen(S’20)isaPh.D.FellowatAalborg\nbasedtrustmechanismforiot-basedsmartmanufacturingsystem,”IEEE University.HeobtainedMasterDegreeinComputer\nTransactionsonComputationalSocialSystems,vol.6,no.6,pp.1386– Science at Seoul National University, and a Bach-\n1394,2019. elor in Telecommunication at Hanoi University of\n[65] Z.Yang,K.Yang,L.Lei,K.Zheng,andV.C.Leung,“Blockchain-based ScienceandTechnologiesin2019and2015,respec-\ndecentralized trust management in vehicular networks,” IEEE Internet tively. His research includes Distributed Systems,\nofThingsJournal,vol.6,no.2,pp.1495–1505,2018.",
      "size": 926,
      "sentences": 4
    },
    {
      "id": 115,
      "content": "Technologiesin2019and2015,respec-\ndecentralized trust management in vehicular networks,” IEEE Internet tively. His research includes Distributed Systems,\nofThingsJournal,vol.6,no.2,pp.1495–1505,2018. Blockchain,SmartContracts,theInternetofThings,\n[66] P. Danzi, A. E. Kalor, R. B. Sorensen, A. K. Hagelskjær, L. D. and applying Blockchain and Federated Learning\nNguyen,C.Stefanovic,andP.Popovski,“Communicationaspectsofthe to enhance the efficiency of Blockchain-based IoT\nintegration of wireless iot devices with distributed ledger technology,” monitoring Networks. He receives Outstanding Pa-\nIEEENetwork,vol.34,no.1,pp.47–53,2020. perAwardfortheresearchaboutscalingBlockchain\n[67] S.Boyd,N.Parikh,andE.Chu,Distributedoptimizationandstatistical in Massive IoT at the IEEE World Forum Internet of Things 2020, travel\nlearning via the alternating direction method of multipliers. Now grant from Linux Foundation 2020, Best Research Award for a solution\nPublishersInc,2011.",
      "size": 972,
      "sentences": 6
    },
    {
      "id": 116,
      "content": "World Forum Internet of Things 2020, travel\nlearning via the alternating direction method of multipliers. Now grant from Linux Foundation 2020, Best Research Award for a solution\nPublishersInc,2011. of Blockchain-based CO2 Emission Trading from VEHITS 2021. He is\n[68] A.Elgabli,J.Park,A.S.Bedi,C.B.Issaid,M.Bennis,andV.Aggarwal, Hyperledger Member, IEEE Student Member, and IEEE ComSoc Student\n“Q-gadmm: Quantized group admm for communication efficient de- Member. centralizedmachinelearning,”IEEETransactionsonCommunications,\n2020. [69] D.DuaandC.Graff,“UCImachinelearningrepository,”2017. [70] M. M. Amiri and D. Gündüz, “Over-the-air machine learning at the\nwireless edge,” in 2019 IEEE 20th International Workshop on Signal\nProcessing Advances in Wireless Communications (SPAWC), pp. 1–5,\nIEEE,2019. [71] G. Zhu, Y. Wang, and K. Huang, “Broadband analog aggregation for Jan Seeger is a Ph.D.",
      "size": 896,
      "sentences": 9
    },
    {
      "id": 117,
      "content": "nternational Workshop on Signal\nProcessing Advances in Wireless Communications (SPAWC), pp. 1–5,\nIEEE,2019. [71] G. Zhu, Y. Wang, and K. Huang, “Broadband analog aggregation for Jan Seeger is a Ph.D. Researcher with the Tech-\nlow-latency federated edge learning,” IEEE Transactions on Wireless nical University of Munich, Munich, Germany. He\nCommunications,vol.19,no.1,pp.491–506,2019. is active in the areas of Internet of Things and\n[72] T.SeryandK.Cohen,“Onanaloggradientdescentlearningovermul- automationresearch,andhowsemantictechnologies\ntipleaccessfadingchannels,”IEEETransactionsonSignalProcessing, canimprovetheengineeringofautomationsystems. vol.68,pp.2897–2911,2020. He received the M.Sc. degree in computer science\n[73] J.A.NelderandR.Mead,“ASimplexMethodforFunctionMinimiza- fromtheTUMunich. tion,”TheComputerJournal,vol.7,pp.308–313,Jan.1965. [74] Siemens,“SIMATICBoxIPC,”new.siemens.com,2021. [75] MICROCHIP,“ENC28J60-Stand-AloneEthernetControllerwithSPI\nInterface,”2012.",
      "size": 986,
      "sentences": 12
    },
    {
      "id": 118,
      "content": "fromtheTUMunich. tion,”TheComputerJournal,vol.7,pp.308–313,Jan.1965. [74] Siemens,“SIMATICBoxIPC,”new.siemens.com,2021. [75] MICROCHIP,“ENC28J60-Stand-AloneEthernetControllerwithSPI\nInterface,”2012. [76] S.Chiaravalloti,F.Idzikowski,andŁukaszBudzisz,“Powerconsump-\ntionofWLANnetworkelements,”TKNTechnicalReportsSeries,2011. [77] P. Danzi, A. E. Kalor, R. B. Sorensen, A. K. Hagelskjaer, L. D.\nNguyen,C.Stefanovic,andP.Popovski,“Communicationaspectsofthe\nintegration of wireless iot devices with distributed ledger technology,”\nIEEENetwork,vol.34,no.1,pp.47–53,2020. Arne Bröring is a Senior Key Expert Research\n[78] S.Popli,R.K.Jha,andS.Jain,“Asurveyonenergyefficientnarrowband\nScientist at Siemens Technology in Munich. He\ninternetofthings(nbiot):architecture,applicationandchallenges,”IEEE\nreceived his PhD in 2012 from the University of\nAccess,vol.7,pp.16739–16776,2018. Twente (Netherlands).",
      "size": 895,
      "sentences": 9
    },
    {
      "id": 119,
      "content": "ns Technology in Munich. He\ninternetofthings(nbiot):architecture,applicationandchallenges,”IEEE\nreceived his PhD in 2012 from the University of\nAccess,vol.7,pp.16739–16776,2018. Twente (Netherlands). Dr. Bröring has contributed\n[79] O. Liberg, M. Sundberg, E. Wang, J. Bergman, and J. Sachs, Cellular\nto over 90 publications in the field of distributed\nInternetofthings:technologies,standards,andperformance.Academic\nsystemsandhasservedonvariousprogramcommit-\nPress,2017. teesandeditorialboards.Hisresearchinterestsrange\n[80] C.-H. Wei, G. Bianchi, and R.-G. Cheng, “Modeling and analysis\nfrom distributed system designs, over sensor net-\nof random access channels with bursty arrivals in ofdma wireless\nworks,andSemanticWeb,totheInternetofThings. networks,” IEEE transactions on wireless communications, vol. 14,\nAtSiemens,hehasbeeninchargeofthetechnical&\nno.4,pp.1940–1953,2014. scientificcoordinationoflargeEUresearchprojects\n[81] H. Akimaru and K. Kawashima, Teletraffic: theory and applications.",
      "size": 1000,
      "sentences": 8
    },
    {
      "id": 120,
      "content": "ns, vol. 14,\nAtSiemens,hehasbeeninchargeofthetechnical&\nno.4,pp.1940–1953,2014. scientificcoordinationoflargeEUresearchprojects\n[81] H. Akimaru and K. Kawashima, Teletraffic: theory and applications. (BIG IoT and IntellIoT). Before joining Siemens, Dr. Bröring worked for\nSpringerScience&BusinessMedia,2012. theEnvironmentalSystemsResearchInstituteinZurich,the52°NorthOpen\n[82] S. Nakamoto, “Bitcoin: A peer-to-peer electronic cash system,” tech. SourceInitiative,andledtheSensorWebandSimulationLabattheUniversity\nrep.,Manubot,2008. ofMünster. [83] S.Popli,R.K.Jha,andS.Jain,“Asurveyonenergyefficientnarrowband\ninternet of things (nbiot): Architecture, application and challenges,”\nIEEEAccess,vol.7,pp.16739–16776,2019. [84] L. D. Nguyen, A. E. Kalor, I. Leyva-Mayorga, and P. Popovski,\n“Trusted wireless monitoring based on distributed ledgers over nb-iot\nconnectivity,”IEEECommunicationsMagazine,vol.58,no.6,pp.77–\n83,2020.",
      "size": 925,
      "sentences": 10
    },
    {
      "id": 121,
      "content": ". D. Nguyen, A. E. Kalor, I. Leyva-Mayorga, and P. Popovski,\n“Trusted wireless monitoring based on distributed ledgers over nb-iot\nconnectivity,”IEEECommunicationsMagazine,vol.58,no.6,pp.77–\n83,2020. Chaouki Ben Issaid received the Diplôme\nd’Ingénieurwithmajorsineconomicsandfinancial\nengineeringfromtheEcolePolytechniquedeTunisie\n(EPT)in2013,themaster’sdegreeinappliedmath-\nematics and computational science (AMCS) and\nBeatrizSoret[M’11]receivedherM.Sc.andPh.D. the Ph.D. degree in statistics from King Abdullah\ndegreesinTelecommunicationsfromtheUniversity\nUniversity of Science and Technology (KAUST)\nof Malaga, Spain, in 2002 and 2010, respectively. in 2015 and 2019, respectively. He is currently a\nSheiscurrentlyanassociateprofessorattheDepart-\nPost-Doctoral Fellow with the Centre for Wireless\nmentofElectronicSystems,AalborgUniversity,and\nCommunications (CWC), University of Oulu.",
      "size": 887,
      "sentences": 6
    },
    {
      "id": 122,
      "content": "is currently a\nSheiscurrentlyanassociateprofessorattheDepart-\nPost-Doctoral Fellow with the Centre for Wireless\nmentofElectronicSystems,AalborgUniversity,and\nCommunications (CWC), University of Oulu. His\na Senior Research Fellow at the Communications\ncurrent research interests include communication-\nEngineeringDepartment,UniversityofMalaga.Her\nefficient distributed learning and machine learning applications for wireless\nresearch interests include LEO satellite communi-\ncommunication. cations, distributed and intelligent IoT, timing in\ncommunications,and5Gandpost-5Gsystems. === 페이지 16 ===\nIEEETRANSACTIONONGREENCOMMUNICATIONANDNETWORKING 16\nSumudu Samarakoon [M’12] received the B.Sc. Dr Mehdi Bennis is a full (tenured) Professor at\ndegree(honors)inelectronicandtelecommunication theCentreforWirelessCommunications,University\nengineering from the University of Moratuwa, Sri of Oulu, Finland, Academy of Finland Research\nLanka, in 2009, the M.Eng.",
      "size": 954,
      "sentences": 5
    },
    {
      "id": 123,
      "content": "nelectronicandtelecommunication theCentreforWirelessCommunications,University\nengineering from the University of Moratuwa, Sri of Oulu, Finland, Academy of Finland Research\nLanka, in 2009, the M.Eng. degree from the Asian Fellow and head of the intelligent connectivity and\nInstitute of Technology, Thailand, in 2011, and the networks/systemsgroup(ICON).Hismainresearch\nPh.D. degree in communication engineering from interestsareinradioresourcemanagement,hetero-\nthe University of Oulu, Finland, in 2017. He is geneousnetworks,gametheoryanddistributedma-\ncurrentlyanAssistantProfessorandamemberofin- chinelearningin5Gnetworksandbeyond.Hehas\ntelligentconnectivityandnetworks/systems(ICON) publishedmorethan200researchpapersininterna-\ngroupwiththeCentreforWirelessCommunications, tional conferences, journals and book chapters. He\nUniversity of Oulu.",
      "size": 848,
      "sentences": 4
    },
    {
      "id": 124,
      "content": "tconnectivityandnetworks/systems(ICON) publishedmorethan200researchpapersininterna-\ngroupwiththeCentreforWirelessCommunications, tional conferences, journals and book chapters. He\nUniversity of Oulu. His main research interests are hasbeentherecipientofseveralprestigiousawards\ninheterogeneousnetworks,smallcells,radioresourcemanagement,machine including the 2015 Fred W. Ellersick Prize from the IEEE Communications\nlearning at wireless edge, and game theory.",
      "size": 460,
      "sentences": 3
    },
    {
      "id": 125,
      "content": "restigiousawards\ninheterogeneousnetworks,smallcells,radioresourcemanagement,machine including the 2015 Fred W. Ellersick Prize from the IEEE Communications\nlearning at wireless edge, and game theory. Dr. Samarakoon received the Society,the2016BestTutorialPrizefromtheIEEECommunicationsSociety,\nBestPaperAwardattheEuropeanWirelessConference,ExcellenceAwards the 2017 EURASIP Best paper Award for the Journal of Wireless Commu-\nforinnovatorsandtheoutstandingdoctoralstudentintheRadioTechnology nications and Networks, the all-University of Oulu award for research, the\nUnit,CWC,UniversityofOulu,in2016.HeisalsoaGuestEditorofTelecom 2019 IEEE ComSoc Radio Communications Committee Early Achievement\n(MDPI) special issue on “millimeter wave communications and networking Awardandthe2020ClarviateHighlyCitedResearcherbytheWebofScience. in5Gandbeyond”.",
      "size": 846,
      "sentences": 3
    },
    {
      "id": 126,
      "content": "Radio Communications Committee Early Achievement\n(MDPI) special issue on “millimeter wave communications and networking Awardandthe2020ClarviateHighlyCitedResearcherbytheWebofScience. in5Gandbeyond”. Dr Bennis is an editor of IEEE TCOM and Specialty Chief Editor for\nData Science for Communications in the Frontiers in Communications and\nNetworksjournal.DrBennisisanIEEEFellow. Anis Elgabli received the B.Sc. degree in elec-\ntrical and electronic engineering from the Univer-\nsity of Tripoli, Libya, in 2004, the M.Eng. degree\nfrom UKM, Malaysia, in 2007, and the M.Sc. and\nPh.D. degrees from the Department of Electrical\nandComputerEngineering,PurdueUniversity,West Petar Popovski (Fellow, IEEE) is a Professor at\nLafayette,IN,USA,in2015and2018,respectively.",
      "size": 760,
      "sentences": 7
    },
    {
      "id": 127,
      "content": "the M.Sc. and\nPh.D. degrees from the Department of Electrical\nandComputerEngineering,PurdueUniversity,West Petar Popovski (Fellow, IEEE) is a Professor at\nLafayette,IN,USA,in2015and2018,respectively. Aalborg University, where he heads the section on\nHe is currently a Post-Doctoral Researcher at the ConnectivityandaVisitingExcellenceChairatthe\nCentre of Wireless Communications, University of UniversityofBremen.HereceivedhisDipl.-Ingand\nOulu.Hismainresearchinterestsincludeheteroge- M.Sc.degreesincommunicationengineeringfrom\nneousnetworks,radioresourcemanagement,vehic- theUniversityofSts.CyrilandMethodiusinSkopje\nularcommunications,videostreaming,anddistributed/decentralizedmachine and the Ph.D. degree from Aalborg University in\nlearningandoptimization. 2005. He is a Fellow of the IEEE. He received an\nERC Consolidator Grant (2015), the Danish Elite\nResearcher award (2016), IEEE Fred W. Ellersick\nprize (2016), IEEE Stephen O.",
      "size": 935,
      "sentences": 6
    },
    {
      "id": 128,
      "content": "learningandoptimization. 2005. He is a Fellow of the IEEE. He received an\nERC Consolidator Grant (2015), the Danish Elite\nResearcher award (2016), IEEE Fred W. Ellersick\nprize (2016), IEEE Stephen O. Rice prize (2018),\nTechnicalAchievementAwardfromtheIEEETechnicalCommitteeonSmart\nGrid Communications (2019), the Danish Telecommunication Prize (2020)\nand Villum Investigator Grant (2021). He is a Member at Large at the\nBoardofGovernorsinIEEECommunicationSociety,Vice-ChairoftheIEEE\nCommunication Theory Technical Committee and IEEE TRANSACTIONS\nON GREEN COMMUNICATIONS AND NETWORKING. He is currently\nan Area Editor of the IEEE TRANSACTIONS ON WIRELESS COM-\nMUNICATIONS and, from 2022, an Editor-in-Chief of IEEEE JOURNAL\nONSELECTEDAREASINCOMMUNICATIONS.Prof.Popovskiwasthe\nGeneral Chair for IEEE SmartGridComm 2018 and IEEE Communication\nTheory Workshop 2019. His research interests are in the area of wireless\nVivek Kulkarni He did a Master of Science in communication and communication theory.",
      "size": 997,
      "sentences": 8
    },
    {
      "id": 129,
      "content": "SmartGridComm 2018 and IEEE Communication\nTheory Workshop 2019. His research interests are in the area of wireless\nVivek Kulkarni He did a Master of Science in communication and communication theory. He authored the book “Wireless\n“CommunicationsEngineering”fromTechnicalUni- Connectivity: An Intuitive and Fundamental Guide”, published by Wiley in\nversity of Munich (TUM) in 2000 and an MBA 2020.\nin “Innovation and Business Creation” from TUM\nSchool of Management in 2014. In more than\n20 years of industrial experience, Vivek Kulkarni\nworked in several industry domains such as In-\ndustrialautomation,Renewableenergy,Carrierand\nMobilenetworkswithfocusoncommunicationpro-\ntocols,futurenetworkarchitecture,MPLS,GMPLS,\ncarrier-gradeEthernetandProfinet.Since2013,his\nmain focus is on Software Defined Networking, Industry 4.0 and Next-\nGeneration IoT.",
      "size": 850,
      "sentences": 4
    },
    {
      "id": 130,
      "content": "cusoncommunicationpro-\ntocols,futurenetworkarchitecture,MPLS,GMPLS,\ncarrier-gradeEthernetandProfinet.Since2013,his\nmain focus is on Software Defined Networking, Industry 4.0 and Next-\nGeneration IoT. Currently he is the Project Coordinator of the EU H2020\nproject IntellIoT (Next-Generation IoT project) and in the past he was\ncoordinatorofEU-projectSEMIoTICS(IoTproject)aswellastheEUH2020\nprojectVirtuWind,whichwasoneoftheprestigiousverticaldomainprojects\ninthe5GPPPphase-1projects.",
      "size": 483,
      "sentences": 2
    }
  ]
}